y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
#+TITLE: MA1008 Introduction to Computational Thinking Cheat Sheet
#+AUTHOR: Hankertrix
#+STARTUP: showeverything
#+OPTIONS: toc:2
#+LATEX_HEADER: \usepackage{array}

* Definitions

** Programming
Programming is the process of:
- Implementing a representation of the solution for the computer to execute
- Taking an algorithm and encoding it using certain programming language

** Programming language
- A medium through which programmer may give instructions to a computer.
- It must support certain control constructs and data types needed to implement algorithms.

** High-level programming languages
- Provide abstraction from the internal operating detail of the computer.
- Enable the programmers to focus on solving the problem.
- Make the process of developing the algorithm simpler

** Microprocessor
The microprocessor in a computer is a digital device consisting of electronic components like transistors that operate in two states (either *on* or *off*).

*** The two states as voltage levels
- Low voltage (0 volt)
- High voltage (depends on the power supply used by the microprocessor)

*** The two states represented in binary
- 0 for low voltage
- 1 for high voltage

** Datum
A datum is a number.

** Byte
1 byte = 8 bits (2 hex digits)

** Nibble
1 nibble = 4 bits (1 hex digit)

** Word
1 word = 16 or 32 bits depending on CPU architecture (32 bits is used in this course)

** DWord
1 DWord = 64 bits

** Algorithms
- Algorithms are the method, procedure, or steps for solving a problem.
- They are the step-by-step instructions given to the computer on how to solve a given problem.

*** Expressing an algorithm
- Must be unambiguous, every step must be clear and precise
- Specify the order of steps precisely (sequence)
- Consider all possible decision points (branching and looping)
- Must terminate (no matter which representation is used)

@@latex: \newpage@@

** Flow chart
A representation of an algorithm using diagrams for effective visualisation.

#+ATTR_LATEX: :environment tabular :align |c|m{22em}|
|----------------------+----------------------------------------------------------------------------------------------|
| *Name*               | *Use in flowchart*                                                                           |
|----------------------+----------------------------------------------------------------------------------------------|
| Oval                 | Denotes the beginning or end of a program                                                    |
|----------------------+----------------------------------------------------------------------------------------------|
| Flow line (an arrow) | Denotes the direction of logic flow in a program                                             |
|----------------------+----------------------------------------------------------------------------------------------|
| Parallelogram        | Denotes either an input operation (INPUT) or an output operation (PRINT)                     |
|----------------------+----------------------------------------------------------------------------------------------|
| Rectangle            | Denotes a process to be carried out, like addition                                           |
|----------------------+----------------------------------------------------------------------------------------------|
| Diamond              | Denotes a decision or branch to be made; the program should continue along one of two routes |
|----------------------+----------------------------------------------------------------------------------------------|

** Pseudocode
Directly uses informal English to describe an algorithm step by step with one step per line. It uses the structural conventions of a normal programming language, but is intended for human reading rather than machine reading. Syntax doesn't matter in pseudocode.

*** Guidelines
- Write one statement per line only
- Capitalise the keywords
- Indent to show hierarchy
- End multi-line structures like loops and if statements
- Keep statements programming-language independent

** Variable
A variable is like a labelled box that contains a value inside it. Each variable has its name, like ~price_of_chicken_rice~ and value, like ~2.8~.

*** Why use variables?
- Reuse names instead of values, which is helpful in keeping track of useful information without needing to remember a bunch of numbers
- Easier to change or refactor the code later

** Expressions
Expressions are anything that produces or returns a value. It usually consists of a combination of values (literals, variables, etc) and operations (operators, functions, etc).

*** Examples
- 3.14
- 100 * 15
- Result * 100

** Assignment operator (=)
The assignment operator binds variables and values. The "=" sign is the *assignment operator*, not the equality in mathematics.

*** Syntax
Left-Hand Side (LHS) = Right-Hand Side (RHS)

This means:
- Evaluate the expression on the right-hand side
- Take the resulting value and assign it to the name (variable) on the left-hand side

** Arithmetic operators (~+, -, *, /~)
- Used in common arithmetic
- Each arithmetic operator is a mathematical function that takes one or two operands and performs a calculation on them
- Most computer languages contain a set of such operators that can be used within equations to perform a number of types of sequential calculation

** Identifiers
A name given to an entity in a programming language.
- Helps in differentiating one entity from another
- Name of the entity must be unique to be identified during the execution of the program

*** Attributes of identifiers in Python
<<sec:python-identifiers>>
- Uppercase and lower case letters A through Z
- The underscore "_"
- The digits 0 through 9
- However, the first character cannot be a digit
- Identifiers are case-sensitive

*** Naming conventions in Python
- Variables names should be in lowercase, with words separated by underscores as necessary to improve readability (~snake_case~).

** Keywords
Keywords are special words that are reserved by a programming language. Programmers should not use keywords to name things.

** Conditional statement
A conditional statement performs different actions depending on whether the condition evaluates to true or false.

** Conditional expression (Boolean expression)
A conditional expression may be composed of a combination of the Boolean constants True or False, Boolean-typed variables, Boolean-valued operators, and Boolean-valued functions.

** Nested ~if~ statements
A nested ~if~ statement is an ~if~ statement inside another ~if~ statement.

** Relational operators (~==, !=, <, <=, >, >=~)
A relational operator compares two numbers (float or int) and returns a Boolean value of either True or False.

#+ATTR_LATEX: :environment tabular :align c|c|c
| Relational Operator | Meaning                  | Example  |
|---------------------+--------------------------+----------|
| ==                  | Equal to                 | a == 1   |
| !=                  | Not equal to             | b != 2   |
| <                   | Less than                | c < 3    |
| <=                  | Less than or equal to    | d <= 4   |
| >                   | Greater than             | f > 5.0  |
| >=                  | Greater than or equal to | g >= 6.0 |

