y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex
% Created 2024-10-11 Fri 20:08
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{array}
\author{Hankertrix}
\date{\today}
\title{MA1008 Introduction to Computational Thinking Cheat Sheet}
\hypersetup{
 pdfauthor={Hankertrix},
 pdftitle={MA1008 Introduction to Computational Thinking Cheat Sheet},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents \clearpage
\section{Definitions}
\label{sec:orge2401aa}

\subsection{Programming}
\label{sec:orgffb1201}
Programming is the process of:
\begin{itemize}
\item Implementing a representation of the solution for the computer to execute
\item Taking an algorithm and encoding it using certain programming language
\end{itemize}

\subsection{Programming language}
\label{sec:orgf601263}
\begin{itemize}
\item A medium through which programmer may give instructions to a computer.
\item It must support certain control constructs and data types needed to implement algorithms.
\end{itemize}

\subsection{High-level programming languages}
\label{sec:org223ac54}
\begin{itemize}
\item Provide abstraction from the internal operating detail of the computer.
\item Enable the programmers to focus on solving the problem.
\item Make the process of developing the algorithm simpler
\end{itemize}

\subsection{Microprocessor}
\label{sec:orgfc5d627}
The microprocessor in a computer is a digital device consisting of electronic components like transistors that operate in two states (either \textbf{on} or \textbf{off}).

\subsubsection{The two states as voltage levels}
\label{sec:org3d27043}
\begin{itemize}
\item Low voltage (0 volt)
\item High voltage (depends on the power supply used by the microprocessor)
\end{itemize}

\subsubsection{The two states represented in binary}
\label{sec:org655a4dc}
\begin{itemize}
\item 0 for low voltage
\item 1 for high voltage
\end{itemize}

\subsection{Datum}
\label{sec:org00b6e0e}
A datum is a number.

\subsection{Byte}
\label{sec:org29308c1}
1 byte = 8 bits (2 hex digits)

\subsection{Nibble}
\label{sec:org3254b8c}
1 nibble = 4 bits (1 hex digit)

\subsection{Word}
\label{sec:org398b454}
1 word = 16 or 32 bits depending on CPU architecture (32 bits is used in this course)

\subsection{DWord}
\label{sec:org98da38f}
1 DWord = 64 bits

\subsection{Algorithms}
\label{sec:orgf3ef1e1}
\begin{itemize}
\item Algorithms are the method, procedure, or steps for solving a problem.
\item They are the step-by-step instructions given to the computer on how to solve a given problem.
\end{itemize}

\subsubsection{Expressing an algorithm}
\label{sec:org444cd62}
\begin{itemize}
\item Must be unambiguous, every step must be clear and precise
\item Specify the order of steps precisely (sequence)
\item Consider all possible decision points (branching and looping)
\item Must terminate (no matter which representation is used)
\end{itemize}

 \newpage

\subsection{Flow chart}
\label{sec:org6e1a9f5}
A representation of an algorithm using diagrams for effective visualisation.

\begin{center}
\begin{tabular}{|c|m{22em}|}
\hline
\textbf{Name} & \textbf{Use in flowchart}\\[0pt]
\hline
Oval & Denotes the beginning or end of a program\\[0pt]
\hline
Flow line (an arrow) & Denotes the direction of logic flow in a program\\[0pt]
\hline
Parallelogram & Denotes either an input operation (INPUT) or an output operation (PRINT)\\[0pt]
\hline
Rectangle & Denotes a process to be carried out, like addition\\[0pt]
\hline
Diamond & Denotes a decision or branch to be made; the program should continue along one of two routes\\[0pt]
\hline
\end{tabular}
\end{center}

\subsection{Pseudocode}
\label{sec:org66235ad}
Directly uses informal English to describe an algorithm step by step with one step per line. It uses the structural conventions of a normal programming language, but is intended for human reading rather than machine reading. Syntax doesn't matter in pseudocode.

\subsubsection{Guidelines}
\label{sec:org7caa3ec}
\begin{itemize}
\item Write one statement per line only
\item Capitalise the keywords
\item Indent to show hierarchy
\item End multi-line structures like loops and if statements
\item Keep statements programming-language independent
\end{itemize}

\subsection{Variable}
\label{sec:org833b71e}
A variable is like a labelled box that contains a value inside it. Each variable has its name, like \texttt{price\_of\_chicken\_rice} and value, like \texttt{2.8}.

\subsubsection{Why use variables?}
\label{sec:orgbc7b383}
\begin{itemize}
\item Reuse names instead of values, which is helpful in keeping track of useful information without needing to remember a bunch of numbers
\item Easier to change or refactor the code later
\end{itemize}

\subsection{Expressions}
\label{sec:org216e1ed}
Expressions are anything that produces or returns a value. It usually consists of a combination of values (literals, variables, etc) and operations (operators, functions, etc).

\subsubsection{Examples}
\label{sec:org1c986d2}
\begin{itemize}
\item 3.14
\item 100 * 15
\item Result * 100
\end{itemize}

\subsection{Assignment operator (=)}
\label{sec:orga0b8121}
The assignment operator binds variables and values. The "=" sign is the \textbf{assignment operator}, not the equality in mathematics.

\subsubsection{Syntax}
\label{sec:orgbbfe316}
Left-Hand Side (LHS) = Right-Hand Side (RHS)

This means:
\begin{itemize}
\item Evaluate the expression on the right-hand side
\item Take the resulting value and assign it to the name (variable) on the left-hand side
\end{itemize}

\subsection{Arithmetic operators (\texttt{+, -, *, /})}
\label{sec:org3364782}
\begin{itemize}
\item Used in common arithmetic
\item Each arithmetic operator is a mathematical function that takes one or two operands and performs a calculation on them
\item Most computer languages contain a set of such operators that can be used within equations to perform a number of types of sequential calculation
\end{itemize}

\subsection{Identifiers}
\label{sec:org71c10c6}
A name given to an entity in a programming language.
\begin{itemize}
\item Helps in differentiating one entity from another
\item Name of the entity must be unique to be identified during the execution of the program
\end{itemize}

\subsubsection{Attributes of identifiers in Python}
\label{sec:org179a349}
\label{org72b2d39}
\begin{itemize}
\item Uppercase and lower case letters A through Z
\item The underscore "\_"
\item The digits 0 through 9
\item However, the first character cannot be a digit
\item Identifiers are case-sensitive
\end{itemize}

\subsubsection{Naming conventions in Python}
\label{sec:orgc20bfaa}
\begin{itemize}
\item Variables names should be in lowercase, with words separated by underscores as necessary to improve readability (\texttt{snake\_case}).
\end{itemize}

\subsection{Keywords}
\label{sec:orge60bf80}
Keywords are special words that are reserved by a programming language. Programmers should not use keywords to name things.

\subsection{Conditional statement}
\label{sec:orgb776c67}
A conditional statement performs different actions depending on whether the condition evaluates to true or false.

\subsection{Conditional expression (Boolean expression)}
\label{sec:org4d05404}
A conditional expression may be composed of a combination of the Boolean constants True or False, Boolean-typed variables, Boolean-valued operators, and Boolean-valued functions.

\subsection{Nested \texttt{if} statements}
\label{sec:orgac317b6}
A nested \texttt{if} statement is an \texttt{if} statement inside another \texttt{if} statement.

\subsection{Relational operators (\texttt{==, !=, <, <=, >, >=})}
\label{sec:orgb171448}
A relational operator compares two numbers (float or int) and returns a Boolean value of either True or False.

\begin{center}
\begin{tabular}{c|c|c}
Relational Operator & Meaning & Example\\[0pt]
\hline
== & Equal to & a == 1\\[0pt]
!= & Not equal to & b != 2\\[0pt]
< & Less than & c < 3\\[0pt]
<= & Less than or equal to & d <= 4\\[0pt]
> & Greater than & f > 5.0\\[0pt]
>= & Greater than or equal to & g >= 6.0\\[0pt]
\end{tabular}
\end{center}
