y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
** Program execution and control flow
- Control flow controls which instruction should be executed next.
- By default, program instructions are executed one after another.
- However, some structures can alter the flow, like selection.
- Selection (branching) occurs when an "algorithm" makes a choice to do one of two or more things.
- The flow control in a program is, in essence, logic.
- When writing or reading a program, ensure that you could understand the flow, i.e., what should be executed next for every step.

** Logical operators (Boolean operators)
Logical operators connect Boolean values and expressions and *return* a Boolean value as a result.

#+ATTR_LATEX: :enviroment tabular :align c|c|c
| Operator | Example                           | Meaning                             |
|----------+-----------------------------------+-------------------------------------|
| *not*    | *not* number < 0                  | Change True to False, or vice versa |
| *and*    | (num1 > num2) *and* (num2 > num3) | Return True only if *both* are True |
| *or*     | (num1 > num2) *or* (num2 > num3)  | Return True if *either* one is True |

@@latex: \newpage@@

** Looping
A computer program can dynamically choose how many times it repeats certain instructions during the program runtime.

*** General structure of a loop
1. *Initialise* the loop control variable.
2. *Test*: continue the loop or not?
3. *Loop body*: main computation being repeated.
4. *Update*: Modify the value of the loop control variable so that next time we test, we may exit the loop.

Sometimes, a loop may not have all of them, such as an infinite loop, where the test condition is always true.

*** Types of loops
1. Counter-controlled loop
   The number of repetitions can be *known* before the loop body starts. This loop just repeats the loop on each element in a preset sequence.

2. Sentinel-controlled loop
   The number of repetitions is *not known* before the loop body starts. Hence, a sentinel value that differs from normal data, like -1, is used to stop the loop.

** Iteration
A one-time execution of a loop body is referred to as an iteration of the loop.

** Nested loop
A nested loop is a loop inside another loop. An outer loop may enclose an inner loop.

@@latex: \newpage@@

** Abstraction
- *Simplifies* things
- Identifies what is *important* without worrying too much about the details
- Allows us to *manage complexity*.

*** Why is abstraction important?
- A key element of computing is the complexity of the systems we build.
- Abstraction provides a means to distil what is essential, giving a manageable approach to create computational solutions.
- Abstractions are sometimes represented as *layers* or *hierarchies*, allowing us to view things at different degrees of detail.

** String
A string is a sequence of characters. The sequence of characters is important and is maintained.

** ASCII
- Uses 8 bits to store a character.
- 2^{8} = 256 different characters.

** Unicode
- An extension of ASCII
- Able to include more characters
- Uses 16 bits to store a character
- 2^{16} = 65,536 characters
- The Unicode space is divided into 17 planes.
- Each plane contains 65,536 code points (16-bit).
- Total of 1,114,112 characters, 96,000 used.

** Parameters
Parameters are the variables names used in the function definition to hold the function inputs.

** Arguments
Arguments are the actual values passed to the function when calling the function.

** Function
- A function is a *piece of code* that performs some operation.
- The details are hidden (encapsulated) and only it's interface is exposed.
- It is a way to arrange a program to make it easier to understand.
- A function has arguments as inputs and may return one output.
- A function can have multiple ~return~ statements.
- The first executed ~return~ statement *ends the function*.
- Functions can also be called from other functions, and it works the same as users calling functions.
  - There is no limit to the "depth" of multiple function calls.
  - Deep function calls could make following the flow of a program difficult.

*** In mathematics
A function performs some operation and returns *one* value or thing.

*** In Python
Python functions "*encapsulates*" the performance of its particular operation, so they can be used by others.
- A function represents a single operation to be performed.
- A function takes zero or more arguments as input.
- A function returns one value or object as output.

*** Importance of functions
- Abstraction
- Divide-and-conquer problem-solving
- Reuse
- Sharing
- Security
- Simplification and readability

*** Principles of writing a function
- A function should only *do one thing*. If it does too many things, it should be broken down into multiple functions (refactored).
- A function should be *readable*. If you write it, it should be readable. Give comments when necessary.
- A function should be *reusable*. If it does one thing well, then when a similar situation (in another program) occurs, use it there as well.
- A function should be *complete*. A function should check for all the cases where it might be invoked. Check for potential errors.
- A function should *not be too long*. This is kind of synonymous with "*does one thing*". Use it as a measurement of doing too much.

** Procedures
- Procedures are functions *without return statements*.
- In other words, they don't have an output.
- In Python, procedures will return ~None~.
- Procedures are often used to perform some operation, like printing output, store a file, etc.
- A return statement is not always required in functions.

** Method
- A method is a variation on a function.
- It represents a program and has input arguments and output.
- Unlike a function, it is applied in the context of a *particular object*.
- This is indicated by the *dot notation* invocation.

*** Method chaining
Methods can be chained together. For example:
#+NAME: method-chaining
#+begin_src python :results output :exports both
string = "Python is cool!"
print(string.upper())
print(string.upper().find("C"))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: method-chaining
: PYTHON IS COOL!
: 10

** Composite type
- Composite type is a data type which is constructed (composed) using primitive and other composite types.
- A composite type is basically a new data type that is made from existing ones.
- Some examples in Python include tuples, lists, dictionaries (hash maps in most other programming languages) and strings.

** Data structures
- They have particular ways of storing data to make some operations easier or more efficient.
  - They are tuned for certain tasks, and they are often associated with algorithms.
- Different data structures have different characteristics.
  - One suited to solving a *certain problem* may not be suited for another problem.
- A few examples include arrays, linked lists, hash maps and trees.

*** Built-in data structures
Data structures that are so common that they are provided by most programming languages by default.

