y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsection{Program execution and control flow}
\label{sec:org57ca973}
\begin{itemize}
\item Control flow controls which instruction should be executed next.
\item By default, program instructions are executed one after another.
\item However, some structures can alter the flow, like selection.
\item Selection (branching) occurs when an "algorithm" makes a choice to do one of two or more things.
\item The flow control in a program is, in essence, logic.
\item When writing or reading a program, ensure that you could understand the flow, i.e., what should be executed next for every step.
\end{itemize}

\subsection{Logical operators (Boolean operators)}
\label{sec:orgfa45b64}
Logical operators connect Boolean values and expressions and \textbf{return} a Boolean value as a result.

\begin{center}
\begin{tabular}{c|c|c}
Operator & Example & Meaning\\[0pt]
\hline
\textbf{not} & \textbf{not} number < 0 & Change True to False, or vice versa\\[0pt]
\textbf{and} & (num1 > num2) \textbf{and} (num2 > num3) & Return True only if \textbf{both} are True\\[0pt]
\textbf{or} & (num1 > num2) \textbf{or} (num2 > num3) & Return True if \textbf{either} one is True\\[0pt]
\end{tabular}
\end{center}

 \newpage

\subsection{Looping}
\label{sec:org5c55f43}
A computer program can dynamically choose how many times it repeats certain instructions during the program runtime.

\subsubsection{General structure of a loop}
\label{sec:orge28667d}
\begin{enumerate}
\item \textbf{Initialise} the loop control variable.
\item \textbf{Test}: continue the loop or not?
\item \textbf{Loop body}: main computation being repeated.
\item \textbf{Update}: Modify the value of the loop control variable so that next time we test, we may exit the loop.
\end{enumerate}

Sometimes, a loop may not have all of them, such as an infinite loop, where the test condition is always true.

\subsubsection{Types of loops}
\label{sec:org73fee0a}
\begin{enumerate}
\item Counter-controlled loop
The number of repetitions can be \textbf{known} before the loop body starts. This loop just repeats the loop on each element in a preset sequence.

\item Sentinel-controlled loop
The number of repetitions is \textbf{not known} before the loop body starts. Hence, a sentinel value that differs from normal data, like -1, is used to stop the loop.
\end{enumerate}

\subsection{Iteration}
\label{sec:org71d0bc1}
A one-time execution of a loop body is referred to as an iteration of the loop.

\subsection{Nested loop}
\label{sec:orgbbbf19b}
A nested loop is a loop inside another loop. An outer loop may enclose an inner loop.

 \newpage

\subsection{Abstraction}
\label{sec:orgd456fce}
\begin{itemize}
\item \textbf{Simplifies} things
\item Identifies what is \textbf{important} without worrying too much about the details
\item Allows us to \textbf{manage complexity}.
\end{itemize}

\subsubsection{Why is abstraction important?}
\label{sec:org88e1df7}
\begin{itemize}
\item A key element of computing is the complexity of the systems we build.
\item Abstraction provides a means to distil what is essential, giving a manageable approach to create computational solutions.
\item Abstractions are sometimes represented as \textbf{layers} or \textbf{hierarchies}, allowing us to view things at different degrees of detail.
\end{itemize}

\subsection{String}
\label{sec:org306fb60}
A string is a sequence of characters. The sequence of characters is important and is maintained.

\subsection{ASCII}
\label{sec:org41e0f23}
\begin{itemize}
\item Uses 8 bits to store a character.
\item 2\textsuperscript{8} = 256 different characters.
\end{itemize}

\subsection{Unicode}
\label{sec:org9deb43d}
\begin{itemize}
\item An extension of ASCII
\item Able to include more characters
\item Uses 16 bits to store a character
\item 2\textsuperscript{16} = 65,536 characters
\item The Unicode space is divided into 17 planes.
\item Each plane contains 65,536 code points (16-bit).
\item Total of 1,114,112 characters, 96,000 used.
\end{itemize}

\subsection{Parameters}
\label{sec:org0a0cf54}
Parameters are the variables names used in the function definition to hold the function inputs.

\subsection{Arguments}
\label{sec:org539be3b}
Arguments are the actual values passed to the function when calling the function.

\subsection{Function}
\label{sec:org512fc4e}
\begin{itemize}
\item A function is a \textbf{piece of code} that performs some operation.
\item The details are hidden (encapsulated) and only it's interface is exposed.
\item It is a way to arrange a program to make it easier to understand.
\item A function has arguments as inputs and may return one output.
\item A function can have multiple \texttt{return} statements.
\item The first executed \texttt{return} statement \textbf{ends the function}.
\item Functions can also be called from other functions, and it works the same as users calling functions.
\begin{itemize}
\item There is no limit to the "depth" of multiple function calls.
\item Deep function calls could make following the flow of a program difficult.
\end{itemize}
\end{itemize}

\subsubsection{In mathematics}
\label{sec:org6132aca}
A function performs some operation and returns \textbf{one} value or thing.

\subsubsection{In Python}
\label{sec:org82082f1}
Python functions "\textbf{encapsulates}" the performance of its particular operation, so they can be used by others.
\begin{itemize}
\item A function represents a single operation to be performed.
\item A function takes zero or more arguments as input.
\item A function returns one value or object as output.
\end{itemize}

\subsubsection{Importance of functions}
\label{sec:org35e04bf}
\begin{itemize}
\item Abstraction
\item Divide-and-conquer problem-solving
\item Reuse
\item Sharing
\item Security
\item Simplification and readability
\end{itemize}

\subsubsection{Principles of writing a function}
\label{sec:org0905ef1}
\begin{itemize}
\item A function should only \textbf{do one thing}. If it does too many things, it should be broken down into multiple functions (refactored).
\item A function should be \textbf{readable}. If you write it, it should be readable. Give comments when necessary.
\item A function should be \textbf{reusable}. If it does one thing well, then when a similar situation (in another program) occurs, use it there as well.
\item A function should be \textbf{complete}. A function should check for all the cases where it might be invoked. Check for potential errors.
\item A function should \textbf{not be too long}. This is kind of synonymous with "\textbf{does one thing}". Use it as a measurement of doing too much.
\end{itemize}

\subsection{Procedures}
\label{sec:orgf256550}
\begin{itemize}
\item Procedures are functions \textbf{without return statements}.
\item In other words, they don't have an output.
\item In Python, procedures will return \texttt{None}.
\item Procedures are often used to perform some operation, like printing output, store a file, etc.
\item A return statement is not always required in functions.
\end{itemize}

\subsection{Method}
\label{sec:org6023599}
\begin{itemize}
\item A method is a variation on a function.
\item It represents a program and has input arguments and output.
\item Unlike a function, it is applied in the context of a \textbf{particular object}.
\item This is indicated by the \textbf{dot notation} invocation.
\end{itemize}

\subsubsection{Method chaining}
\label{sec:orgdbff7ca}
Methods can be chained together. For example:
\begin{minted}[]{python}
string = "Python is cool!"
print(string.upper())
print(string.upper().find("C"))
\end{minted}

 \noindent Output:

\begin{verbatim}
PYTHON IS COOL!
10
\end{verbatim}

\subsection{Composite type}
\label{sec:org249f6d8}
\begin{itemize}
\item Composite type is a data type which is constructed (composed) using primitive and other composite types.
\item A composite type is basically a new data type that is made from existing ones.
\item Some examples in Python include tuples, lists, dictionaries (hash maps in most other programming languages) and strings.
\end{itemize}

\subsection{Data structures}
\label{sec:org25ca229}
\begin{itemize}
\item They have particular ways of storing data to make some operations easier or more efficient.
\begin{itemize}
\item They are tuned for certain tasks, and they are often associated with algorithms.
\end{itemize}
\item Different data structures have different characteristics.
\begin{itemize}
\item One suited to solving a \textbf{certain problem} may not be suited for another problem.
\end{itemize}
\item A few examples include arrays, linked lists, hash maps and trees.
\end{itemize}

\subsubsection{Built-in data structures}
\label{sec:org6e60b8f}
Data structures that are so common that they are provided by most programming languages by default.
