y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
*** User-defined data structures
Data structures (classes in object-oriented programming) that are designed for a particular task.

** Mutability
The ability to change.

** Mutable
- After creation of the object, the object *can* be changed.
- *Lists* are mutable as you *can* change them after creating them.

** Immutable
- After creation of the object, the object *cannot* be changed.
- *Strings* are immutable as you *cannot* change them after creating them.

** Decomposition
Decomposition is the process of *breaking down* a complex problem into smaller manageable parts (sub-problems).
- Each sub-problem can then be examined or solved *individually*, as they are simpler to work with.
- It is a natural way to solve problems.
- It is also known as Divide-and-Conquer.

*** Importance of decomposition
1. Solve complex problems
   - If a complex problem is not decomposed, it is much harder to solve at once. Sub-problems are usually easy to tackle.

2. Enable collaboration and teamwork.
   - Each sub-problem can be solved by different parties.

3. Analysis
   - Decomposition forces you to analyse your problem from different aspects.

** Divide-and-Conquer
1. Decompose a problem into several sub-problems.
2. Solve each sub-problem.
3. Compose the solution to the sub-problems.

*Recursion* naturally supports divide-and-conquer.

** Recursive function
A recursive function is a function that invokes itself.

*** General form
- A recursive function is like a mathematical proof by induction, where you solve the problem for the base case, then solve the problem for the general until it reaches the base case.
- Generally, you will have a base case inside an if block where the function will return a value to stop the recursion.
- Then you will have the general case where the function will call itself on a new value.
- This general case will continue until the function reaches the base case and finally returns a value to stop the recursion.

*** Writing a recursive function
1. Determine the interface (signature) of the function
   - How many *parameters*? What are they?
   - What is the *return object*?
   - What is the *functionality* of the function?

2. Assume you have finished the implementation of the function
3. Develop the function body
   - Base case (Conquer)
     Solve the primitive case, and then return the result
   - Recursive step (Divide)
     - Decompose the problem into sub-problems (with the same structure)
     - Call the function to solve each sub-problem
     - Compose the final result from the sub-problems, and then return it.

*** Performance
A recursive function may be inefficient as it usually has redundant computation.

** Binary tree
- A binary tree is a type of data structure that is made of nodes.
- It looks like an upside-down or inverted tree.
- The first node in the tree is called the root node, and there is only *one* of them
- The nodes that are connected to nodes below them are called *parent nodes*.
- The nodes that are only connected to nodes above them are called *leaf nodes*. These nodes have nothing after them and hence are like the leaves of an actual tree.
- Each node can only be connected to 2 nodes below them, hence the name binary tree.

** Complete Binary Tree (CBT)
A complete binary tree is a binary tree where every parent node has *exactly two* child nodes.

** Exceptions (Python-specific concept)
- Exceptions in Python can be thought of as *errors*.
- It usually means that the Python program has reached an *"exceptional"* situation that it *doesn't know* how to handle.

*** Why do we need exception handling?
- Most modern languages provide ways to deal with *"exceptional situations"*.
- Dealing with problems
- To try to capture certain situations or failures and deal with them gracefully.

*** What counts as an exception?
1. Errors
   - Indexing past the end of a list
   - Trying to open a non-existent file
   - Fetching a non-existent key from a dictionary, etc.

2. Events (not really errors)
   - Search algorithm doesn't find a value
   - Mail message arrives, queue event occurs

*** General idea
1. Keep *watching* a particular section of code.
2. If we get an exception, look for a catcher that can *handle* that kind of exception.
3. If *found* handle it.
4. Otherwise, let Python handle it (which usually halts the program).

** Pattern
A pattern is a discernible regularity.
- The elements of a pattern repeat *predictably*.

In computational thinking, a pattern is the spotted *similarities* and *common differences* between problems.

** Pattern recognition
Pattern recognition involves finding the similarities or patterns among small, decomposed problems, which can help in solving complex problems more efficiently.

*** Importance
- Patterns make problems simpler and easier to solve.
- Problems are easier to solve when they share patterns, as we can use the same problem-solving solution wherever the pattern exists.
- The more patterns we can find, the easier and quicker out problem-solving will be.

*** How to recognise patterns?
1. Identifying common elements or features in problems.
2. Identifying and interpreting common differences between problems.
3. Identifying individual elements within problems.
4. Describing patterns that have been identified.
5. Making predictions based on identified patterns.

@@latex: \newpage@@

** Iterative accumulation
Iterative accumulation accumulate *target values* by iterating over them.

*** Important elements
1. Result variable to store the accumulation result.
2. A for loop.
3. A target value in each iteration to add to the result variable.

** File
- A *collection of data* that is stored on *secondary storage*, like a disk.
- Accessing a file means establishing a *connection* between the *file* and the *program* and moving data between the two.
- When *opening* a file, you create a *file object* or *file stream* that is a connection between the file and the program.

*** Types of files
1. Text files
   - Organised as ASCII or Unicode characters
   - Generally human-readable, which is useful for certain file types
   - Text files are inefficient to store as each character takes up a few bits.
     - ASCII: 8 bits → 1 byte
     - Unicode: 32 bits → 4 bytes

2. Binary files
   - All the information is based on specific encodings
   - Not human-readable and contains non-readable information
   - It is a custom format that has more efficient storage

*** Current file position
- Every file maintains a *current file position*.
- It is the *current position* in the file and indicates what will be read next.
- It is set by the file mode.

