y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsubsection{User-defined data structures}
\label{sec:org9843ac3}
Data structures (classes in object-oriented programming) that are designed for a particular task.

\subsection{Mutability}
\label{sec:org10d3dbc}
The ability to change.

\subsection{Mutable}
\label{sec:orgef7038b}
\begin{itemize}
\item After creation of the object, the object \textbf{can} be changed.
\item \textbf{Lists} are mutable as you \textbf{can} change them after creating them.
\end{itemize}

\subsection{Immutable}
\label{sec:orgfdb2670}
\begin{itemize}
\item After creation of the object, the object \textbf{cannot} be changed.
\item \textbf{Strings} are immutable as you \textbf{cannot} change them after creating them.
\end{itemize}

\subsection{Decomposition}
\label{sec:orgf41490e}
Decomposition is the process of \textbf{breaking down} a complex problem into smaller manageable parts (sub-problems).
\begin{itemize}
\item Each sub-problem can then be examined or solved \textbf{individually}, as they are simpler to work with.
\item It is a natural way to solve problems.
\item It is also known as Divide-and-Conquer.
\end{itemize}

\subsubsection{Importance of decomposition}
\label{sec:org63fab17}
\begin{enumerate}
\item Solve complex problems
\begin{itemize}
\item If a complex problem is not decomposed, it is much harder to solve at once. Sub-problems are usually easy to tackle.
\end{itemize}

\item Enable collaboration and teamwork.
\begin{itemize}
\item Each sub-problem can be solved by different parties.
\end{itemize}

\item Analysis
\begin{itemize}
\item Decomposition forces you to analyse your problem from different aspects.
\end{itemize}
\end{enumerate}

\subsection{Divide-and-Conquer}
\label{sec:org57e7adb}
\begin{enumerate}
\item Decompose a problem into several sub-problems.
\item Solve each sub-problem.
\item Compose the solution to the sub-problems.
\end{enumerate}

\textbf{Recursion} naturally supports divide-and-conquer.

\subsection{Recursive function}
\label{sec:org7423c1e}
A recursive function is a function that invokes itself.

\subsubsection{General form}
\label{sec:orge83c0e7}
\begin{itemize}
\item A recursive function is like a mathematical proof by induction, where you solve the problem for the base case, then solve the problem for the general until it reaches the base case.
\item Generally, you will have a base case inside an if block where the function will return a value to stop the recursion.
\item Then you will have the general case where the function will call itself on a new value.
\item This general case will continue until the function reaches the base case and finally returns a value to stop the recursion.
\end{itemize}

\subsubsection{Writing a recursive function}
\label{sec:org95f81ae}
\begin{enumerate}
\item Determine the interface (signature) of the function
\begin{itemize}
\item How many \textbf{parameters}? What are they?
\item What is the \textbf{return object}?
\item What is the \textbf{functionality} of the function?
\end{itemize}

\item Assume you have finished the implementation of the function
\item Develop the function body
\begin{itemize}
\item Base case (Conquer)
Solve the primitive case, and then return the result
\item Recursive step (Divide)
\begin{itemize}
\item Decompose the problem into sub-problems (with the same structure)
\item Call the function to solve each sub-problem
\item Compose the final result from the sub-problems, and then return it.
\end{itemize}
\end{itemize}
\end{enumerate}

\subsubsection{Performance}
\label{sec:org1121da7}
A recursive function may be inefficient as it usually has redundant computation.

\subsection{Binary tree}
\label{sec:orgf0c20e5}
\begin{itemize}
\item A binary tree is a type of data structure that is made of nodes.
\item It looks like an upside-down or inverted tree.
\item The first node in the tree is called the root node, and there is only \textbf{one} of them
\item The nodes that are connected to nodes below them are called \textbf{parent nodes}.
\item The nodes that are only connected to nodes above them are called \textbf{leaf nodes}. These nodes have nothing after them and hence are like the leaves of an actual tree.
\item Each node can only be connected to 2 nodes below them, hence the name binary tree.
\end{itemize}

\subsection{Complete Binary Tree (CBT)}
\label{sec:org4294fb6}
A complete binary tree is a binary tree where every parent node has \textbf{exactly two} child nodes.

\subsection{Exceptions (Python-specific concept)}
\label{sec:org5de83ec}
\begin{itemize}
\item Exceptions in Python can be thought of as \textbf{errors}.
\item It usually means that the Python program has reached an \textbf{"exceptional"} situation that it \textbf{doesn't know} how to handle.
\end{itemize}

\subsubsection{Why do we need exception handling?}
\label{sec:org20d3a49}
\begin{itemize}
\item Most modern languages provide ways to deal with \textbf{"exceptional situations"}.
\item Dealing with problems
\item To try to capture certain situations or failures and deal with them gracefully.
\end{itemize}

\subsubsection{What counts as an exception?}
\label{sec:org5993695}
\begin{enumerate}
\item Errors
\begin{itemize}
\item Indexing past the end of a list
\item Trying to open a non-existent file
\item Fetching a non-existent key from a dictionary, etc.
\end{itemize}

\item Events (not really errors)
\begin{itemize}
\item Search algorithm doesn't find a value
\item Mail message arrives, queue event occurs
\end{itemize}
\end{enumerate}

\subsubsection{General idea}
\label{sec:orgca5f88b}
\begin{enumerate}
\item Keep \textbf{watching} a particular section of code.
\item If we get an exception, look for a catcher that can \textbf{handle} that kind of exception.
\item If \textbf{found} handle it.
\item Otherwise, let Python handle it (which usually halts the program).
\end{enumerate}

\subsection{Pattern}
\label{sec:org9c0eb3e}
A pattern is a discernible regularity.
\begin{itemize}
\item The elements of a pattern repeat \textbf{predictably}.
\end{itemize}

In computational thinking, a pattern is the spotted \textbf{similarities} and \textbf{common differences} between problems.

\subsection{Pattern recognition}
\label{sec:orgcd62ecc}
Pattern recognition involves finding the similarities or patterns among small, decomposed problems, which can help in solving complex problems more efficiently.

\subsubsection{Importance}
\label{sec:org791cb68}
\begin{itemize}
\item Patterns make problems simpler and easier to solve.
\item Problems are easier to solve when they share patterns, as we can use the same problem-solving solution wherever the pattern exists.
\item The more patterns we can find, the easier and quicker out problem-solving will be.
\end{itemize}

\subsubsection{How to recognise patterns?}
\label{sec:org508b660}
\begin{enumerate}
\item Identifying common elements or features in problems.
\item Identifying and interpreting common differences between problems.
\item Identifying individual elements within problems.
\item Describing patterns that have been identified.
\item Making predictions based on identified patterns.
\end{enumerate}

 \newpage

\subsection{Iterative accumulation}
\label{sec:org5297aa5}
Iterative accumulation accumulate \textbf{target values} by iterating over them.

\subsubsection{Important elements}
\label{sec:orge708049}
\begin{enumerate}
\item Result variable to store the accumulation result.
\item A for loop.
\item A target value in each iteration to add to the result variable.
\end{enumerate}

\subsection{File}
\label{sec:orgb51805a}
\begin{itemize}
\item A \textbf{collection of data} that is stored on \textbf{secondary storage}, like a disk.
\item Accessing a file means establishing a \textbf{connection} between the \textbf{file} and the \textbf{program} and moving data between the two.
\item When \textbf{opening} a file, you create a \textbf{file object} or \textbf{file stream} that is a connection between the file and the program.
\end{itemize}

\subsubsection{Types of files}
\label{sec:org94f2733}
\begin{enumerate}
\item Text files
\begin{itemize}
\item Organised as ASCII or Unicode characters
\item Generally human-readable, which is useful for certain file types
\item Text files are inefficient to store as each character takes up a few bits.
\begin{itemize}
\item ASCII: 8 bits → 1 byte
\item Unicode: 32 bits → 4 bytes
\end{itemize}
\end{itemize}

\item Binary files
\begin{itemize}
\item All the information is based on specific encodings
\item Not human-readable and contains non-readable information
\item It is a custom format that has more efficient storage
\end{itemize}
\end{enumerate}

\subsubsection{Current file position}
\label{sec:orgf9423a0}
\begin{itemize}
\item Every file maintains a \textbf{current file position}.
\item It is the \textbf{current position} in the file and indicates what will be read next.
\item It is set by the file mode.
\end{itemize}
