y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
** File buffer
- When a file on the disk is opened, the contents of the file are *copied* into the *buffer* of the file object.
- The file object can be thought of as a very big list.
- The *current file position* is the *current index* to access the list.

** Buffering
- Reading from and writing to a *disk* is *very slow*.
- Hence, a computer tries to read a lot of data from a file first.
  - If the data is needed, it will be "buffered" in the file object.
- The file object contains a copy of the information from the file, called a *cache*.
- The *file buffer* contains the information from the file and provides the information to the program, and it is located in the *file object*.

** Sorting algorithms
- Sorting algorithms are algorithms that put elements in a list of a certain order.
- The most frequently used orders are *numerical* and *alphabetical orders*.
- Efficient sorting is important for optimising the efficiency of other algorithms (such as search and merge algorithms).
- Most of the primary sorting algorithms run on different space and time complexity.

*** Importance
- *Practical applications*: Sorting people by last name, countries by population, and websites by search engine relevance.
- *Sorting algorithms are fundamental to other algorithms*.

*** Trade-offs
- Different algorithms have different trade-offs.
- There is no single "best" sort for all scenarios.
- So, knowing just one way to sort is not enough.

** Time complexity
Time complexity is defined to be the time the computer takes to run a program or algorithm.

** Space complexity
Space complexity is defined to be the amount of memory the computer needs to run a program.

** Bubble sort (Sinking sort)
- One of the simplest sorting algorithms.
- It repeatedly steps through the list to be sorted, compares each pair of adjacent items, and swaps them if they are in the wrong order.
- The pass through the list is repeated until no swaps are needed, which indicates that the list is sorted.
- The algorithm, which is a comparison sort, is named for the way smaller or larger elements "bubble" to the top of the list."
- It is easier to implement but slower than other sorts.

*** Overview
Bubble sort makes multiple passes through a list. For each pass, bubble sort goes through the steps below:
1. Compare the first two items in the list, and if the second item is smaller than the first, then the items are swapped.
2. Then move to the next item, compare the item and the item after it, and swap the two items if necessary.
3. Repeat the process.

*** After the first pass
Each sequence of comparison is called a pass. Once the first pass through the list has completed, the largest number has now been moved to the end of the list.

*** Start of the second pass
At the start of the second pass:
- The largest value is now in place, at the end of the list.
- There are (n - 1) items left to sort, which means there will be (n - 2) pairs.

*** Repeat the process
- Since each pass places the next largest value in place, the total number of passes necessary will be (n - 1).
- After completing the (n - 1) passes, the smallest items must be in the correct position with no further processing required.

@@latex: \newpage@@

** Merge sort
- Merge sort is an example of a divide-and-conquer style of algorithm.
- A problem is repeatedly broken up into sub-problems, often using recursion, until they are small enough to be solved.
- The solutions are combined to solve the larger problem.
- Merge sort breaks the data into parts that can be sorted trivially, then combine those parts knowing that they are sorted.

*** Overview
1. Split the list into 2 parts, usually at the middle point.
2. Compare the first elements of both lists 1 by 1.
3. Move the smaller element out of the list that it was found in and add this value to the list of "sorted items".
4. Repeat the process until only a single list remains.
5. One list should still contain elements, which is sorted. Hence, the contents are moved into the result list.

** Timsort
- Timsort is a hybrid sorting algorithm used by Python.
- It is derived from merge sort and insertion sort and is designed to perform well on many kinds of real-world data.
- It is invented by Tim Peters in 2002 for use in the Python programming language.
- It finds subsets of the data that are already ordered, and uses the subsets to sort the data more efficiently. This is done by merging an identified subset, called a run, with existing runs until certain criteria are fulfilled.
- Timsort has been Python's standard sorting algorithm since version 2.3.
- It is now also used to sort arrays in Java SE 7 and on the Android platform.

** Searching
- Given a list of data, searching is finding the location of a particular value or reporting that the value is not present.
- It is one of the fundamental problems in computer science and programming.
- Sorting is done to make searching easier.
- There are multiple searching algorithms to solve problems.

** Search key
Search key is basically the element that needs to be found in a search.

** Linear search
- Linear search iterates over the sequence, one item at a time, until the specific item is found, or all items have been examined.
  - The approach is intuitive.
  - Starts at the first item.
  - Is it the one I am looking for?
  - If not, go to the next item.
  - Repeats until the item is found or all the items are checked.

- This approach is necessary if items are not sorted.

@@latex: \newpage@@

** Binary search
- Binary search uses a divide-and-conquer strategy to search for an item, which divides the work in half with each step.
- However, the list of items must be sorted, otherwise this method of searching will not work.

*** Procedure
- Start at the middle of the list.
- Check if the middle item is what we are looking for.
- If it is not, check if the middle item is greater or lower than the item we are looking for.
- If it is lower, take the lower half of the list and look for the item using the same procedure above.
- If it is higher, take the higher half of the list and look for the item using the same procedure above.
- Repeat until the item is found, or the sublist is of size 0.

@@latex: \newpage@@

