y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsection{File buffer}
\label{sec:org28beb17}
\begin{itemize}
\item When a file on the disk is opened, the contents of the file are \textbf{copied} into the \textbf{buffer} of the file object.
\item The file object can be thought of as a very big list.
\item The \textbf{current file position} is the \textbf{current index} to access the list.
\end{itemize}

\subsection{Buffering}
\label{sec:orga0e567d}
\begin{itemize}
\item Reading from and writing to a \textbf{disk} is \textbf{very slow}.
\item Hence, a computer tries to read a lot of data from a file first.
\begin{itemize}
\item If the data is needed, it will be "buffered" in the file object.
\end{itemize}
\item The file object contains a copy of the information from the file, called a \textbf{cache}.
\item The \textbf{file buffer} contains the information from the file and provides the information to the program, and it is located in the \textbf{file object}.
\end{itemize}

\subsection{Sorting algorithms}
\label{sec:org8f8849a}
\begin{itemize}
\item Sorting algorithms are algorithms that put elements in a list of a certain order.
\item The most frequently used orders are \textbf{numerical} and \textbf{alphabetical orders}.
\item Efficient sorting is important for optimising the efficiency of other algorithms (such as search and merge algorithms).
\item Most of the primary sorting algorithms run on different space and time complexity.
\end{itemize}

\subsubsection{Importance}
\label{sec:org5803694}
\begin{itemize}
\item \textbf{Practical applications}: Sorting people by last name, countries by population, and websites by search engine relevance.
\item \textbf{Sorting algorithms are fundamental to other algorithms}.
\end{itemize}

\subsubsection{Trade-offs}
\label{sec:orgbfee841}
\begin{itemize}
\item Different algorithms have different trade-offs.
\item There is no single "best" sort for all scenarios.
\item So, knowing just one way to sort is not enough.
\end{itemize}

\subsection{Time complexity}
\label{sec:org4dd228c}
Time complexity is defined to be the time the computer takes to run a program or algorithm.

\subsection{Space complexity}
\label{sec:org3bfa673}
Space complexity is defined to be the amount of memory the computer needs to run a program.

\subsection{Bubble sort (Sinking sort)}
\label{sec:org3a18bf9}
\begin{itemize}
\item One of the simplest sorting algorithms.
\item It repeatedly steps through the list to be sorted, compares each pair of adjacent items, and swaps them if they are in the wrong order.
\item The pass through the list is repeated until no swaps are needed, which indicates that the list is sorted.
\item The algorithm, which is a comparison sort, is named for the way smaller or larger elements "bubble" to the top of the list."
\item It is easier to implement but slower than other sorts.
\end{itemize}

\subsubsection{Overview}
\label{sec:org8478333}
Bubble sort makes multiple passes through a list. For each pass, bubble sort goes through the steps below:
\begin{enumerate}
\item Compare the first two items in the list, and if the second item is smaller than the first, then the items are swapped.
\item Then move to the next item, compare the item and the item after it, and swap the two items if necessary.
\item Repeat the process.
\end{enumerate}

\subsubsection{After the first pass}
\label{sec:orga790e79}
Each sequence of comparison is called a pass. Once the first pass through the list has completed, the largest number has now been moved to the end of the list.

\subsubsection{Start of the second pass}
\label{sec:orgd8afbb2}
At the start of the second pass:
\begin{itemize}
\item The largest value is now in place, at the end of the list.
\item There are (n - 1) items left to sort, which means there will be (n - 2) pairs.
\end{itemize}

\subsubsection{Repeat the process}
\label{sec:org7179a25}
\begin{itemize}
\item Since each pass places the next largest value in place, the total number of passes necessary will be (n - 1).
\item After completing the (n - 1) passes, the smallest items must be in the correct position with no further processing required.
\end{itemize}

 \newpage

\subsection{Merge sort}
\label{sec:orgc13dc4b}
\begin{itemize}
\item Merge sort is an example of a divide-and-conquer style of algorithm.
\item A problem is repeatedly broken up into sub-problems, often using recursion, until they are small enough to be solved.
\item The solutions are combined to solve the larger problem.
\item Merge sort breaks the data into parts that can be sorted trivially, then combine those parts knowing that they are sorted.
\end{itemize}

\subsubsection{Overview}
\label{sec:org3ff97c1}
\begin{enumerate}
\item Split the list into 2 parts, usually at the middle point.
\item Compare the first elements of both lists 1 by 1.
\item Move the smaller element out of the list that it was found in and add this value to the list of "sorted items".
\item Repeat the process until only a single list remains.
\item One list should still contain elements, which is sorted. Hence, the contents are moved into the result list.
\end{enumerate}

\subsection{Timsort}
\label{sec:org077f1de}
\begin{itemize}
\item Timsort is a hybrid sorting algorithm used by Python.
\item It is derived from merge sort and insertion sort and is designed to perform well on many kinds of real-world data.
\item It is invented by Tim Peters in 2002 for use in the Python programming language.
\item It finds subsets of the data that are already ordered, and uses the subsets to sort the data more efficiently. This is done by merging an identified subset, called a run, with existing runs until certain criteria are fulfilled.
\item Timsort has been Python's standard sorting algorithm since version 2.3.
\item It is now also used to sort arrays in Java SE 7 and on the Android platform.
\end{itemize}

\subsection{Searching}
\label{sec:orgb4cde09}
\begin{itemize}
\item Given a list of data, searching is finding the location of a particular value or reporting that the value is not present.
\item It is one of the fundamental problems in computer science and programming.
\item Sorting is done to make searching easier.
\item There are multiple searching algorithms to solve problems.
\end{itemize}

\subsection{Search key}
\label{sec:org383fcba}
Search key is basically the element that needs to be found in a search.

\subsection{Linear search}
\label{sec:org72e5ec6}
\begin{itemize}
\item Linear search iterates over the sequence, one item at a time, until the specific item is found, or all items have been examined.
\begin{itemize}
\item The approach is intuitive.
\item Starts at the first item.
\item Is it the one I am looking for?
\item If not, go to the next item.
\item Repeats until the item is found or all the items are checked.
\end{itemize}

\item This approach is necessary if items are not sorted.
\end{itemize}

 \newpage

\subsection{Binary search}
\label{sec:org17676c3}
\begin{itemize}
\item Binary search uses a divide-and-conquer strategy to search for an item, which divides the work in half with each step.
\item However, the list of items must be sorted, otherwise this method of searching will not work.
\end{itemize}

\subsubsection{Procedure}
\label{sec:orgd5d48ba}
\begin{itemize}
\item Start at the middle of the list.
\item Check if the middle item is what we are looking for.
\item If it is not, check if the middle item is greater or lower than the item we are looking for.
\item If it is lower, take the lower half of the list and look for the item using the same procedure above.
\item If it is higher, take the higher half of the list and look for the item using the same procedure above.
\item Repeat until the item is found, or the sublist is of size 0.
\end{itemize}

 \newpage
