y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
*** Binary search vs linear search
#+ATTR_LATEX: :environment tabular :align |m{6.5em}|m{5em}|m{7em}|m{6em}|m{6em}|
|---------------+-----------------------------+---------------------------+------------------------------+-------------------------------|
| *Algorithm*   | *Best-case time complexity* | *Average time complexity* | *Worst-case time complexity* | *Worst-case space complexity* |
|---------------+-----------------------------+---------------------------+------------------------------+-------------------------------|
| Linear Search | O(1)                        | O(n)                      | O(n)                         | O(1)                          |
| Binary Search | O(1)                        | O(log n)                  | O(log n)                     | O(1)                          |
|---------------+-----------------------------+---------------------------+------------------------------+-------------------------------|

#+ATTR_LATEX: :environment tabular :align |m{17em}|m{17em}|
|-------------------------------------------------------------------------+----------------------------------------------------------------------------------------------------------------------------------|
| *Linear search*                                                         | *Binary search*                                                                                                                  |
|-------------------------------------------------------------------------+----------------------------------------------------------------------------------------------------------------------------------|
| Checks the item in the sequence until the desired item is found.        | Checks the middle item of the list.                                                                                              |
|-------------------------------------------------------------------------+----------------------------------------------------------------------------------------------------------------------------------|
| Often used for short lists.                                             | Requires sorted list.                                                                                                            |
|-------------------------------------------------------------------------+----------------------------------------------------------------------------------------------------------------------------------|
| Inefficient for large sorted lists.                                     | Repeated discarding of half of the list, which contains values that are all definitely larger or smaller than the desired value. |
|-------------------------------------------------------------------------+----------------------------------------------------------------------------------------------------------------------------------|
| Simple and easy to implement, but inefficient compared to binary search. | Algorithms for binary search can be implemented in an iterative or recursive manner.                                             |
|-------------------------------------------------------------------------+----------------------------------------------------------------------------------------------------------------------------------|

** Searching algorithms
- Interpolation search
- Grover's algorithm, which requires quantum computers
- Indexed searching
- Binary search trees
- Hash table searching
- Best-first

** Program complexity types

*** O(1): Constant complexity
The algorithm always uses the same amount of time to execute for all inputs.

*** O(n): Linear complexity
The algorithm's execution time increases linearly in proportion with the size of input date.

*** O(n^{k}): Polynomial complexity, where k is a constant
Polynomial complexity occurs for algorithm that contains nested loops.
- An example is O(n^{2}): Quadratic complexity, where the execution time is proportional to the square of the input data size.

*** O(log n): Logarithmic complexity
The algorithm's execution time grows as the log size of the input data.

*** O(k^{n}): Exponential complexity
Exponential complexity occurs for algorithm that contains recursive call.

** Mainframe computers
- Mainframe computers have one machine to multiple users, and are used for applications that need to process massive amounts of data.
- Some examples include the IBM 1401 and the IBM z13.

** Personal computers
- Personal computers have one machine to one user.
- Some examples include the IBM PC, the laptop and the tablet.

** Mobile devices
- Mobile devices are very portable, and each user will likely have multiple devices.
- Some examples include a smartphone, a smartwatch, a health tracker and a credit card.

** Ubiquitous computing
- Ubiquitous computing is when consumer electronic products and household appliances communicate with each other.
- Some examples include household appliances and a dash cam.

** Internet of Things (IoT)
- The internet of things is when machines, devices and sensors are connected to the internet to exchange data, improve efficiency and reduce human error.

** Cloud computing
- Cloud computing is computing in the massive servers held by big tech companies.
- They have remote computer servers accessible through the internet, called data centres.
- They provide computing resources such as to store, manage and process data.
- It is subscribed as an on-demand sharable service.
- It frees the user from maintaining the computer resources.
- Some examples include Microsoft Azure and Amazon Web Services (AWS).

** Data centre
- A data centre collection of server machines at a premise.
- It provides computing resources that deal with big data, like Facebook's and Google's data centres.
- It is often used by cloud-service providers to provide cloud computing hosting services.
- Multiple data centres can be located at several geographic locations to ensure constant data availability during power outages and data centre failures.
- Cloud computing can be used to provide computing resources for IoT devices.
- However, this is not suitable for time critical applications due to network latency.

** Fog computing
Fog computing refers to data processing at the network layer near the devices, such as the gateway equipment.

** Edge computing
Edge computing refers to data being performed on the devices itself, or the client side.

** Augmented reality
Augmented reality augments objects that reside in the real-world with computer-generated perceptual information.

** Virtual reality.
- Virtual reality uses the computer technology to create a simulated environment.
- The user is immersed within the environment.

** Artificial intelligence (AI)
- Artificial intelligence is to develop machines that can exhibit intelligence like humans.
- It trains itself through a machine learning algorithm.
- It is used in many applications, such as:
  - Face recognitions
  - Speech recognitions
  - Recommendation systems
  - Self-driving vehicles


@@latex: \newpage@@

* Program translations

** Interpretation approach
- Uses a program known as an interpreter
- Reads one high-level code statement at a time
  - Immediately translates and executes the statement before processing the next one

*** Examples
- Python
- R
- JavaScript
- TypeScript
- Lua
- Lisp

*** Benefits
- Very portable across different computing platforms
- Produces results almost immediately
- Easy to debug
- Program executes more slowly
- Useful for implementing dynamic, interactive features, such as those used on web pages

@@latex: \newpage@@

** Compilation approach
- Uses a program called a compiler
- Reads and translates the entire high-level language program (source) code into its equivalent machine-language instructions in an executable file
- The resulting machine-language instructions can then be executed directly on the computer when the program is launched

*** Examples
- C
- C++
- Rust
- Go
- Zig
- Nim

