y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsubsection{Binary search vs linear search}
\label{sec:orgb1a2c7f}
\begin{center}
\begin{tabular}{|m{6.5em}|m{5em}|m{7em}|m{6em}|m{6em}|}
\hline
\textbf{Algorithm} & \textbf{Best-case time complexity} & \textbf{Average time complexity} & \textbf{Worst-case time complexity} & \textbf{Worst-case space complexity}\\[0pt]
\hline
Linear Search & O(1) & O(n) & O(n) & O(1)\\[0pt]
Binary Search & O(1) & O(log n) & O(log n) & O(1)\\[0pt]
\hline
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{|m{17em}|m{17em}|}
\hline
\textbf{Linear search} & \textbf{Binary search}\\[0pt]
\hline
Checks the item in the sequence until the desired item is found. & Checks the middle item of the list.\\[0pt]
\hline
Often used for short lists. & Requires sorted list.\\[0pt]
\hline
Inefficient for large sorted lists. & Repeated discarding of half of the list, which contains values that are all definitely larger or smaller than the desired value.\\[0pt]
\hline
Simple and easy to implement, but inefficient compared to binary search. & Algorithms for binary search can be implemented in an iterative or recursive manner.\\[0pt]
\hline
\end{tabular}
\end{center}

\subsection{Searching algorithms}
\label{sec:org8c2c371}
\begin{itemize}
\item Interpolation search
\item Grover's algorithm, which requires quantum computers
\item Indexed searching
\item Binary search trees
\item Hash table searching
\item Best-first
\end{itemize}

\subsection{Program complexity types}
\label{sec:orgf9f89b2}

\subsubsection{O(1): Constant complexity}
\label{sec:orgbc0d5d9}
The algorithm always uses the same amount of time to execute for all inputs.

\subsubsection{O(n): Linear complexity}
\label{sec:org0a14894}
The algorithm's execution time increases linearly in proportion with the size of input date.

\subsubsection{O(n\textsuperscript{k}): Polynomial complexity, where k is a constant}
\label{sec:orga454d5a}
Polynomial complexity occurs for algorithm that contains nested loops.
\begin{itemize}
\item An example is O(n\textsuperscript{2}): Quadratic complexity, where the execution time is proportional to the square of the input data size.
\end{itemize}

\subsubsection{O(log n): Logarithmic complexity}
\label{sec:org9c4c5ea}
The algorithm's execution time grows as the log size of the input data.

\subsubsection{O(k\textsuperscript{n}): Exponential complexity}
\label{sec:org966d259}
Exponential complexity occurs for algorithm that contains recursive call.

\subsection{Mainframe computers}
\label{sec:org1589926}
\begin{itemize}
\item Mainframe computers have one machine to multiple users, and are used for applications that need to process massive amounts of data.
\item Some examples include the IBM 1401 and the IBM z13.
\end{itemize}

\subsection{Personal computers}
\label{sec:orgd8f87c9}
\begin{itemize}
\item Personal computers have one machine to one user.
\item Some examples include the IBM PC, the laptop and the tablet.
\end{itemize}

\subsection{Mobile devices}
\label{sec:orgcc2803f}
\begin{itemize}
\item Mobile devices are very portable, and each user will likely have multiple devices.
\item Some examples include a smartphone, a smartwatch, a health tracker and a credit card.
\end{itemize}

\subsection{Ubiquitous computing}
\label{sec:org0f765f9}
\begin{itemize}
\item Ubiquitous computing is when consumer electronic products and household appliances communicate with each other.
\item Some examples include household appliances and a dash cam.
\end{itemize}

\subsection{Internet of Things (IoT)}
\label{sec:org11939da}
\begin{itemize}
\item The internet of things is when machines, devices and sensors are connected to the internet to exchange data, improve efficiency and reduce human error.
\end{itemize}

\subsection{Cloud computing}
\label{sec:org34abcae}
\begin{itemize}
\item Cloud computing is computing in the massive servers held by big tech companies.
\item They have remote computer servers accessible through the internet, called data centres.
\item They provide computing resources such as to store, manage and process data.
\item It is subscribed as an on-demand sharable service.
\item It frees the user from maintaining the computer resources.
\item Some examples include Microsoft Azure and Amazon Web Services (AWS).
\end{itemize}

\subsection{Data centre}
\label{sec:orge945f8f}
\begin{itemize}
\item A data centre collection of server machines at a premise.
\item It provides computing resources that deal with big data, like Facebook's and Google's data centres.
\item It is often used by cloud-service providers to provide cloud computing hosting services.
\item Multiple data centres can be located at several geographic locations to ensure constant data availability during power outages and data centre failures.
\item Cloud computing can be used to provide computing resources for IoT devices.
\item However, this is not suitable for time critical applications due to network latency.
\end{itemize}

\subsection{Fog computing}
\label{sec:org55e56b3}
Fog computing refers to data processing at the network layer near the devices, such as the gateway equipment.

\subsection{Edge computing}
\label{sec:org4f765bc}
Edge computing refers to data being performed on the devices itself, or the client side.

\subsection{Augmented reality}
\label{sec:orgd5c4412}
Augmented reality augments objects that reside in the real-world with computer-generated perceptual information.

\subsection{Virtual reality.}
\label{sec:org512f8cb}
\begin{itemize}
\item Virtual reality uses the computer technology to create a simulated environment.
\item The user is immersed within the environment.
\end{itemize}

\subsection{Artificial intelligence (AI)}
\label{sec:orgc0fc010}
\begin{itemize}
\item Artificial intelligence is to develop machines that can exhibit intelligence like humans.
\item It trains itself through a machine learning algorithm.
\item It is used in many applications, such as:
\begin{itemize}
\item Face recognitions
\item Speech recognitions
\item Recommendation systems
\item Self-driving vehicles
\end{itemize}
\end{itemize}


 \newpage

\section{Program translations}
\label{sec:orgbf686e9}

\subsection{Interpretation approach}
\label{sec:orgdc6ea74}
\begin{itemize}
\item Uses a program known as an interpreter
\item Reads one high-level code statement at a time
\begin{itemize}
\item Immediately translates and executes the statement before processing the next one
\end{itemize}
\end{itemize}

\subsubsection{Examples}
\label{sec:org2b9f911}
\begin{itemize}
\item Python
\item R
\item JavaScript
\item TypeScript
\item Lua
\item Lisp
\end{itemize}

\subsubsection{Benefits}
\label{sec:org76a4d44}
\begin{itemize}
\item Very portable across different computing platforms
\item Produces results almost immediately
\item Easy to debug
\item Program executes more slowly
\item Useful for implementing dynamic, interactive features, such as those used on web pages
\end{itemize}

 \newpage

\subsection{Compilation approach}
\label{sec:org0a9645a}
\begin{itemize}
\item Uses a program called a compiler
\item Reads and translates the entire high-level language program (source) code into its equivalent machine-language instructions in an executable file
\item The resulting machine-language instructions can then be executed directly on the computer when the program is launched
\end{itemize}
