y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
*** Benefits
- Program runs very fast AFTER compilation
- Smaller in code size after compilation
- Must compile the entire program before execution
- Needs to be re-compiled if to be used on different computing platforms
- Used in large and sophisticated software applications when speed is of the utmost importance

** Combination of compilation and interpretation
It is also possible to use the combination of both translation techniques.

*** Examples
- Java


* Computer organisation

** Central processing unit (CPU)
- Processes information
- Performs operations based on information given

*** Control unit (CU)
- Controls and coordinates the overall operation of the CPU
- Consists of decoders and logic circuits
- Controls the overall operations of the various units and modules
- Driven by a clock signal to ensure that everything happens at the correct instances and in proper sequence

*** Arithmetic/Logic Unit (ALU)
- Performs arithmetic operations as well as Boolean logic functions
- Deals with arithmetic operations like addition, subtraction, multiplication and division (if supported)
- Also performs logic operations (i.e. Boolean operations) like AND, OR, NOT, XOR etc, and bit shifting/rotation

*** Register Array
- Holds the various information used by CPU operations
- A small amount of very high speed internal storage used for frequently accessed data
- Enables data to be stored and retrieved quickly
- Some of these registers are used for more specific functions, like program counter, instruction register, stack pointer, memory address register, accumulator, etc

*** Program counter (PC) (special register)
Tells the control unit where to find the instruction in memory.

*** Instruction register (IR) (special register)
Holds the copy of the instruction to be decoded and executed by the control unit.

*** Data, Address and Control Signals
- Consists of signalling wires that are grouped into data signals, address signals, and control signals
- The signals connect the various internal functional units together
- Extend to the external system bus for other modules (memory and I/O) of the microprocessor

** Memory
- Memory is used to store instructions and data for the CPU
- Consists of high speed electronics components that store the information in binary bit format
- Each location stores an 8-bit (byte) size data
- Each location is allocated a unique address
- Identified by specifying its binary pattern on the address bus
- If data is more than 8 bits in size (e.g. a 32-bit word), consecutive locations are used, and the lowest byte address is used to access the word location

*** Memory size
It is dependent on the number of bits (n) used in its address bus. Memory size = 2^{n} bytes.

- When n = 10, 2^{10} = 1024 bytes or 1 kilobyte (KB)
- When n = 20, 2^{20} = 1024 × 1 KB = 1048576 bytes or 1 megabyte (MB)
- When n = 30, 2^{30} = 1 KB × 1 KB × 1 KB = 1073741824 bytes or 1 Gigabyte (GB)

** Input/Output (I/O) Interface
- Mechanism for transferring information to and from the outside world, such as to interact with users

** System Bus
- The system bus consists of groups of parallel signals that are used to transfer information between the modules in the microprocessor.
- The system bus is used to connect external devices, such as memory and I/O devices, to the functional units within the CPU.

*** Data Bus
- Conveys the information from one module to the other.

*** Control Bus
- Provides the control signals for the modules to work together, such as to determine the direction of data flow, and when each device can access the data bus and address bus.

*** Address Bus
- Used to convey the address information. The signals' pattern on the address bus lines determines the location of the source and destination of the data transfer.


* Information in a computer

** Types of information
- Instructions
- Data

@@latex: \newpage@@

** Information representation

*** Binary format (base-2)
- General expression: b_{n-1} ... b_{k} ... b_{2}b_{1}b_{0}
- Example of an 8-bit binary number: 01001101b
- The decimal (base-10) value can be calculated as:
  2^{n-1} × b_{n-1} + ... + 2^{k} × b_{k} + ... + 2^{2} × b_{2} + 2^{1} × b_{1} + 2^{0} × b_{0}

- The k^{th} bit will have a weightage of 2^{k}.

*** Hexadecimal format (base-16)
- Hexadecimal symbols: 0, 1, 2, ..., 8, 9, A (10), B (11), C (12), D (13), E (14), F (15)
- Each hexadecimal is 4 binary bits
- The binary format data is separated into groups of 4 bits:
  1011 0101 0110 1100 = B56C


* Program execution

** Instruction execution
1. On power up, the program instruction will be typically first loaded into certain default memory locations (together with data).
2. A clocking signal is also applied to the CPU (as well as to the rest of the microprocessor system).
3. Based on the rising or falling edges of the clock, the control unit (CU) will retrieve (fetch) the instruction from the default memory location.
4. The control unit (CU) of a CPU is designed to recognise its own instructions and performs the corresponding operation.

@@latex: \newpage@@

** Fetch
Fetch the instruction from the memory into the instruction register (IR) using the address indicated by the program counter (PC).

** Decode
Decode the machine instruction by the control unit, which is now stored in the instruction register (IR).

** Execute
Execute the instruction. For example, loading the operands into the arithmetic/logic unit (ALU) and get the ALU to operate on them.

@@latex: \newpage@@

* Ways to handle errors

** Look before you leap (LBYL)
- Be very cautious!
- Check *all aspects* before execution
  - If a string is required, check that it is a string.
  - If the values should be positive, check that it is indeed positive.
- This can make code quite lengthy, which can reduce readability.

*** Example
#+begin_src python :results none
if not isinstance(string, str):
    return None
elif not string.isdigit():
    return None
else:
    return int(string)
#+end_src

** Easier to Ask for Forgiveness than Permission (EAFP)
- Run anything you like!
- Be ready to *clean up* in case of error
- The ~try~ block reflects what you want to do, and the ~except~ block reflects what you want to do on error.
- Cleaner separation

*** Example
#+begin_src python :results none
try:
    return int(string)
except (TypeError, ValueError, OverflowError):
    return None
#+end_src

@@latex: \newpage@@

