y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsubsection{Examples}
\label{sec:orgfa0f65b}
\begin{itemize}
\item C
\item C++
\item Rust
\item Go
\item Zig
\item Nim
\end{itemize}

\subsubsection{Benefits}
\label{sec:orgb4cf242}
\begin{itemize}
\item Program runs very fast AFTER compilation
\item Smaller in code size after compilation
\item Must compile the entire program before execution
\item Needs to be re-compiled if to be used on different computing platforms
\item Used in large and sophisticated software applications when speed is of the utmost importance
\end{itemize}

\subsection{Combination of compilation and interpretation}
\label{sec:orgf431f12}
It is also possible to use the combination of both translation techniques.

\subsubsection{Examples}
\label{sec:orge67f31f}
\begin{itemize}
\item Java
\end{itemize}


\section{Computer organisation}
\label{sec:orgdcfb395}

\subsection{Central processing unit (CPU)}
\label{sec:orgaa47c1d}
\begin{itemize}
\item Processes information
\item Performs operations based on information given
\end{itemize}

\subsubsection{Control unit (CU)}
\label{sec:orgc5ca67e}
\begin{itemize}
\item Controls and coordinates the overall operation of the CPU
\item Consists of decoders and logic circuits
\item Controls the overall operations of the various units and modules
\item Driven by a clock signal to ensure that everything happens at the correct instances and in proper sequence
\end{itemize}

\subsubsection{Arithmetic/Logic Unit (ALU)}
\label{sec:orgdc45468}
\begin{itemize}
\item Performs arithmetic operations as well as Boolean logic functions
\item Deals with arithmetic operations like addition, subtraction, multiplication and division (if supported)
\item Also performs logic operations (i.e. Boolean operations) like AND, OR, NOT, XOR etc, and bit shifting/rotation
\end{itemize}

\subsubsection{Register Array}
\label{sec:orgfe3a1ef}
\begin{itemize}
\item Holds the various information used by CPU operations
\item A small amount of very high speed internal storage used for frequently accessed data
\item Enables data to be stored and retrieved quickly
\item Some of these registers are used for more specific functions, like program counter, instruction register, stack pointer, memory address register, accumulator, etc
\end{itemize}

\subsubsection{Program counter (PC) (special register)}
\label{sec:orga3e62ed}
Tells the control unit where to find the instruction in memory.

\subsubsection{Instruction register (IR) (special register)}
\label{sec:org17f14f7}
Holds the copy of the instruction to be decoded and executed by the control unit.

\subsubsection{Data, Address and Control Signals}
\label{sec:orga804cc0}
\begin{itemize}
\item Consists of signalling wires that are grouped into data signals, address signals, and control signals
\item The signals connect the various internal functional units together
\item Extend to the external system bus for other modules (memory and I/O) of the microprocessor
\end{itemize}

\subsection{Memory}
\label{sec:orgb6aef72}
\begin{itemize}
\item Memory is used to store instructions and data for the CPU
\item Consists of high speed electronics components that store the information in binary bit format
\item Each location stores an 8-bit (byte) size data
\item Each location is allocated a unique address
\item Identified by specifying its binary pattern on the address bus
\item If data is more than 8 bits in size (e.g. a 32-bit word), consecutive locations are used, and the lowest byte address is used to access the word location
\end{itemize}

\subsubsection{Memory size}
\label{sec:orgda5c132}
It is dependent on the number of bits (n) used in its address bus. Memory size = 2\textsuperscript{n} bytes.

\begin{itemize}
\item When n = 10, 2\textsuperscript{10} = 1024 bytes or 1 kilobyte (KB)
\item When n = 20, 2\textsuperscript{20} = 1024 × 1 KB = 1048576 bytes or 1 megabyte (MB)
\item When n = 30, 2\textsuperscript{30} = 1 KB × 1 KB × 1 KB = 1073741824 bytes or 1 Gigabyte (GB)
\end{itemize}

\subsection{Input/Output (I/O) Interface}
\label{sec:org188646a}
\begin{itemize}
\item Mechanism for transferring information to and from the outside world, such as to interact with users
\end{itemize}

\subsection{System Bus}
\label{sec:orgba4029f}
\begin{itemize}
\item The system bus consists of groups of parallel signals that are used to transfer information between the modules in the microprocessor.
\item The system bus is used to connect external devices, such as memory and I/O devices, to the functional units within the CPU.
\end{itemize}

\subsubsection{Data Bus}
\label{sec:orgbf733f3}
\begin{itemize}
\item Conveys the information from one module to the other.
\end{itemize}

\subsubsection{Control Bus}
\label{sec:org7ea8265}
\begin{itemize}
\item Provides the control signals for the modules to work together, such as to determine the direction of data flow, and when each device can access the data bus and address bus.
\end{itemize}

\subsubsection{Address Bus}
\label{sec:org79fe214}
\begin{itemize}
\item Used to convey the address information. The signals' pattern on the address bus lines determines the location of the source and destination of the data transfer.
\end{itemize}


\section{Information in a computer}
\label{sec:orgee2e615}

\subsection{Types of information}
\label{sec:orgaacebaa}
\begin{itemize}
\item Instructions
\item Data
\end{itemize}

 \newpage

\subsection{Information representation}
\label{sec:org9119e44}

\subsubsection{Binary format (base-2)}
\label{sec:org9116a3f}
\begin{itemize}
\item General expression: b\textsubscript{n-1} \ldots{} b\textsubscript{k} \ldots{} b\textsubscript{2}b\textsubscript{1}b\textsubscript{0}
\item Example of an 8-bit binary number: 01001101b
\item The decimal (base-10) value can be calculated as:
2\textsuperscript{n-1} × b\textsubscript{n-1} + \ldots{} + 2\textsuperscript{k} × b\textsubscript{k} + \ldots{} + 2\textsuperscript{2} × b\textsubscript{2} + 2\textsuperscript{1} × b\textsubscript{1} + 2\textsuperscript{0} × b\textsubscript{0}

\item The k\textsuperscript{th} bit will have a weightage of 2\textsuperscript{k}.
\end{itemize}

\subsubsection{Hexadecimal format (base-16)}
\label{sec:org3cf67af}
\begin{itemize}
\item Hexadecimal symbols: 0, 1, 2, \ldots{}, 8, 9, A (10), B (11), C (12), D (13), E (14), F (15)
\item Each hexadecimal is 4 binary bits
\item The binary format data is separated into groups of 4 bits:
1011 0101 0110 1100 = B56C
\end{itemize}


\section{Program execution}
\label{sec:org7da2e39}

\subsection{Instruction execution}
\label{sec:org13c7c11}
\begin{enumerate}
\item On power up, the program instruction will be typically first loaded into certain default memory locations (together with data).
\item A clocking signal is also applied to the CPU (as well as to the rest of the microprocessor system).
\item Based on the rising or falling edges of the clock, the control unit (CU) will retrieve (fetch) the instruction from the default memory location.
\item The control unit (CU) of a CPU is designed to recognise its own instructions and performs the corresponding operation.
\end{enumerate}

 \newpage

\subsection{Fetch}
\label{sec:org2bfb600}
Fetch the instruction from the memory into the instruction register (IR) using the address indicated by the program counter (PC).

\subsection{Decode}
\label{sec:org229efab}
Decode the machine instruction by the control unit, which is now stored in the instruction register (IR).

\subsection{Execute}
\label{sec:orgf1fb894}
Execute the instruction. For example, loading the operands into the arithmetic/logic unit (ALU) and get the ALU to operate on them.

 \newpage

\section{Ways to handle errors}
\label{sec:org0ab7a9d}

\subsection{Look before you leap (LBYL)}
\label{sec:orgfd7b58f}
\begin{itemize}
\item Be very cautious!
\item Check \textbf{all aspects} before execution
\begin{itemize}
\item If a string is required, check that it is a string.
\item If the values should be positive, check that it is indeed positive.
\end{itemize}
\item This can make code quite lengthy, which can reduce readability.
\end{itemize}

\subsubsection{Example}
\label{sec:orgb342af2}
\begin{minted}[]{python}
if not isinstance(string, str):
    return None
elif not string.isdigit():
    return None
else:
    return int(string)
\end{minted}

\subsection{Easier to Ask for Forgiveness than Permission (EAFP)}
\label{sec:orgc462c5e}
\begin{itemize}
\item Run anything you like!
\item Be ready to \textbf{clean up} in case of error
\item The \texttt{try} block reflects what you want to do, and the \texttt{except} block reflects what you want to do on error.
\item Cleaner separation
\end{itemize}

\subsubsection{Example}
\label{sec:org35d28e1}
\begin{minted}[]{python}
try:
    return int(string)
except (TypeError, ValueError, OverflowError):
    return None
\end{minted}

 \newpage
