y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
* Program complexity evaluation
- There are multiple possible algorithms as well as implementations.
- Execution time depends on many factors, like:
  - The speed of the computer
  - The way the algorithm is implemented
    - Pre-compute lookup table
    - Loop unrolling technique
    - Input data value and input data size

** Instruction steps
- Count the number of instructions it takes to execute the algorithm.
- It is independent of the computer, and more steps mean longer execution time.
- The number of steps may still depend on the data involved in the computation.

** Asymptotic behaviour
- It is more important to consider the worst case scenario, which is when an item is not in a list, as the number of instruction steps will be the most.
- As the number of entries in the list increases, the number of steps under the worst case scenario also increases.
- Input data size is equivalent to the number of entries in the list.
- In time complexity analysis, the growth pattern of the number of steps as input data size increases indefinitely.
- The asymptotic behaviour of running time is given by the Big O notation.

** Big O notation
- It measures and compares the time complexity of algorithms.
- It is how the execution time of the algorithm grows as the size of the input data grows.
- The execution time is in terms of the number of instruction steps for the worst case scenario.
- The Big O notation gives an upper bound on the asymptotic growth of an algorithm.

** Analysis of a linear search

*** Assumption
Each line of code can be executed in one step.

*** Worst case
Item isn't in the list

*** Asymptotic behaviour
- T(n) increases proportionally with n, i.e., T(n) doubles when n is doubled.
- Growth order: f(n) = n

*** Complexity using Big O notation [O(f(n)) = O(n)]
- Linear complexity

* Complete Binary Tree (CBT) implementation in Python
A complete binary tree can be represented as a list in Python:
#+begin_src python :results none
complete_binary_tree = [left_subtree, root, right_subtree]
example = [[[7], 1, [9]], 3, [[8], 2, [4]]]
#+end_src

** Total number of nodes in a complete binary tree
#+begin_src python :results none
def num_of_nodes(binary_tree: list) -> int:
    "A function to return the number of nodes in a complete binary tree"

    # Gets the length of the complete binary tree
    length = len(binary_tree)

    # If the length of the binary tree is 0 or 1,
    # return the length of the binary tree
    if length <= 1:
        return length

    # Otherwise
    else:

        # Get the number of nodes in the left subtree
        # Remember that the left subtree is the first item in the list
        num_of_nodes_in_left_subtree = num_of_nodes(binary_tree[0])

        # Get the number of nodes in the right subtree
        # Remember that the right subtree is the last item in the list
        num_of_nodes_in_right_subtree = num_of_nodes(binary_tree[-1])

        # Add the number of nodes in the left and right subtrees,
        # adding one because of the middle root node,
        # and return the value
        return (num_of_nodes_in_left_subtree + num_of_nodes_in_right_subtree + 1)
#+end_src

@@latex: \newpage@@

** Sum of the node values in a complete binary tree
#+begin_src python :results none
def sum_of_node_values(binary_tree: list) -> int:
    "A function to return the sum of node values in a complete binary tree"

    # Gets the length of the complete binary tree
    length = len(binary_tree)

    # If the length of the binary tree is 0
    # return zero
    if length <= 0:
        return 0

    # Otherwise, if the length of the binary tree is 1
    # return the value of the root node
    elif length == 1:
        return binary_tree[0]

    # Otherwise
    else:

        # Get the sum of the node values in the left subtree
        # Remember that the left subtree is the first item in the list
        sum_of_node_values_in_left_subtree = sum_of_node_values(binary_tree[0])

        # Get the sum of the node values in the right subtree
        # Remember that the right subtree is the last item in the list
        sum_of_node_values_in_right_subtree = sum_of_node_values(binary_tree[-1])

        # Add the sum of the node values in the left and right subtrees,
        # as well as add the value of the root node,
        # which is the second item in the list
        # and return the value
        return (
            sum_of_node_values_in_left_subtree
            + sum_of_node_values_in_right_subtree
            + binary_tree[1]
        )
#+end_src

@@latex: \newpage@@

** Obtain the highest value found in the complete binary tree
#+begin_src python :results none
def get_max_value(binary_tree: list) -> int:
    "A function to return the highest value found in a complete binary tree."

    # Gets the length of the complete binary tree
    length = len(binary_tree)

    # If the length of the binary tree is 0, return 0
    if length <= 0:
        return 0

    # Otherwise, if the length of the binary tree is 1
    # return the value of the root node
    elif length == 1:
        return binary_tree[0]

    # Otherwise
    else:

        # Get the maximum values of the left and right subtrees
        max_value_left_subtree = get_max_value(binary_tree[0])
        max_value_right_subtree = get_max_value(binary_tree[-1])

        # Set the max value to the value of the root node
        max_value = binary_tree[1]

        # If the left subtree has a greater max value than the root node,
        # set the max value to the one from the left subtree
        if max_value_left_subtree > max_value:
            max_value = max_value_left_subtree

        # If the right subtree has a greater max value than the left subtree
        # or the root node, set the max value to the one from the right subtree
        if max_value_left_subtree > max_value:
            max_value = max_value_right_subtree

        # Return the max value
        return max_value
#+end_src

@@latex: \newpage@@

** Obtain the lowest value found in the complete binary tree
#+begin_src python :results none
def get_min_value(binary_tree: list) -> int:
    "A function to return the lowest value found in a complete binary tree."

    # Gets the length of the complete binary tree
    length = len(binary_tree)

    # If the length of the binary tree is 0, return 0
    if length <= 0:
        return 0

    # Otherwise, if the length of the binary tree is 1
    # return the value of the root node
    elif length == 1:
        return binary_tree[0]

    # Otherwise
    else:

        # Get the minimum values of the left and right subtrees
        min_value_left_subtree = get_min_value(binary_tree[0])
        min_value_right_subtree = get_min_value(binary_tree[-1])

        # Set the minimum value to the value of the root node
        min_value = binary_tree[1]

        # If the left subtree has a smaller minimum value than the root node,
        # set the min value to the one from the left subtree
        if min_value_left_subtree < min_value:
            min_value = min_value_left_subtree

        # If the right subtree has a smaller minimum value than the left subtree
        # or the root node, set the minimum value to the one from the right subtree
        if min_value_left_subtree < min_value:
            min_value = min_value_right_subtree

        # Return the min value
        return min_value
#+end_src

