y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\section{Program complexity evaluation}
\label{sec:org96c7002}
\begin{itemize}
\item There are multiple possible algorithms as well as implementations.
\item Execution time depends on many factors, like:
\begin{itemize}
\item The speed of the computer
\item The way the algorithm is implemented
\begin{itemize}
\item Pre-compute lookup table
\item Loop unrolling technique
\item Input data value and input data size
\end{itemize}
\end{itemize}
\end{itemize}

\subsection{Instruction steps}
\label{sec:orgfe0b0a7}
\begin{itemize}
\item Count the number of instructions it takes to execute the algorithm.
\item It is independent of the computer, and more steps mean longer execution time.
\item The number of steps may still depend on the data involved in the computation.
\end{itemize}

\subsection{Asymptotic behaviour}
\label{sec:org8f1aee1}
\begin{itemize}
\item It is more important to consider the worst case scenario, which is when an item is not in a list, as the number of instruction steps will be the most.
\item As the number of entries in the list increases, the number of steps under the worst case scenario also increases.
\item Input data size is equivalent to the number of entries in the list.
\item In time complexity analysis, the growth pattern of the number of steps as input data size increases indefinitely.
\item The asymptotic behaviour of running time is given by the Big O notation.
\end{itemize}

\subsection{Big O notation}
\label{sec:org80a3389}
\begin{itemize}
\item It measures and compares the time complexity of algorithms.
\item It is how the execution time of the algorithm grows as the size of the input data grows.
\item The execution time is in terms of the number of instruction steps for the worst case scenario.
\item The Big O notation gives an upper bound on the asymptotic growth of an algorithm.
\end{itemize}

\subsection{Analysis of a linear search}
\label{sec:org8ae5e40}

\subsubsection{Assumption}
\label{sec:orgce78419}
Each line of code can be executed in one step.

\subsubsection{Worst case}
\label{sec:org12b82be}
Item isn't in the list

\subsubsection{Asymptotic behaviour}
\label{sec:orgf54f55f}
\begin{itemize}
\item T(n) increases proportionally with n, i.e., T(n) doubles when n is doubled.
\item Growth order: f(n) = n
\end{itemize}

\subsubsection{Complexity using Big O notation [O(f(n)) = O(n)]}
\label{sec:org96c1c13}
\begin{itemize}
\item Linear complexity
\end{itemize}

\section{Complete Binary Tree (CBT) implementation in Python}
\label{sec:org0a47f01}
A complete binary tree can be represented as a list in Python:
\begin{minted}[]{python}
complete_binary_tree = [left_subtree, root, right_subtree]
example = [[[7], 1, [9]], 3, [[8], 2, [4]]]
\end{minted}

\subsection{Total number of nodes in a complete binary tree}
\label{sec:orga5f62be}
\begin{minted}[]{python}
def num_of_nodes(binary_tree: list) -> int:
    "A function to return the number of nodes in a complete binary tree"

    # Gets the length of the complete binary tree
    length = len(binary_tree)

    # If the length of the binary tree is 0 or 1,
    # return the length of the binary tree
    if length <= 1:
        return length

    # Otherwise
    else:

        # Get the number of nodes in the left subtree
        # Remember that the left subtree is the first item in the list
        num_of_nodes_in_left_subtree = num_of_nodes(binary_tree[0])

        # Get the number of nodes in the right subtree
        # Remember that the right subtree is the last item in the list
        num_of_nodes_in_right_subtree = num_of_nodes(binary_tree[-1])

        # Add the number of nodes in the left and right subtrees,
        # adding one because of the middle root node,
        # and return the value
        return (num_of_nodes_in_left_subtree + num_of_nodes_in_right_subtree + 1)
\end{minted}

 \newpage

\subsection{Sum of the node values in a complete binary tree}
\label{sec:org10100d1}
\begin{minted}[]{python}
def sum_of_node_values(binary_tree: list) -> int:
    "A function to return the sum of node values in a complete binary tree"

    # Gets the length of the complete binary tree
    length = len(binary_tree)

    # If the length of the binary tree is 0
    # return zero
    if length <= 0:
        return 0

    # Otherwise, if the length of the binary tree is 1
    # return the value of the root node
    elif length == 1:
        return binary_tree[0]

    # Otherwise
    else:

        # Get the sum of the node values in the left subtree
        # Remember that the left subtree is the first item in the list
        sum_of_node_values_in_left_subtree = sum_of_node_values(binary_tree[0])

        # Get the sum of the node values in the right subtree
        # Remember that the right subtree is the last item in the list
        sum_of_node_values_in_right_subtree = sum_of_node_values(binary_tree[-1])

        # Add the sum of the node values in the left and right subtrees,
        # as well as add the value of the root node,
        # which is the second item in the list
        # and return the value
        return (
            sum_of_node_values_in_left_subtree
            + sum_of_node_values_in_right_subtree
            + binary_tree[1]
        )
\end{minted}

 \newpage

\subsection{Obtain the highest value found in the complete binary tree}
\label{sec:org03fed64}
\begin{minted}[]{python}
def get_max_value(binary_tree: list) -> int:
    "A function to return the highest value found in a complete binary tree."

    # Gets the length of the complete binary tree
    length = len(binary_tree)

    # If the length of the binary tree is 0, return 0
    if length <= 0:
        return 0

    # Otherwise, if the length of the binary tree is 1
    # return the value of the root node
    elif length == 1:
        return binary_tree[0]

    # Otherwise
    else:

        # Get the maximum values of the left and right subtrees
        max_value_left_subtree = get_max_value(binary_tree[0])
        max_value_right_subtree = get_max_value(binary_tree[-1])

        # Set the max value to the value of the root node
        max_value = binary_tree[1]

        # If the left subtree has a greater max value than the root node,
        # set the max value to the one from the left subtree
        if max_value_left_subtree > max_value:
            max_value = max_value_left_subtree

        # If the right subtree has a greater max value than the left subtree
        # or the root node, set the max value to the one from the right subtree
        if max_value_left_subtree > max_value:
            max_value = max_value_right_subtree

        # Return the max value
        return max_value
\end{minted}

 \newpage

\subsection{Obtain the lowest value found in the complete binary tree}
\label{sec:org5e29151}
\begin{minted}[]{python}
def get_min_value(binary_tree: list) -> int:
    "A function to return the lowest value found in a complete binary tree."

    # Gets the length of the complete binary tree
    length = len(binary_tree)

    # If the length of the binary tree is 0, return 0
    if length <= 0:
        return 0

    # Otherwise, if the length of the binary tree is 1
    # return the value of the root node
    elif length == 1:
        return binary_tree[0]

    # Otherwise
    else:

        # Get the minimum values of the left and right subtrees
        min_value_left_subtree = get_min_value(binary_tree[0])
        min_value_right_subtree = get_min_value(binary_tree[-1])

        # Set the minimum value to the value of the root node
        min_value = binary_tree[1]

        # If the left subtree has a smaller minimum value than the root node,
        # set the min value to the one from the left subtree
        if min_value_left_subtree < min_value:
            min_value = min_value_left_subtree

        # If the right subtree has a smaller minimum value than the left subtree
        # or the root node, set the minimum value to the one from the right subtree
        if min_value_left_subtree < min_value:
            min_value = min_value_right_subtree

        # Return the min value
        return min_value
\end{minted}
