y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
** Mirroring a complete binary tree
#+begin_src python :results none
def mirror_binary_tree(binary_tree: list) -> list:
    "Function to mirror a complete binary tree"

    # If the length of the binary tree is 0 or 1,
    # return the binary tree itself
    if len(binary_tree) <= 1:
        return binary_tree

    # Otherwise
    else:

        # Set the parent node to the root node of the binary tree
        parent_node = binary_tree[1]

        # Gets the mirrored version of the left and right subtrees
        mirrored_left_subtree = mirror_binary_tree(binary_tree[0])
        mirrored_right_subtree = mirror_binary_tree(binary_tree[-1])

        # Returns the mirrored binary tree
        return [mirrored_left_subtree, parent_node, mirrored_right_subtree]
#+end_src

@@latex: \newpage@@

** Printing a complete binary tree
#+begin_src python :results none
def print_binary_tree(binary_tree: list, depth: int) -> None:
    """
    Function to print a complete binary tree.

    The depth represents how deep a node is in the binary tree,
    and affects how indented the value should be when printed.

    The binary tree is printed with the root node at the leftmost side
    of the screen, and the left subtree BELOW the root node
    and the right subtree ABOVE the root node.
    """

    # If the length of the binary tree is 0
    # don't print anything and exit the function
    if len(binary_tree) <= 0:
        return

    # If the length of the binary tree is 1
    elif len(binary_tree) == 1:

        # Print 2 spaces x the depth of the node, which is the indent,
        # before the printing the only value of the binary tree.
        # There is no need for a separator between the indent and the value
        print("  " * depth, binary_tree[0], sep="")

    # Otherwise
    else:

        # Print the right subtree of the binary tree first,
        # as it is at the top, increasing the depth by 1
        print_binary_tree(binary_tree[-1], depth + 1)

        # Print the value of the parent node
        print("  " * depth, binary_tree[0], sep="")

        # Print the left subtree of the binary tree last,
        # as it is at the bottom, increasing the depth by 1
        print_binary_tree(binary_tree[0], depth + 1)
#+end_src

@@latex: \newpage@@

* Sorting algorithm implementation in Python

** Bubble sort
This implementation *modifies* the list and *does not return* any value.
#+begin_src python :results none
def bubble_sort(list_of_items: list) -> None:
    "A function to sort a list of items using bubble sort."

    # Length of the list of items
    n = len(list_of_items)

    # Iterates from the first item to the second last item of the list
    for pass_number in range(n - 1):

        # Intialise the swapped variable to False
        swapped = False

        # Iterates over the items in the shortened list
        # The items at the back of the list is sorted and the
        # number of items at that back that are sorted
        # depends on the number of passes, so this makes the sort more efficient.
        for i in range(n - pass_number - 1):

            # Get the current item and the next item
            current_item = list_of_items[i]
            next_item = list_of_items[i+1]

            # If the current item is greater than the next item
            if current_item > next_item:

                # Swap the items and set the swapped variable to True
                list_of_items[i] = next_item
                list_of_items[i+1] = current_item
                swapped = True

        # If no swaps have been performed in the inner for loop,
        # break out of the loop as the entire list is sorted.
        # This is also to improve the efficiency of the sort.
        if not swapped:
            break
#+end_src

** Merge sort
This implementation *returns a sorted list* of the items and *does not modify* the original list.

*** Merge function (used in the merge sort function)
#+begin_src python :results none
def merge(left_list: list, right_list: list) -> list:
    "A function to merge the left list and the right list for merge sort."

    # Gets the length of the sorted list
    sorted_list_length = len(left_list) + len(right_list)

    # Initialise a list of Nones with the length of the sorted list
    sorted_list = [None] * sorted_list_length

    # Initialise the iterating variables
    left_list_index, right_list_index, sorted_list_index = (0, 0, 0)

    # While there are items in both the left and right lists
    while left_list_index < len(left_list) and right_list_index < len(right_list):

        # If the value of the left item is less than the right item,
        # put the value from the left list into the sorted list
        # and increment the index of the left list by 1
        if left_list[left_list_index] < right_list[right_list_index]:
            sorted_list[sorted_list_index] = left_list[left_list_index]
            left_list_index += 1

        # Otherwise, put the value from the left list into the sorted list
        # and increment the index of the left list by 1
        else:
            sorted_list[sorted_list_index] = right_list[right_list_index]
            right_list_index += 1

        # Always increment the index of the sorted list by 1
        sorted_list_index += 1

    # Continued on the next page...

    # The following blocks of code are NOT inside the while loop above.
    # They are in the main block of the function,
    # which is the same indentation level
    # as the "Continued on the next page..." comment

    # If there are still items in the left list
    while left_list_index < len(left_list):

        # Add the item to the sorted list
        sorted_list[sorted_list_index] = left_list[left_list_index]

        # Increment the indexes for both lists by 1
        sorted_list_index += 1
        left_list_index += 1

    # If there are still items in the right list
    while right_list_index < len(right_list):

        # Add the item to the sorted list
        sorted_list[sorted_list_index] = right_list[right_list_index]

        # Increment the indexes for both lists by 1
        sorted_list_index += 1
        right_list_index += 1

    # Return the sorted list
    return sorted_list
#+end_src

@@latex: \newpage@@

*** Merge sort function (the actual sorting function)
This is *the function to use* to sort a list using the merge sort algorithm.
#+begin_src python :results none
def merge_sort(list_of_items: list) -> list:
    "A function to sort the list of items using merge sort."

    # Get the length of the list
    length = len(list_of_items)

    # If the length of the list is less than 2, then return the list of items.
    # This is the base case.
    if length < 2:
        return list_of_items

    # Get the middle of the list.
    # Use the floor division operator to get an integer for lists of odd length.
    middle = length // 2

    # Split the list into 2, and get the left and right list.
    left_list = list_of_items[:middle]
    right_list = list_of_items[middle:]

    # Recursively sort the left and right list
    sorted_left_list = merge_sort(left_list)
    sorted_right_list = merge_sort(right_list)

    # Merge the two lists together and return the sorted list
    return merge(sorted_left_list, sorted_right_list)
#+end_src

@@latex: \newpage@@

* Binary search implementation in Python

