y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
** Iterative binary search
#+begin_src python :results none
def iterative_binary_search(sorted_items: list | tuple, target) -> bool:
    "Function to binary search a sorted collection of items using a loop."

    # Get the index of the lowest item and the highest item
    lowest_item_index = 0
    highest_item_index = len(sorted_items) - 1

    # Iterate while the lowest item index is less than the highest item index
    while lowest_item_index < highest_item_index:

        # Get the middle of the list
        middle_item_index = (lowest_item_index + highest_item_index) // 2

        # Get the middle item of the list
        middle_item = sorted_items[middle_item_index]

        # If the middle item of the list is the target value, return True
        if middle_item == target:
            return True

        # Otherwise, if the target value is less than the middle item,
        # set the highest item index to the middle item index - 1
        elif target < middle_item:
            highest_item_index = middle_item_index - 1

        # Otherwise, if the target value is more than the middle item,
        # set the lowest item index to the middle item index + 1
        else:
            lowest_item_index = middle_item_index + 1

    # If the item is still not found, then return False
    return False
#+end_src

@@latex: \newpage@@

** Recursive binary search
#+begin_src python :results none
def recursive_binary_search(sorted_items: list | tuple, target) -> bool:
    "Function to binary search a sorted collection of items using recursion."

    # Get the index of the lowest item and the highest item
    lowest_item_index = 0
    highest_item_index = len(sorted_items) - 1

    # If the index of the highest item is less than or equal to
    # the index of the lowest item, return False
    if highest_item_index <= lowest_item_index:
        return False

    # Gets the middle item index
    middle_item_index = (lowest_item_index + highest_item_index) // 2

    # Gets the middle item
    middle_item = sorted_items[middle_item_index]

    # If the middle item is the target value, return True
    if middle_item == target:
        return True

    # Otherwise, if the target value is less than the middle item,
    # call the function with the sorted list being truncated to
    # the list before the middle item and return the result
    elif target < middle_item:
        return recursive_binary_search(sorted_items[:middle_item_index], target)

    # Otherwise, if the target value is more than the middle item,
    # call the function with the sorted list being truncated to
    # the list after the middle item and return the result
    else:
        return recursive_binary_search(sorted_items[middle_item_index + 1:], target)
#+end_src

@@latex: \newpage@@

* Data types in Python
Python uses duck-typing to figure out the type of a variable.
- Python does not have variable declaration, like Java or C, to announce or create a variable.
- A variable is created by just assigning a value to it and the type of the value defines the type of the variable.
- If another value is re-assigned to the variable, its type can change.

** Why differentiate between data types?
1. The underlying representations for different data types are different.
2. Different data types support different operations, and for these operations to work, we need to supply them with variables of the correct types.
3. The objects we wish to represent in a computer program are of different types in nature and require different data types.

** String (~str~)
- It is a sequence, typically a sequence of characters delimited by single quotes ~'~ or double quotes ~"~.
- The sequence of characters is important and is maintained.
- Use either single or double quotes to create a string.
- Do not use both single and double quotes to create a string.
- Escape a quote by using the backslash character "\".

@@latex: \newpage@@

*** Index (~[]~)
- Characters in a string are in a sequence
- We can identify each character with a unique index (a position in the sequence).
- We can index a character from either end of the sequence.
  - Non-negative values: counting from left, starting at 0
  - Negative values: counting from right, starting at -1
- The index operator is always at the end of the expression and is preceded by something, either a variable or a sequence.

We can use ~[]~ to access particular characters in a string.
#+NAME: string-indexing
#+begin_src python :results output :exports both
string = "Hello World"
print(string[0])
print(string[1])
print(string[-2])
print(string)
print("omg wow"[4])
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-indexing
: H
: e
: l
: Hello World
: w

@@latex: \newpage@@

*** Slice (~[:]~)
~[start : end : step]~
- ~start~ is the index of the start of the subsequence.
- ~end~ is the index of the end of a subsequence (not included).
- ~step~ specifies the step size to jump along the sequence.

#+NAME: string-slicing
#+begin_src python :results output :exports both
string = "Hello World"
print(string[1:4])
print(string[::2])
print(string[::-2])
print(string[0:14:-1])
print("omg wow"[2:6])
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-slicing
: ell
: HloWrd
: drWolH
:
: g wo

*** Length (~len~)
#+NAME: length-of-a-string
#+begin_src python :results output :exports both
string = "Hello World"
print(len(string))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: length-of-a-string
: 11

*** Concatenation (~+~)
#+NAME: concatenate-string
#+begin_src python :results output :exports both
string = "Hello World"
print(string + "!")
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: concatenate-string
: Hello World!

*** Repeat (~*~)
#+NAME: repeat-string
#+begin_src python :results output :exports both
string = "Hello World"
print(string * 3)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: repeat-string
: Hello WorldHello WorldHello World

*** Comparison
The ASCII or Unicode code obtained using the ~ord~ function is used to compare strings.
#+NAME: string-comparison
#+begin_src python :results output :exports both
print("a" == "a")
print("a" < "b")
print("1" < "9")
print("a" < "B")
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-comparison
: True
: True
: True
: False

*** Membership (~in~)
~a in b~ is True if string ~a~ is contained in string ~b~.
#+NAME: string-membership
#+begin_src python :results output :exports both
string = "abcdef"
print("c" in string)
print("cde" in string)
print("cef" in string)
print(string in string)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-membership
: True
: True
: False
: True

*** Immutability
- Strings are immutable, which means you cannot change a string after it has been created.
  #+begin_src python :results none
  string = "spam"
  string[1] = "l"  # Error
  #+end_src

- However, you can use it to make another string:
  #+NAME: string-edit
  #+begin_src python :results output :exports both
  string = "spam"
  new_string = string[:1] + "l" + string[2:]
  print(new_string)
  #+end_src

  @@latex: \noindent@@ Output:

  #+RESULTS: string-edit
  : slam

@@latex: \newpage@@

** Lists (~list~)
- A list is an *ordered sequence of items*.
- As with all data structures, lists have a *constructor* that is the same name as the data structure.
- Lists are delimited with square brackets (~[]~).

