y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsection{Iterative binary search}
\label{sec:org0c72eb2}
\begin{minted}[]{python}
def iterative_binary_search(sorted_items: list | tuple, target) -> bool:
    "Function to binary search a sorted collection of items using a loop."

    # Get the index of the lowest item and the highest item
    lowest_item_index = 0
    highest_item_index = len(sorted_items) - 1

    # Iterate while the lowest item index is less than the highest item index
    while lowest_item_index < highest_item_index:

        # Get the middle of the list
        middle_item_index = (lowest_item_index + highest_item_index) // 2

        # Get the middle item of the list
        middle_item = sorted_items[middle_item_index]

        # If the middle item of the list is the target value, return True
        if middle_item == target:
            return True

        # Otherwise, if the target value is less than the middle item,
        # set the highest item index to the middle item index - 1
        elif target < middle_item:
            highest_item_index = middle_item_index - 1

        # Otherwise, if the target value is more than the middle item,
        # set the lowest item index to the middle item index + 1
        else:
            lowest_item_index = middle_item_index + 1

    # If the item is still not found, then return False
    return False
\end{minted}

 \newpage

\subsection{Recursive binary search}
\label{sec:org3719889}
\begin{minted}[]{python}
def recursive_binary_search(sorted_items: list | tuple, target) -> bool:
    "Function to binary search a sorted collection of items using recursion."

    # Get the index of the lowest item and the highest item
    lowest_item_index = 0
    highest_item_index = len(sorted_items) - 1

    # If the index of the highest item is less than or equal to
    # the index of the lowest item, return False
    if highest_item_index <= lowest_item_index:
        return False

    # Gets the middle item index
    middle_item_index = (lowest_item_index + highest_item_index) // 2

    # Gets the middle item
    middle_item = sorted_items[middle_item_index]

    # If the middle item is the target value, return True
    if middle_item == target:
        return True

    # Otherwise, if the target value is less than the middle item,
    # call the function with the sorted list being truncated to
    # the list before the middle item and return the result
    elif target < middle_item:
        return recursive_binary_search(sorted_items[:middle_item_index], target)

    # Otherwise, if the target value is more than the middle item,
    # call the function with the sorted list being truncated to
    # the list after the middle item and return the result
    else:
        return recursive_binary_search(sorted_items[middle_item_index + 1:], target)
\end{minted}

 \newpage

\section{Data types in Python}
\label{sec:orgd5ac07a}
Python uses duck-typing to figure out the type of a variable.
\begin{itemize}
\item Python does not have variable declaration, like Java or C, to announce or create a variable.
\item A variable is created by just assigning a value to it and the type of the value defines the type of the variable.
\item If another value is re-assigned to the variable, its type can change.
\end{itemize}

\subsection{Why differentiate between data types?}
\label{sec:org2f6c34b}
\begin{enumerate}
\item The underlying representations for different data types are different.
\item Different data types support different operations, and for these operations to work, we need to supply them with variables of the correct types.
\item The objects we wish to represent in a computer program are of different types in nature and require different data types.
\end{enumerate}

\subsection{String (\texttt{str})}
\label{sec:org70e353d}
\begin{itemize}
\item It is a sequence, typically a sequence of characters delimited by single quotes \texttt{'} or double quotes \texttt{"}.
\item The sequence of characters is important and is maintained.
\item Use either single or double quotes to create a string.
\item Do not use both single and double quotes to create a string.
\item Escape a quote by using the backslash character "$\backslash$".
\end{itemize}

 \newpage

\subsubsection{Index (\texttt{[]})}
\label{sec:org066e061}
\begin{itemize}
\item Characters in a string are in a sequence
\item We can identify each character with a unique index (a position in the sequence).
\item We can index a character from either end of the sequence.
\begin{itemize}
\item Non-negative values: counting from left, starting at 0
\item Negative values: counting from right, starting at -1
\end{itemize}
\item The index operator is always at the end of the expression and is preceded by something, either a variable or a sequence.
\end{itemize}

We can use \texttt{[]} to access particular characters in a string.
\begin{minted}[]{python}
string = "Hello World"
print(string[0])
print(string[1])
print(string[-2])
print(string)
print("omg wow"[4])
\end{minted}

 \noindent Output:

\begin{verbatim}
H
e
l
Hello World
w
\end{verbatim}


 \newpage

\subsubsection{Slice (\texttt{[:]})}
\label{sec:org44dffcd}
\texttt{[start : end : step]}
\begin{itemize}
\item \texttt{start} is the index of the start of the subsequence.
\item \texttt{end} is the index of the end of a subsequence (not included).
\item \texttt{step} specifies the step size to jump along the sequence.
\end{itemize}

\begin{minted}[]{python}
string = "Hello World"
print(string[1:4])
print(string[::2])
print(string[::-2])
print(string[0:14:-1])
print("omg wow"[2:6])
\end{minted}

 \noindent Output:

\begin{verbatim}
ell
HloWrd
drWolH

g wo
\end{verbatim}

\subsubsection{Length (\texttt{len})}
\label{sec:orgeb07bf1}
\begin{minted}[]{python}
string = "Hello World"
print(len(string))
\end{minted}

 \noindent Output:

\begin{verbatim}
11
\end{verbatim}

\subsubsection{Concatenation (\texttt{+})}
\label{sec:orge2d523c}
\begin{minted}[]{python}
string = "Hello World"
print(string + "!")
\end{minted}

 \noindent Output:

\begin{verbatim}
Hello World!
\end{verbatim}

\subsubsection{Repeat (\texttt{*})}
\label{sec:org1adfbc8}
\begin{minted}[]{python}
string = "Hello World"
print(string * 3)
\end{minted}

 \noindent Output:

\begin{verbatim}
Hello WorldHello WorldHello World
\end{verbatim}

\subsubsection{Comparison}
\label{sec:org0b11a12}
The ASCII or Unicode code obtained using the \texttt{ord} function is used to compare strings.
\begin{minted}[]{python}
print("a" == "a")
print("a" < "b")
print("1" < "9")
print("a" < "B")
\end{minted}

 \noindent Output:

\begin{verbatim}
True
True
True
False
\end{verbatim}

\subsubsection{Membership (\texttt{in})}
\label{sec:org53968d4}
\texttt{a in b} is True if string \texttt{a} is contained in string \texttt{b}.
\begin{minted}[]{python}
string = "abcdef"
print("c" in string)
print("cde" in string)
print("cef" in string)
print(string in string)
\end{minted}

 \noindent Output:

\begin{verbatim}
True
True
False
True
\end{verbatim}

\subsubsection{Immutability}
\label{sec:orgc896f77}
\begin{itemize}
\item Strings are immutable, which means you cannot change a string after it has been created.
\begin{minted}[]{python}
string = "spam"
string[1] = "l"  # Error
\end{minted}

\item However, you can use it to make another string:
\begin{minted}[]{python}
string = "spam"
new_string = string[:1] + "l" + string[2:]
print(new_string)
\end{minted}

 \noindent Output:

\begin{verbatim}
slam
\end{verbatim}
\end{itemize}

 \newpage

\subsection{Lists (\texttt{list})}
\label{sec:org204ca7d}
\begin{itemize}
\item A list is an \textbf{ordered sequence of items}.
\item As with all data structures, lists have a \textbf{constructor} that is the same name as the data structure.
\item Lists are delimited with square brackets (\texttt{[]}).
\end{itemize}
