y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
*** Creation
Constructing a list or initialising a list both mean creating a list.

- Creating an empty list
  #+begin_src python :results none
  l = list()
  l = []
  #+end_src

- Creating a list from an iterable data structure, like a set, a tuple, or a string

  #+NAME: list-create-from-iterable
  #+begin_src python :results output :exports both
  print("List from tuple: ", list((1, 2, 3, 4)))
  print("List from set: ", list({1, 2, 3, 4}))
  print("List from string: ", list("1234"))
  #+end_src

  @@latex: \noindent@@ Output:

  #+RESULTS: list-create-from-iterable
  : List from tuple:  [1, 2, 3, 4]
  : List from set:  [1, 2, 3, 4]
  : List from string:  ['1', '2', '3', '4']

- Creating a list with predefined items
  #+begin_src python :results none
  l = [1, 2, 3, 4]
  l = [1, 3.14159, "a", True]
  #+end_src

@@latex: \newpage@@

*** Index (~[]~)
- Items in a list are in a sequence
- We can identify each item in the list with a unique index (a position in the sequence).
- We can index an item from either end of the sequence.
  - Non-negative values: counting from left, starting at 0
  - Negative values: counting from right, starting at -1
- The index operator is always at the end of the expression and is preceded by something, either a variable or a sequence.

We can use ~[]~ to access particular items in a list.
#+NAME: list-indexing
#+begin_src python :results output :exports both
l = [1, "omg wow", 420.69, False]
print(l[0])
print(l[1])
print(l[-2])
print(l)
print(["hey", 5, True][0])
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-indexing
: 1
: omg wow
: 420.69
: [1, 'omg wow', 420.69, False]
: hey

@@latex: \newpage@@

*** Slice (~[:]~)
~[start : end : step]~
- ~start~ is the index of the start of the subsequence.
- ~end~ is the index of the end of a subsequence (not included).
- ~step~ specifies the step size to jump along the sequence.

#+NAME: list-slicing
#+begin_src python :results output :exports both
l = [1, "omg wow", 420.69, False]
print(l[1:4])
print(l[::2])
print(l[::-2])
print(l[0:3:-1])
print(["hey", 5, True, "lovely"][2:4])
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-slicing
: ['omg wow', 420.69, False]
: [1, 420.69]
: [False, 'omg wow']
: []
: [True, 'lovely']

*** Length (~len~)
#+NAME: length-of-a-list
#+begin_src python :results output :exports both
l = [1, "omg wow", 420.69, False]
print(len(l))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: length-of-a-list
: 4

*** Concatenation (~+~)
#+NAME: concatenate-list
#+begin_src python :results output :exports both
l_1 = [1, "omg wow", 420.69, False]
l_2 = ["Finger licking good!", True, "I'm loving it!"]
print(l_1 + l_2)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: concatenate-list
: [1, 'omg wow', 420.69, False, 'Finger licking good!', True, "I'm loving it!"]

*** Repeat (~*~)
#+NAME: repeat-list
#+begin_src python :results output :exports both
l = [1, "omg wow", 420.69, False]
print(l * 2)
l = [3]
print(l * 5)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: repeat-list
: [1, 'omg wow', 420.69, False, 1, 'omg wow', 420.69, False]
: [3, 3, 3, 3, 3]

*** Comparison
- The items of a list are compared starting from the first item.
- This means for the greater than, or less than operators, the list that has the higher value at the front of the list is considered to be greater than the list with the same value at the back of the list.
- The boolean ~True~ is changed into 1 and the boolean ~False~ is changed to 0 comparing lists.
- For two lists to be equal, all items in both lists must be the same, and have the same order.
#+NAME: list-comparison
#+begin_src python :results output :exports both
print([4, 3, 2, 1] > [1, 2, 3, 4])
print([4, 3, 2, 1] == [1, 2, 3, 4])
print([True, 3, 2, 1] >= [1, 2, 3, 4])
print([False, 2, 3, 4] <= [1, 2, 3, 4])
print(["a", "list", "of", "strings"] <= ["string", "list"])
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-comparison
: True
: False
: True
: True
: True

*** Membership (~in~)
~a in b~ is True if ~a~ is contained in the list ~b~.
#+NAME: list-membership
#+begin_src python :results output :exports both
l = [1, "omg wow", 420.69, False]
print(1 in l)
print(420 in l)
print("omg wow" in l)
print("omg" in l)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-membership
: True
: False
: True
: False

*** Minimum (~min~)
- Gets the smallest element in the list.
- Only applicable to *lists containing strings only* or *lists containing numeric values (~int~ and ~float~) and boolean values*.
- The boolean ~True~ is changed into 1 and the boolean ~False~ is changed to 0 when evaluating the minimum of a list.

#+NAME: list-min
#+begin_src python :results output :exports both
l_1 = [1, 2, 420.69, 699]
l_2 = [1, 2, True, False]
l_3 = ["ooo", "a", "list", "of", "Only", "Strings"]
print(min(l_1))
print(min(l_2))
print(min(l_3))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-min
: 1
: False
: Only

*** Maximum (~max~)
- Gets the largest element in the list.
- Only applicable to *lists containing strings only* or *lists containing numeric values (~int~ and ~float~) and boolean values*.
- The boolean ~True~ is changed into 1 and the boolean ~False~ is changed to 0 when evaluating the maximum of a list.

#+NAME: list-max
#+begin_src python :results output :exports both
l_1 = [1, 2, 420.69, 699]
l_2 = [1, 2, True, False]
l_3 = ["ooo", "a", "list", "of", "Only", "Strings"]
print(max(l_1))
print(max(l_2))
print(max(l_3))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-max
: 699
: 2
: ooo

*** Sum (~sum~)
- Gets the sum of the elements of the list.
- Only applicable to lists containing numeric values (~int~ and ~float~) and boolean values.
- The boolean ~True~ is changed into 1 and the boolean ~False~ is changed to 0 when evaluating the maximum of a list.

#+NAME: list-sum
#+begin_src python :results output :exports both
l_1 = [1, 2, 420.69, 699]
l_2 = [1, 2, True, False]
print(sum(l_1))
print(sum(l_2))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-sum
: 1122.69
: 4

*** Mutability
Lists are mutable, which means you can change them after you create them.
#+NAME: list-mutability
#+begin_src python :results output :exports both
l = [1, "omg wow", 420.69, False]
l[1] = "changed the list hehe"
print(l)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-mutability
: [1, 'changed the list hehe', 420.69, False]

*** List of lists
A list can be nested inside another list.
#+NAME: nested-list
#+begin_src python :results output :exports both
l = [1, [1, "a", "list", True], 420.69, False]
print(l[1])
print(l[2])
print(l[1][2])
l[1][3] = "hehe changed the inner list"
print(l)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: nested-list
: [1, 'a', 'list', True]
: 420.69
: list
: [1, [1, 'a', 'list', 'hehe changed the inner list'], 420.69, False]

*** Differences from strings
- Lists can contain a *mixture of Python objects (types)* while strings can only hold characters. (This is not recommended though, your list should only hold items of the same type, otherwise it makes things very difficult to work with.)
- Lists are mutable, which means you can change them.
- Lists are designated with square brackets (~[]~), with elements separated by commas (~,~), while strings use double quotes ~"~ or single quotes ~'~.

** Tuples (~tuple~)
- Tuples are immutable lists, or lists that cannot be changed.
- They are designated by *commas (~,~)*, *NOT* round brackets (~()~).
- Round brackets are often used to make tuples more readable, and used to group the items (like in nested tuples), but they are not what makes a tuple.

