y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsubsection{Creation}
\label{sec:org81493eb}
Constructing a list or initialising a list both mean creating a list.

\begin{itemize}
\item Creating an empty list
\begin{minted}[]{python}
l = list()
l = []
\end{minted}

\item Creating a list from an iterable data structure, like a set, a tuple, or a string

\begin{minted}[]{python}
print("List from tuple: ", list((1, 2, 3, 4)))
print("List from set: ", list({1, 2, 3, 4}))
print("List from string: ", list("1234"))
\end{minted}

 \noindent Output:

\begin{verbatim}
List from tuple:  [1, 2, 3, 4]
List from set:  [1, 2, 3, 4]
List from string:  ['1', '2', '3', '4']
\end{verbatim}

\item Creating a list with predefined items
\begin{minted}[]{python}
l = [1, 2, 3, 4]
l = [1, 3.14159, "a", True]
\end{minted}
\end{itemize}

 \newpage

\subsubsection{Index (\texttt{[]})}
\label{sec:org3998ac4}
\begin{itemize}
\item Items in a list are in a sequence
\item We can identify each item in the list with a unique index (a position in the sequence).
\item We can index an item from either end of the sequence.
\begin{itemize}
\item Non-negative values: counting from left, starting at 0
\item Negative values: counting from right, starting at -1
\end{itemize}
\item The index operator is always at the end of the expression and is preceded by something, either a variable or a sequence.
\end{itemize}

We can use \texttt{[]} to access particular items in a list.
\begin{minted}[]{python}
l = [1, "omg wow", 420.69, False]
print(l[0])
print(l[1])
print(l[-2])
print(l)
print(["hey", 5, True][0])
\end{minted}

 \noindent Output:

\begin{verbatim}
1
omg wow
420.69
[1, 'omg wow', 420.69, False]
hey
\end{verbatim}


 \newpage

\subsubsection{Slice (\texttt{[:]})}
\label{sec:org923e11b}
\texttt{[start : end : step]}
\begin{itemize}
\item \texttt{start} is the index of the start of the subsequence.
\item \texttt{end} is the index of the end of a subsequence (not included).
\item \texttt{step} specifies the step size to jump along the sequence.
\end{itemize}

\begin{minted}[]{python}
l = [1, "omg wow", 420.69, False]
print(l[1:4])
print(l[::2])
print(l[::-2])
print(l[0:3:-1])
print(["hey", 5, True, "lovely"][2:4])
\end{minted}

 \noindent Output:

\begin{verbatim}
['omg wow', 420.69, False]
[1, 420.69]
[False, 'omg wow']
[]
[True, 'lovely']
\end{verbatim}

\subsubsection{Length (\texttt{len})}
\label{sec:org187c216}
\begin{minted}[]{python}
l = [1, "omg wow", 420.69, False]
print(len(l))
\end{minted}

 \noindent Output:

\begin{verbatim}
4
\end{verbatim}

\subsubsection{Concatenation (\texttt{+})}
\label{sec:org1ef33c9}
\begin{minted}[]{python}
l_1 = [1, "omg wow", 420.69, False]
l_2 = ["Finger licking good!", True, "I'm loving it!"]
print(l_1 + l_2)
\end{minted}

 \noindent Output:

\begin{verbatim}
[1, 'omg wow', 420.69, False, 'Finger licking good!', True, "I'm loving it!"]
\end{verbatim}

\subsubsection{Repeat (\texttt{*})}
\label{sec:orgb41f364}
\begin{minted}[]{python}
l = [1, "omg wow", 420.69, False]
print(l * 2)
l = [3]
print(l * 5)
\end{minted}

 \noindent Output:

\begin{verbatim}
[1, 'omg wow', 420.69, False, 1, 'omg wow', 420.69, False]
[3, 3, 3, 3, 3]
\end{verbatim}

\subsubsection{Comparison}
\label{sec:org091c20e}
\begin{itemize}
\item The items of a list are compared starting from the first item.
\item This means for the greater than, or less than operators, the list that has the higher value at the front of the list is considered to be greater than the list with the same value at the back of the list.
\item The boolean \texttt{True} is changed into 1 and the boolean \texttt{False} is changed to 0 comparing lists.
\item For two lists to be equal, all items in both lists must be the same, and have the same order.
\end{itemize}
\begin{minted}[]{python}
print([4, 3, 2, 1] > [1, 2, 3, 4])
print([4, 3, 2, 1] == [1, 2, 3, 4])
print([True, 3, 2, 1] >= [1, 2, 3, 4])
print([False, 2, 3, 4] <= [1, 2, 3, 4])
print(["a", "list", "of", "strings"] <= ["string", "list"])
\end{minted}

 \noindent Output:

\begin{verbatim}
True
False
True
True
True
\end{verbatim}

\subsubsection{Membership (\texttt{in})}
\label{sec:orge4560ca}
\texttt{a in b} is True if \texttt{a} is contained in the list \texttt{b}.
\begin{minted}[]{python}
l = [1, "omg wow", 420.69, False]
print(1 in l)
print(420 in l)
print("omg wow" in l)
print("omg" in l)
\end{minted}

 \noindent Output:

\begin{verbatim}
True
False
True
False
\end{verbatim}

\subsubsection{Minimum (\texttt{min})}
\label{sec:orgffdba75}
\begin{itemize}
\item Gets the smallest element in the list.
\item Only applicable to \textbf{lists containing strings only} or \textbf{lists containing numeric values (\texttt{int} and \texttt{float}) and boolean values}.
\item The boolean \texttt{True} is changed into 1 and the boolean \texttt{False} is changed to 0 when evaluating the minimum of a list.
\end{itemize}

\begin{minted}[]{python}
l_1 = [1, 2, 420.69, 699]
l_2 = [1, 2, True, False]
l_3 = ["ooo", "a", "list", "of", "Only", "Strings"]
print(min(l_1))
print(min(l_2))
print(min(l_3))
\end{minted}

 \noindent Output:

\begin{verbatim}
1
False
Only
\end{verbatim}

\subsubsection{Maximum (\texttt{max})}
\label{sec:orgf4ba587}
\begin{itemize}
\item Gets the largest element in the list.
\item Only applicable to \textbf{lists containing strings only} or \textbf{lists containing numeric values (\texttt{int} and \texttt{float}) and boolean values}.
\item The boolean \texttt{True} is changed into 1 and the boolean \texttt{False} is changed to 0 when evaluating the maximum of a list.
\end{itemize}

\begin{minted}[]{python}
l_1 = [1, 2, 420.69, 699]
l_2 = [1, 2, True, False]
l_3 = ["ooo", "a", "list", "of", "Only", "Strings"]
print(max(l_1))
print(max(l_2))
print(max(l_3))
\end{minted}

 \noindent Output:

\begin{verbatim}
699
2
ooo
\end{verbatim}

\subsubsection{Sum (\texttt{sum})}
\label{sec:org1213c9c}
\begin{itemize}
\item Gets the sum of the elements of the list.
\item Only applicable to lists containing numeric values (\texttt{int} and \texttt{float}) and boolean values.
\item The boolean \texttt{True} is changed into 1 and the boolean \texttt{False} is changed to 0 when evaluating the maximum of a list.
\end{itemize}

\begin{minted}[]{python}
l_1 = [1, 2, 420.69, 699]
l_2 = [1, 2, True, False]
print(sum(l_1))
print(sum(l_2))
\end{minted}

 \noindent Output:

\begin{verbatim}
1122.69
4
\end{verbatim}

\subsubsection{Mutability}
\label{sec:orgdab2ba2}
Lists are mutable, which means you can change them after you create them.
\begin{minted}[]{python}
l = [1, "omg wow", 420.69, False]
l[1] = "changed the list hehe"
print(l)
\end{minted}

 \noindent Output:

\begin{verbatim}
[1, 'changed the list hehe', 420.69, False]
\end{verbatim}

\subsubsection{List of lists}
\label{sec:org95aeeee}
A list can be nested inside another list.
\begin{minted}[]{python}
l = [1, [1, "a", "list", True], 420.69, False]
print(l[1])
print(l[2])
print(l[1][2])
l[1][3] = "hehe changed the inner list"
print(l)
\end{minted}

 \noindent Output:

\begin{verbatim}
[1, 'a', 'list', True]
420.69
list
[1, [1, 'a', 'list', 'hehe changed the inner list'], 420.69, False]
\end{verbatim}

\subsubsection{Differences from strings}
\label{sec:org9445ad6}
\begin{itemize}
\item Lists can contain a \textbf{mixture of Python objects (types)} while strings can only hold characters. (This is not recommended though, your list should only hold items of the same type, otherwise it makes things very difficult to work with.)
\item Lists are mutable, which means you can change them.
\item Lists are designated with square brackets (\texttt{[]}), with elements separated by commas (\texttt{,}), while strings use double quotes \texttt{"} or single quotes \texttt{'}.
\end{itemize}

\subsection{Tuples (\texttt{tuple})}
\label{sec:org8b4a07d}
\begin{itemize}
\item Tuples are immutable lists, or lists that cannot be changed.
\item They are designated by \textbf{commas (\texttt{,})}, \textbf{NOT} round brackets (\texttt{()}).
\item Round brackets are often used to make tuples more readable, and used to group the items (like in nested tuples), but they are not what makes a tuple.
\end{itemize}
