y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
*** Creation
Constructing a tuple or initialising a tuple both mean creating a tuple.

- Creating an empty tuple
  #+begin_src python :results none
  t = tuple()
  #+end_src

- Creating a tuple from an iterable data structure, like a set, a list, or a string

  #+NAME: tuple-create-from-iterable
  #+begin_src python :results output :exports both
  print("Tuple from list: ", tuple([1, 2, 3, 4]))
  print("Tuple from set: ", tuple({1, 2, 3, 4}))
  print("Tuple from string: ", tuple("1234"))
  #+end_src

  @@latex: \noindent@@ Output:

  #+RESULTS: tuple-create-from-iterable
  : Tuple from list:  (1, 2, 3, 4)
  : Tuple from set:  (1, 2, 3, 4)
  : Tuple from string:  ('1', '2', '3', '4')

- Creating a tuple with predefined items
  #+begin_src python :results none
  t = (1, 2, 3, 4)
  t = (1, 3.14159, "a", True)
  t = (1, )
  t = 1,
  #+end_src

*** Index (~[]~)
- Items in a tuple are in a sequence
- We can identify each item in the tuple with a unique index (a position in the sequence).
- We can index an item from either end of the sequence.
  - Non-negative values: counting from left, starting at 0
  - Negative values: counting from right, starting at -1
- The index operator is always at the end of the expression and is preceded by something, either a variable or a sequence.

We can use ~[]~ to access particular items in a tuple.
#+NAME: tuple-indexing
#+begin_src python :results output :exports both
t = (1, "omg wow", 420.69, False)
print(t[0])
print(t[1])
print(t[-2])
print(t)
print(("hey", 5, True)[0])
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: tuple-indexing
: 1
: omg wow
: 420.69
: (1, 'omg wow', 420.69, False)
: hey

@@latex: \newpage@@

*** Slice (~[:]~)
~[start : end : step]~
- ~start~ is the index of the start of the subsequence.
- ~end~ is the index of the end of a subsequence (not included).
- ~step~ specifies the step size to jump along the sequence.

#+NAME: tuple-slicing
#+begin_src python :results output :exports both
t = (1, "omg wow", 420.69, False)
print(t[1:4])
print(t[::2])
print(t[::-2])
print(t[0:3:-1])
print(("hey", 5, True, "lovely")[2:4])
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: tuple-slicing
: ('omg wow', 420.69, False)
: (1, 420.69)
: (False, 'omg wow')
: ()
: (True, 'lovely')

*** Length (~len~)
#+NAME: length-of-a-tuple
#+begin_src python :results output :exports both
t = (1, "omg wow", 420.69, False)
print(len(t))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: length-of-a-tuple
: 4

*** Concatenation (~+~)
#+NAME: concatenate-tuple
#+begin_src python :results output :exports both
t_1 = (1, "omg wow", 420.69, False)
t_2 = ("Finger licking good!", True, "I'm loving it!")
print(t_1 + t_2)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: concatenate-tuple
: (1, 'omg wow', 420.69, False, 'Finger licking good!', True, "I'm loving it!")

*** Repeat (~*~)
#+NAME: repeat-tuple
#+begin_src python :results output :exports both
t = (1, "omg wow", 420.69, False)
print(t * 2)
t = (3,)
print(t * 5)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: repeat-tuple
: (1, 'omg wow', 420.69, False, 1, 'omg wow', 420.69, False)
: (3, 3, 3, 3, 3)

*** Comparison
- The items of a tuple are compared starting from the first item.
- This means for the greater than, or less than operators, the tuple that has the higher value at the front of the tuple is considered to be greater than the tuple with the same value at the back of the tuple.
- The boolean ~True~ is changed into 1 and the boolean ~False~ is changed to 0 comparing tuples.
- For two tuples to be equal, all items in both tuples must be the same, and have the same order.
#+NAME: tuple-comparison
#+begin_src python :results output :exports both
print((4, 3, 2, 1) > (1, 2, 3, 4))
print((4, 3, 2, 1) == (1, 2, 3, 4))
print((True, 3, 2, 1) >= (1, 2, 3, 4))
print((False, 2, 3, 4) <= (1, 2, 3, 4))
print(("a", "tuple", "of", "strings") <= ("string", "tuple"))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: tuple-comparison
: True
: False
: True
: True
: True

*** Membership (~in~)
~a in b~ is True if ~a~ is contained in the tuple ~b~.
#+NAME: tuple-membership
#+begin_src python :results output :exports both
t = (1, "omg wow", 420.69, False)
print(1 in t)
print(420 in t)
print("omg wow" in t)
print("omg" in t)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: tuple-membership
: True
: False
: True
: False

*** Minimum (~min~)
- Gets the smallest element in the tuple.
- Only applicable to *tuples containing strings only* or *tuples containing numeric values (~int~ and ~float~) and boolean values*.
- The boolean ~True~ is changed into 1 and the boolean ~False~ is changed to 0 when evaluating the minimum of a tuple.

#+NAME: tuple-min
#+begin_src python :results output :exports both
t_1 = (1, 2, 420.69, 699)
t_2 = (1, 2, True, False)
t_3 = ("ooo", "a", "tuple", "of", "Only", "Strings")
print(min(t_1))
print(min(t_2))
print(min(t_3))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: tuple-min
: 1
: False
: Only

*** Maximum (~max~)
- Gets the largest element in the tuple.
- Only applicable to *tuples containing strings only* or *tuples containing numeric values (~int~ and ~float~) and boolean values*.
- The boolean ~True~ is changed into 1 and the boolean ~False~ is changed to 0 when evaluating the maximum of a tuple.

#+NAME: tuple-max
#+begin_src python :results output :exports both
t_1 = (1, 2, 420.69, 699)
t_2 = (1, 2, True, False)
t_3 = ("ooo", "a", "tuple", "of", "Only", "Strings")
print(max(t_1))
print(max(t_2))
print(max(t_3))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: tuple-max
: 699
: 2
: tuple

*** Sum (~sum~)
- Gets the sum of the elements of the tuple.
- Only applicable to tuples containing numeric values (~int~ and ~float~) and boolean values.
- The boolean ~True~ is changed into 1 and the boolean ~False~ is changed to 0 when evaluating the maximum of a tuple.

#+NAME: tuple-sum
#+begin_src python :results output :exports both
t_1 = (1, 2, 420.69, 699)
t_2 = (1, 2, True, False)
print(sum(t_1))
print(sum(t_2))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: tuple-sum
: 1122.69
: 4

*** Immutability
- Tuples are immutable, which means you cannot change a tuple after it has been created.
  #+begin_src python :results none
  t = (1, "omg wow", 420.69, False)
  t[1] = "tuple"  # Error
  #+end_src

- However, you can use it to make another tuple:
  #+NAME: tuple-edit
  #+begin_src python :results output :exports both
  t = (1, "omg wow", 420.69, False)
  new_tuple = t[:1] + ("tuple",) + t[2:]
  print(new_tuple)
  #+end_src

  @@latex: \noindent@@ Output:

  #+RESULTS: tuple-edit
  : (1, 'tuple', 420.69, False)

*** Tuple of tuples
A tuple can be nested inside another tuple.
#+NAME: nested-tuple
#+begin_src python :results output :exports both
t = (1, (1, "a", "tuple", True), 420.69, False)
print(t[1])
print(t[2])
print(t[1][2])
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: nested-tuple
: (1, 'a', 'tuple', True)
: 420.69
: tuple

@@latex: \newpage@@

** Dictionaries (~dict~)
- A dictionary is an associative array, or associative list, or a map.
- You can think of it as a list of pairs.
  - The key, which is first element of the pair, is used to retrieve the second element, which is the value.
- Hence, we map a key to a value in a dictionary.
- The key acts as a "lookup" to find the associated value.
- Just like a dictionary, you look up a word by its spelling to find the associated definition.
- A dictionary can be searched to locate the value associated with a key.
- The key of the dictionary must be immutable, so strings, integers and tuples are allowed, but *lists are NOT*.
- The value can be any Python object.

