y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsubsection{Creation}
\label{sec:org65b73ea}
Constructing a tuple or initialising a tuple both mean creating a tuple.

\begin{itemize}
\item Creating an empty tuple
\begin{minted}[]{python}
t = tuple()
\end{minted}

\item Creating a tuple from an iterable data structure, like a set, a list, or a string

\begin{minted}[]{python}
print("Tuple from list: ", tuple([1, 2, 3, 4]))
print("Tuple from set: ", tuple({1, 2, 3, 4}))
print("Tuple from string: ", tuple("1234"))
\end{minted}

 \noindent Output:

\begin{verbatim}
Tuple from list:  (1, 2, 3, 4)
Tuple from set:  (1, 2, 3, 4)
Tuple from string:  ('1', '2', '3', '4')
\end{verbatim}

\item Creating a tuple with predefined items
\begin{minted}[]{python}
t = (1, 2, 3, 4)
t = (1, 3.14159, "a", True)
t = (1, )
t = 1,
\end{minted}
\end{itemize}

\subsubsection{Index (\texttt{[]})}
\label{sec:org0009d78}
\begin{itemize}
\item Items in a tuple are in a sequence
\item We can identify each item in the tuple with a unique index (a position in the sequence).
\item We can index an item from either end of the sequence.
\begin{itemize}
\item Non-negative values: counting from left, starting at 0
\item Negative values: counting from right, starting at -1
\end{itemize}
\item The index operator is always at the end of the expression and is preceded by something, either a variable or a sequence.
\end{itemize}

We can use \texttt{[]} to access particular items in a tuple.
\begin{minted}[]{python}
t = (1, "omg wow", 420.69, False)
print(t[0])
print(t[1])
print(t[-2])
print(t)
print(("hey", 5, True)[0])
\end{minted}

 \noindent Output:

\begin{verbatim}
1
omg wow
420.69
(1, 'omg wow', 420.69, False)
hey
\end{verbatim}


 \newpage

\subsubsection{Slice (\texttt{[:]})}
\label{sec:orgff5a69b}
\texttt{[start : end : step]}
\begin{itemize}
\item \texttt{start} is the index of the start of the subsequence.
\item \texttt{end} is the index of the end of a subsequence (not included).
\item \texttt{step} specifies the step size to jump along the sequence.
\end{itemize}

\begin{minted}[]{python}
t = (1, "omg wow", 420.69, False)
print(t[1:4])
print(t[::2])
print(t[::-2])
print(t[0:3:-1])
print(("hey", 5, True, "lovely")[2:4])
\end{minted}

 \noindent Output:

\begin{verbatim}
('omg wow', 420.69, False)
(1, 420.69)
(False, 'omg wow')
()
(True, 'lovely')
\end{verbatim}

\subsubsection{Length (\texttt{len})}
\label{sec:org2aa1665}
\begin{minted}[]{python}
t = (1, "omg wow", 420.69, False)
print(len(t))
\end{minted}

 \noindent Output:

\begin{verbatim}
4
\end{verbatim}

\subsubsection{Concatenation (\texttt{+})}
\label{sec:orgceba1c8}
\begin{minted}[]{python}
t_1 = (1, "omg wow", 420.69, False)
t_2 = ("Finger licking good!", True, "I'm loving it!")
print(t_1 + t_2)
\end{minted}

 \noindent Output:

\begin{verbatim}
(1, 'omg wow', 420.69, False, 'Finger licking good!', True, "I'm loving it!")
\end{verbatim}

\subsubsection{Repeat (\texttt{*})}
\label{sec:orgbef4861}
\begin{minted}[]{python}
t = (1, "omg wow", 420.69, False)
print(t * 2)
t = (3,)
print(t * 5)
\end{minted}

 \noindent Output:

\begin{verbatim}
(1, 'omg wow', 420.69, False, 1, 'omg wow', 420.69, False)
(3, 3, 3, 3, 3)
\end{verbatim}

\subsubsection{Comparison}
\label{sec:orgf8eba79}
\begin{itemize}
\item The items of a tuple are compared starting from the first item.
\item This means for the greater than, or less than operators, the tuple that has the higher value at the front of the tuple is considered to be greater than the tuple with the same value at the back of the tuple.
\item The boolean \texttt{True} is changed into 1 and the boolean \texttt{False} is changed to 0 comparing tuples.
\item For two tuples to be equal, all items in both tuples must be the same, and have the same order.
\end{itemize}
\begin{minted}[]{python}
print((4, 3, 2, 1) > (1, 2, 3, 4))
print((4, 3, 2, 1) == (1, 2, 3, 4))
print((True, 3, 2, 1) >= (1, 2, 3, 4))
print((False, 2, 3, 4) <= (1, 2, 3, 4))
print(("a", "tuple", "of", "strings") <= ("string", "tuple"))
\end{minted}

 \noindent Output:

\begin{verbatim}
True
False
True
True
True
\end{verbatim}

\subsubsection{Membership (\texttt{in})}
\label{sec:org784b964}
\texttt{a in b} is True if \texttt{a} is contained in the tuple \texttt{b}.
\begin{minted}[]{python}
t = (1, "omg wow", 420.69, False)
print(1 in t)
print(420 in t)
print("omg wow" in t)
print("omg" in t)
\end{minted}

 \noindent Output:

\begin{verbatim}
True
False
True
False
\end{verbatim}

\subsubsection{Minimum (\texttt{min})}
\label{sec:orgb6b7a62}
\begin{itemize}
\item Gets the smallest element in the tuple.
\item Only applicable to \textbf{tuples containing strings only} or \textbf{tuples containing numeric values (\texttt{int} and \texttt{float}) and boolean values}.
\item The boolean \texttt{True} is changed into 1 and the boolean \texttt{False} is changed to 0 when evaluating the minimum of a tuple.
\end{itemize}

\begin{minted}[]{python}
t_1 = (1, 2, 420.69, 699)
t_2 = (1, 2, True, False)
t_3 = ("ooo", "a", "tuple", "of", "Only", "Strings")
print(min(t_1))
print(min(t_2))
print(min(t_3))
\end{minted}

 \noindent Output:

\begin{verbatim}
1
False
Only
\end{verbatim}

\subsubsection{Maximum (\texttt{max})}
\label{sec:org22f50f9}
\begin{itemize}
\item Gets the largest element in the tuple.
\item Only applicable to \textbf{tuples containing strings only} or \textbf{tuples containing numeric values (\texttt{int} and \texttt{float}) and boolean values}.
\item The boolean \texttt{True} is changed into 1 and the boolean \texttt{False} is changed to 0 when evaluating the maximum of a tuple.
\end{itemize}

\begin{minted}[]{python}
t_1 = (1, 2, 420.69, 699)
t_2 = (1, 2, True, False)
t_3 = ("ooo", "a", "tuple", "of", "Only", "Strings")
print(max(t_1))
print(max(t_2))
print(max(t_3))
\end{minted}

 \noindent Output:

\begin{verbatim}
699
2
tuple
\end{verbatim}

\subsubsection{Sum (\texttt{sum})}
\label{sec:orge495dfd}
\begin{itemize}
\item Gets the sum of the elements of the tuple.
\item Only applicable to tuples containing numeric values (\texttt{int} and \texttt{float}) and boolean values.
\item The boolean \texttt{True} is changed into 1 and the boolean \texttt{False} is changed to 0 when evaluating the maximum of a tuple.
\end{itemize}

\begin{minted}[]{python}
t_1 = (1, 2, 420.69, 699)
t_2 = (1, 2, True, False)
print(sum(t_1))
print(sum(t_2))
\end{minted}

 \noindent Output:

\begin{verbatim}
1122.69
4
\end{verbatim}

\subsubsection{Immutability}
\label{sec:org6b3da1c}
\begin{itemize}
\item Tuples are immutable, which means you cannot change a tuple after it has been created.
\begin{minted}[]{python}
t = (1, "omg wow", 420.69, False)
t[1] = "tuple"  # Error
\end{minted}

\item However, you can use it to make another tuple:
\begin{minted}[]{python}
t = (1, "omg wow", 420.69, False)
new_tuple = t[:1] + ("tuple",) + t[2:]
print(new_tuple)
\end{minted}

 \noindent Output:

\begin{verbatim}
(1, 'tuple', 420.69, False)
\end{verbatim}
\end{itemize}

\subsubsection{Tuple of tuples}
\label{sec:orga2775af}
A tuple can be nested inside another tuple.
\begin{minted}[]{python}
t = (1, (1, "a", "tuple", True), 420.69, False)
print(t[1])
print(t[2])
print(t[1][2])
\end{minted}

 \noindent Output:

\begin{verbatim}
(1, 'a', 'tuple', True)
420.69
tuple
\end{verbatim}


 \newpage

\subsection{Dictionaries (\texttt{dict})}
\label{sec:orgc12a682}
\begin{itemize}
\item A dictionary is an associative array, or associative list, or a map.
\item You can think of it as a list of pairs.
\begin{itemize}
\item The key, which is first element of the pair, is used to retrieve the second element, which is the value.
\end{itemize}
\item Hence, we map a key to a value in a dictionary.
\item The key acts as a "lookup" to find the associated value.
\item Just like a dictionary, you look up a word by its spelling to find the associated definition.
\item A dictionary can be searched to locate the value associated with a key.
\item The key of the dictionary must be immutable, so strings, integers and tuples are allowed, but \textbf{lists are NOT}.
\item The value can be any Python object.
\end{itemize}
