y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
*** Creation
Constructing a dictionary or initialising a dictionary both mean creating a dictionary.

- Creating an empty dictionary
  #+begin_src python :results none
  dic = dict()
  dic = {}
  #+end_src

- Creating a dictionary with predefined items
  #+begin_src python :results none
  dic = {"omg": "lol"}
  dic = {1: "lol"}
  dic = {5: 42069}
  #+end_src

@@latex: \newpage@@

*** Index (~[]~)
Items in a dictionary can be indexed using its respective key.

We can use ~[]~ to access particular values in a dictionary.
#+NAME: dictionary-indexing
#+begin_src python :results output :exports both
dic = {
    "bill": 25,
    "tax": 3
}
print(dic["bill"])
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: dictionary-indexing
: 25

*** Adding items (~[]~)
Items can also be added to the dictionary using the indexing operator.
#+NAME: add-to-dictionary
#+begin_src python :results output :exports both
dic = {
    "bill": 25,
    "tax": 3
}
dic["petrol"] = 10
print(dic)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: add-to-dictionary
: {'bill': 25, 'tax': 3, 'petrol': 10}

*** Removing items (~del~)
Items can be removed from the dictionary using ~del~ keyword with the indexing operator.
#+NAME: remove-from-dictionary
#+begin_src python :results output :exports both
dic = {
    "bill": 25,
    "tax": 3
}
del dic["tax"]
print(dic)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: remove-from-dictionary
: {'bill': 25}

*** Length (~len~)
#+NAME: length-of-a-dictionary
#+begin_src python :results output :exports both
dic = {
    "bill": 25,
    "tax": 3
}
print(len(dic))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: length-of-a-dictionary
: 2

*** Membership (~in~)
~a in b~ is True if the key ~a~ is contained in the dictionary ~b~.
#+NAME: dictionary-membership
#+begin_src python :results output :exports both
dic = {
    "bill": 25,
    "tax": 3
}
print("bill" in dic)
print(25 in dic)
print("3" in dic)
print("tax" in dic)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: dictionary-membership
: True
: False
: False
: True

@@latex: \newpage@@

*** For loop (~for~)
A ~for~ loop iterates over the *keys* of the dictionary.
#+NAME: dictionary-for-loop
#+begin_src python :results output :exports both
dic = {
    "bill": 25,
    "tax": 3
}
for key in dic:
    print(key)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: dictionary-for-loop
: bill
: tax

** Integers (~int~)
- Integers are like whole numbers, including the negative numbers. They can be negative (-1, -2, -3, etc), positive (1, 2, 3, etc) or zero (0).
- The largest n-bit integer is given by 2^{n} - 1. For example, the largest 16-bit integer is 2^{16} - 1 = 65535.

** Floats (~float~)
- Floats represent real numbers and have a decimal point, like 2.8, 7.1 and 9.0001.
- When writing them down, they *must always have the decimal point*, so 2 should be represented as 2.0.

** Boolean (~bool~)
In most computer programming languages, a Boolean data type is a data type with only two possible values, either True or False.

@@latex: \newpage@@

* Python syntax

** Statements
Each line of code in a Python program is called a *statement*. Python interprets and runs the statements one by one.

Python is sensitive to the end of line in text files, which marks the end of a statement. In text editors, we press "Enter".

*** Continuation of a statement
- The symbol "\" is used to continue a statement with the next line so that the two lines can be joined as one statement.
- It improves readability in the text editor.

** Comments
- The pound sign "#" in Python indicates a comment.
- *Anything after "#"* is ignored during interpretation.

@@latex: \newpage@@

** ~if~ statements
- A colon must be used to mark the start of a block
- An indentation must be used for the entire block

*** Example
#+begin_src python :results none
a = 5
b = 1
if a > b:
    print("a > b")
#+end_src

*** ~if~-~else~ statements
#+begin_src python :results none
a = 5
b = 1
if a > b:
    print("a > b")
else:
    print("b < a")
#+end_src

*** ~if~-~elif~-~else~ statements
#+begin_src python :results none
a = 5
b = 10
if a > b:
    print("a > b")
elif a > 4:
    print("a > 4")
else:
    print("b < a")
#+end_src

@@latex: \newpage@@

** ~while~ loops
- The ~while~ statement allows repetition of a group of Python code as long as a condition (Boolean expression) is True.
- It is structurally similar to an if statement but repeats the block until the condition becomes False.
- When the condition becomes False, repetition ends and control moves on to the code following the repetition.

*** Syntax
#+begin_src python :results none
count = 0
while count < 10:
    count += 1
#+end_src

** ~while~-~else~ loops (avoid using as much as possible)
- The ~while~ loop can have an associated ~else~ statement.
- The ~else~ block is executed when the loop finishes under normal conditions. It is the last thing the loop does as it exits.
- The ~else~ block is entered after the ~while~ loop's Boolean expression becomes False.
- This occurs even when the expression is initially False and the ~while~ loop has never run.
- It is a handy way to perform some final tasks when the loop ends normally.

*** Syntax
#+begin_src python :results none
count = 0
while count < 10:
    count += 1
else:
    print("Done looping")
#+end_src

** ~break~ statement
- The ~break~ statement can be used to *immediately* exit the execution of the current loop and skip past all the remaining parts of the loop.
- Note that "skip past" also means that the ~break~ statement also *skips* the ~else~ block as well.
- The ~break~ statement is useful for stopping computation when the "answer" has been found or when continuing the computation is otherwise useless.

*** Syntax
#+begin_src python :results none
count = 0
while count < 10:
    count += 1
    if count == 8:
        break

# The else clause is skipped in this case
# as the loop is broken out of when the count hits 8
else:
    print("Done looping")
#+end_src

@@latex: \newpage@@

** ~continue~ statement
- The ~continue~ statement skips some portion of the ~while~ block that we are executing and have control flow back to the beginning of the ~while~ loop.
- Exit early from this iteration of the loop (not the loop itself), and keep executing the ~while~ loop.
- The ~continue~ statement continues with the next iteration of the loop.

*** Syntax
#+begin_src python :results none
count = 0
while count < 10:
    count += 1
    if count == 3:
        print("It's a three!")
        continue

    # This print statement is skipped when the count is 3
    print("count is", count)
#+end_src

@@latex: \newpage@@

** ~for~ loops
- ~for~ loops have the ability to iterate over the items of any sequence, such as a list or a string.
- Each item in the sequence is assigned to the iterating variable, which can be any variable.
- The ~for~ loop completes when the last of the elements has been assigned to the iterating variable, or when the entire sequence is exhausted.

*** Syntax
#+begin_src python :results none
for i in range(10):
    print("i is", i)

for char in "Hello World!":
    print("Current char is", char)

for drink in ("coffee", "tea", "milo"):
    print("Current drink is", drink)
#+end_src

*** ~for~-~else~
#+begin_src python :results none
for i in range(10):
    print("i is", i)
else:
    print("Done looping")
#+end_src

