y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsubsection{Creation}
\label{sec:org618e13c}
Constructing a dictionary or initialising a dictionary both mean creating a dictionary.

\begin{itemize}
\item Creating an empty dictionary
\begin{minted}[]{python}
dic = dict()
dic = {}
\end{minted}

\item Creating a dictionary with predefined items
\begin{minted}[]{python}
dic = {"omg": "lol"}
dic = {1: "lol"}
dic = {5: 42069}
\end{minted}
\end{itemize}

 \newpage

\subsubsection{Index (\texttt{[]})}
\label{sec:orgb8b1d03}
Items in a dictionary can be indexed using its respective key.

We can use \texttt{[]} to access particular values in a dictionary.
\begin{minted}[]{python}
dic = {
    "bill": 25,
    "tax": 3
}
print(dic["bill"])
\end{minted}

 \noindent Output:

\begin{verbatim}
25
\end{verbatim}

\subsubsection{Adding items (\texttt{[]})}
\label{sec:org1ba86c3}
Items can also be added to the dictionary using the indexing operator.
\begin{minted}[]{python}
dic = {
    "bill": 25,
    "tax": 3
}
dic["petrol"] = 10
print(dic)
\end{minted}

 \noindent Output:

\begin{verbatim}
{'bill': 25, 'tax': 3, 'petrol': 10}
\end{verbatim}

\subsubsection{Removing items (\texttt{del})}
\label{sec:org5723b2a}
Items can be removed from the dictionary using \texttt{del} keyword with the indexing operator.
\begin{minted}[]{python}
dic = {
    "bill": 25,
    "tax": 3
}
del dic["tax"]
print(dic)
\end{minted}

 \noindent Output:

\begin{verbatim}
{'bill': 25}
\end{verbatim}

\subsubsection{Length (\texttt{len})}
\label{sec:org4bf8592}
\begin{minted}[]{python}
dic = {
    "bill": 25,
    "tax": 3
}
print(len(dic))
\end{minted}

 \noindent Output:

\begin{verbatim}
2
\end{verbatim}

\subsubsection{Membership (\texttt{in})}
\label{sec:org3f75b23}
\texttt{a in b} is True if the key \texttt{a} is contained in the dictionary \texttt{b}.
\begin{minted}[]{python}
dic = {
    "bill": 25,
    "tax": 3
}
print("bill" in dic)
print(25 in dic)
print("3" in dic)
print("tax" in dic)
\end{minted}

 \noindent Output:

\begin{verbatim}
True
False
False
True
\end{verbatim}


 \newpage

\subsubsection{For loop (\texttt{for})}
\label{sec:org01a8bdc}
A \texttt{for} loop iterates over the \textbf{keys} of the dictionary.
\begin{minted}[]{python}
dic = {
    "bill": 25,
    "tax": 3
}
for key in dic:
    print(key)
\end{minted}

 \noindent Output:

\begin{verbatim}
bill
tax
\end{verbatim}

\subsection{Integers (\texttt{int})}
\label{sec:org93a0c4a}
\begin{itemize}
\item Integers are like whole numbers, including the negative numbers. They can be negative (-1, -2, -3, etc), positive (1, 2, 3, etc) or zero (0).
\item The largest n-bit integer is given by 2\textsuperscript{n} - 1. For example, the largest 16-bit integer is 2\textsuperscript{16} - 1 = 65535.
\end{itemize}

\subsection{Floats (\texttt{float})}
\label{sec:orgb10581f}
\begin{itemize}
\item Floats represent real numbers and have a decimal point, like 2.8, 7.1 and 9.0001.
\item When writing them down, they \textbf{must always have the decimal point}, so 2 should be represented as 2.0.
\end{itemize}

\subsection{Boolean (\texttt{bool})}
\label{sec:orge2ce29d}
In most computer programming languages, a Boolean data type is a data type with only two possible values, either True or False.

 \newpage

\section{Python syntax}
\label{sec:orgcb3151b}

\subsection{Statements}
\label{sec:orgdab9331}
Each line of code in a Python program is called a \textbf{statement}. Python interprets and runs the statements one by one.

Python is sensitive to the end of line in text files, which marks the end of a statement. In text editors, we press "Enter".

\subsubsection{Continuation of a statement}
\label{sec:org9adc69a}
\begin{itemize}
\item The symbol "$\backslash$" is used to continue a statement with the next line so that the two lines can be joined as one statement.
\item It improves readability in the text editor.
\end{itemize}

\subsection{Comments}
\label{sec:org0076b47}
\begin{itemize}
\item The pound sign "\#" in Python indicates a comment.
\item \textbf{Anything after "\#"} is ignored during interpretation.
\end{itemize}

 \newpage

\subsection{\texttt{if} statements}
\label{sec:org42528e8}
\begin{itemize}
\item A colon must be used to mark the start of a block
\item An indentation must be used for the entire block
\end{itemize}

\subsubsection{Example}
\label{sec:orge2f0fcb}
\begin{minted}[]{python}
a = 5
b = 1
if a > b:
    print("a > b")
\end{minted}

\subsubsection{\texttt{if}-\texttt{else} statements}
\label{sec:org9a1437b}
\begin{minted}[]{python}
a = 5
b = 1
if a > b:
    print("a > b")
else:
    print("b < a")
\end{minted}

\subsubsection{\texttt{if}-\texttt{elif}-\texttt{else} statements}
\label{sec:org83c60b8}
\begin{minted}[]{python}
a = 5
b = 10
if a > b:
    print("a > b")
elif a > 4:
    print("a > 4")
else:
    print("b < a")
\end{minted}

 \newpage

\subsection{\texttt{while} loops}
\label{sec:orgbf3ec7a}
\begin{itemize}
\item The \texttt{while} statement allows repetition of a group of Python code as long as a condition (Boolean expression) is True.
\item It is structurally similar to an if statement but repeats the block until the condition becomes False.
\item When the condition becomes False, repetition ends and control moves on to the code following the repetition.
\end{itemize}

\subsubsection{Syntax}
\label{sec:org53fa8b2}
\begin{minted}[]{python}
count = 0
while count < 10:
    count += 1
\end{minted}

\subsection{\texttt{while}-\texttt{else} loops (avoid using as much as possible)}
\label{sec:org2238774}
\begin{itemize}
\item The \texttt{while} loop can have an associated \texttt{else} statement.
\item The \texttt{else} block is executed when the loop finishes under normal conditions. It is the last thing the loop does as it exits.
\item The \texttt{else} block is entered after the \texttt{while} loop's Boolean expression becomes False.
\item This occurs even when the expression is initially False and the \texttt{while} loop has never run.
\item It is a handy way to perform some final tasks when the loop ends normally.
\end{itemize}

\subsubsection{Syntax}
\label{sec:org56f888b}
\begin{minted}[]{python}
count = 0
while count < 10:
    count += 1
else:
    print("Done looping")
\end{minted}

\subsection{\texttt{break} statement}
\label{sec:org4ed2ee9}
\begin{itemize}
\item The \texttt{break} statement can be used to \textbf{immediately} exit the execution of the current loop and skip past all the remaining parts of the loop.
\item Note that "skip past" also means that the \texttt{break} statement also \textbf{skips} the \texttt{else} block as well.
\item The \texttt{break} statement is useful for stopping computation when the "answer" has been found or when continuing the computation is otherwise useless.
\end{itemize}

\subsubsection{Syntax}
\label{sec:org36e9304}
\begin{minted}[]{python}
count = 0
while count < 10:
    count += 1
    if count == 8:
        break

# The else clause is skipped in this case
# as the loop is broken out of when the count hits 8
else:
    print("Done looping")
\end{minted}

 \newpage

\subsection{\texttt{continue} statement}
\label{sec:orga9b4c91}
\begin{itemize}
\item The \texttt{continue} statement skips some portion of the \texttt{while} block that we are executing and have control flow back to the beginning of the \texttt{while} loop.
\item Exit early from this iteration of the loop (not the loop itself), and keep executing the \texttt{while} loop.
\item The \texttt{continue} statement continues with the next iteration of the loop.
\end{itemize}

\subsubsection{Syntax}
\label{sec:org98956c4}
\begin{minted}[]{python}
count = 0
while count < 10:
    count += 1
    if count == 3:
        print("It's a three!")
        continue

    # This print statement is skipped when the count is 3
    print("count is", count)
\end{minted}

 \newpage

\subsection{\texttt{for} loops}
\label{sec:org850de87}
\begin{itemize}
\item \texttt{for} loops have the ability to iterate over the items of any sequence, such as a list or a string.
\item Each item in the sequence is assigned to the iterating variable, which can be any variable.
\item The \texttt{for} loop completes when the last of the elements has been assigned to the iterating variable, or when the entire sequence is exhausted.
\end{itemize}

\subsubsection{Syntax}
\label{sec:org6398dd4}
\begin{minted}[]{python}
for i in range(10):
    print("i is", i)

for char in "Hello World!":
    print("Current char is", char)

for drink in ("coffee", "tea", "milo"):
    print("Current drink is", drink)
\end{minted}
