y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
*** ~for~-~else~-~break~
#+begin_src python :results none
for i in range(10):
    if i == 5:
        break
    print("i is", i)

# This else statement is skipped as
# the loop is broken out of when i is 5
else:
    print("Done looping")
#+end_src

*** ~for~-~else~-~break~-~continue~
#+begin_src python :results none
for i in range(10):
    if i == 5:
        break
    if i == 3:
        print("It's a three!")
        continue

    # This print statement is skipped when i is 3
    print("i is", i)

# This else statement is skipped as
# the loop is broken out of when i is 5
else:
    print("Done looping")
#+end_src

** ~pass~ statement
- The ~pass~ statement has no effect (it does nothing) but it helps in indicating an *empty* statement, suite, or block.
- Use the ~pass~ statement when you have to put something in a statement (syntactically, you cannot leave it blank or Python will complain), but what you really want is nothing.
- Python has the syntactical requirement that code blocks after ~if~, ~for~, ~while~, ~except~, ~def~, ~class~, etc cannot be empty.
- It can be used to *test a statement*, like opening a file or iterating through a collection to see if it works.
- You can also use ~pass~ as a placeholder.

*** Syntax
#+begin_src python :results none
for i in range(10):
    pass
#+end_src

@@latex: \newpage@@

** List comprehension
- List comprehensions are a Python syntactic structure to construct lists concisely.
- The first variable before the ~for~ is what is placed into the list.
- The ~for~ loop is just a regular for loop.
- Any ~for~ loops after the first for loop will be *nested inside* the for loop before it. If there is a ~if~ statement at the end of the previous for loop, the next ~for~ loop will be placed inside the ~if~ statement. (This is absolutely not recommended as it makes code impossible to read.)
- Any ~if~ statements after the ~for~ loop will determine what will be added to the list. Basically, if the item doesn't meet the condition in the ~if~ statement, it's not added to the list.

*** Syntax
#+NAME: list-comprehension-syntax
#+begin_src python :results output :exports both
print([i for i in range(11)])
print([i for i in range(21) if i % 2 == 0])
print([i for i in range(21) if i % 2 == 0 and i >= 10])

# Please don't do this, just use a regular for loop instead
print([x + y for x in range(9) if x % 2 == 0 for y in range(9) if y % 2 != 0])
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-comprehension-syntax
: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
: [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
: [10, 12, 14, 16, 18, 20]
: [1, 3, 5, 7, 3, 5, 7, 9, 5, 7, 9, 11, 7, 9, 11, 13, 9, 11, 13, 15]

@@latex: \newpage@@

*** Equivalent code using for loops
1. The first list comprehension:
   #+NAME: list-comprehension-equivalent-1
   #+begin_src python :results output :exports both
   l = []
   for i in range(11):
       l.append(i)
   print(l)
   #+end_src

   @@latex: \noindent@@ Output:

   #+RESULTS: list-comprehension-equivalent-1
   : [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

2. The second list comprehension:
   #+NAME: list-comprehension-equivalent-2
   #+begin_src python :results output :exports both
   l = []
   for i in range(21):
       if i % 2 == 0:
           l.append(i)
   print(l)
   #+end_src

   @@latex: \noindent@@ Output:

   #+RESULTS: list-comprehension-equivalent-2
   : [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

3. The third list comprehension:
   #+NAME: list-comprehension-equivalent-3
   #+begin_src python :results output :exports both
   l = []
   for i in range(21):
       if i % 2 == 0 and i >= 10:
           l.append(i)
   print(l)
   #+end_src

   @@latex: \noindent@@ Output:

   #+RESULTS: list-comprehension-equivalent-3
   : [10, 12, 14, 16, 18, 20]

   @@latex: \newpage@@

4. The fourth list comprehension:
   #+NAME: list-comprehension-equivalent-4
   #+begin_src python :results output :exports both
   l = []
   for x in range(9):
       if x % 2 == 0:
           for y in range(9):
               if y % 2 != 0:
                   l.append(x + y)
   print(l)
   #+end_src

   @@latex: \noindent@@ Output:

   #+RESULTS: list-comprehension-equivalent-4
   : [1, 3, 5, 7, 3, 5, 7, 9, 5, 7, 9, 11, 7, 9, 11, 13, 9, 11, 13, 15]

** Functions

*** Defining a function
- Functions in Python are defined using the ~def~ keyword.
- After the ~def~ keyword comes the name of the function, which has the same rules as Python identifiers. Refer to the [[sec:python-identifiers][section on Python identifiers]] for the rules.
- After the name of the function, there are parentheses (~()~) to indicate the function parameters, which are the inputs to be passed to a function.
- Each parameter inside the parentheses (~()~) is separated with a comma (~,~).
- If there are no parameters, an empty pair of parentheses (~()~) is fine as well.
- After the parameter list in parentheses, a colon (~:~) must be present at the back of the function definition.
- The line after the colon (~:~) must be indented, and is the start of the function body.

*** Function definition example
#+begin_src python :results none
# Function with parameters
def function_definition(parameter_1, parameter_2):

    # Function body...
    print("Just defined a function!")
    print("Printing arguments...")
    print("parameter_1: {}".format(parameter_1))
    print("parameter_2: {}".format(parameter_2))

    # Optional return statement (can be omitted).
    # When the return statement is omitted,
    # the function returns None
    return parameter_1 + parameter_2

# Function without parameters
def no_args_function():

    # Use pass to skip defining the function
    # This function will return None
    pass
#+end_src

*** Using a function
- Using a function is also called invoking a function or calling a function.
- To use a function, type out the function name and put the parentheses (~()~), as well as the desired arguments behind if there are any.

#+begin_src python :results none
# No arguments
print()

# With arguments
print("Hi there!")
#+end_src

@@latex: \newpage@@

** Exception handling (~try~-~except~ block)

*** ~try~ block
- The ~try~ block contains code that *we want to monitor* for errors during execution.
- If an error occurs anywhere in that ~try~ block, Python looks for a *handler* that can deal with the error.
- If no specific handler exists, Python handles it.
  - The program halts with an error message.

*** ~except~ block
- The ~except~ block is associated with a ~try~ block.
- A ~try~ block can have *multiple* ~except~ blocks after it.
- Each ~except~ block names a type of exception it is monitoring for and can *handle*.
- If the error occurring in the ~try~ block matches the type of exception, then the *first* ~except~ block is activated.

*** ~try~-~except~ block
- If no exception is in the ~try~ block, skip to the next line of code after the ~try~-~except~ block.
- If an error occurs in a ~try~ block, look for the correct exception handler in the ~except~ blocks.

*** Syntax
#+begin_src python :results none
try:
    do_something()
    do_something_else()
    do_something_with_error()
except TypeError:
    handle_type_error()
except IndexError:
    handle_index_error()
#+end_src

