y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsubsection{\texttt{for}-\texttt{else}}
\label{sec:org7d40a71}
\begin{minted}[]{python}
for i in range(10):
    print("i is", i)
else:
    print("Done looping")
\end{minted}

\subsubsection{\texttt{for}-\texttt{else}-\texttt{break}}
\label{sec:orgb2c448e}
\begin{minted}[]{python}
for i in range(10):
    if i == 5:
        break
    print("i is", i)

# This else statement is skipped as
# the loop is broken out of when i is 5
else:
    print("Done looping")
\end{minted}

\subsubsection{\texttt{for}-\texttt{else}-\texttt{break}-\texttt{continue}}
\label{sec:orgd903e5b}
\begin{minted}[]{python}
for i in range(10):
    if i == 5:
        break
    if i == 3:
        print("It's a three!")
        continue

    # This print statement is skipped when i is 3
    print("i is", i)

# This else statement is skipped as
# the loop is broken out of when i is 5
else:
    print("Done looping")
\end{minted}

\subsection{\texttt{pass} statement}
\label{sec:org4373235}
\begin{itemize}
\item The \texttt{pass} statement has no effect (it does nothing) but it helps in indicating an \textbf{empty} statement, suite, or block.
\item Use the \texttt{pass} statement when you have to put something in a statement (syntactically, you cannot leave it blank or Python will complain), but what you really want is nothing.
\item Python has the syntactical requirement that code blocks after \texttt{if}, \texttt{for}, \texttt{while}, \texttt{except}, \texttt{def}, \texttt{class}, etc cannot be empty.
\item It can be used to \textbf{test a statement}, like opening a file or iterating through a collection to see if it works.
\item You can also use \texttt{pass} as a placeholder.
\end{itemize}

\subsubsection{Syntax}
\label{sec:org456f011}
\begin{minted}[]{python}
for i in range(10):
    pass
\end{minted}

 \newpage

\subsection{List comprehension}
\label{sec:orgf66ed04}
\begin{itemize}
\item List comprehensions are a Python syntactic structure to construct lists concisely.
\item The first variable before the \texttt{for} is what is placed into the list.
\item The \texttt{for} loop is just a regular for loop.
\item Any \texttt{for} loops after the first for loop will be \textbf{nested inside} the for loop before it. If there is a \texttt{if} statement at the end of the previous for loop, the next \texttt{for} loop will be placed inside the \texttt{if} statement. (This is absolutely not recommended as it makes code impossible to read.)
\item Any \texttt{if} statements after the \texttt{for} loop will determine what will be added to the list. Basically, if the item doesn't meet the condition in the \texttt{if} statement, it's not added to the list.
\end{itemize}

\subsubsection{Syntax}
\label{sec:orgabbfb60}
\begin{minted}[]{python}
print([i for i in range(11)])
print([i for i in range(21) if i % 2 == 0])
print([i for i in range(21) if i % 2 == 0 and i >= 10])

# Please don't do this, just use a regular for loop instead
print([x + y for x in range(9) if x % 2 == 0 for y in range(9) if y % 2 != 0])
\end{minted}

 \noindent Output:

\begin{verbatim}
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
[0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
[10, 12, 14, 16, 18, 20]
[1, 3, 5, 7, 3, 5, 7, 9, 5, 7, 9, 11, 7, 9, 11, 13, 9, 11, 13, 15]
\end{verbatim}


 \newpage

\subsubsection{Equivalent code using for loops}
\label{sec:orgc3f905f}
\begin{enumerate}
\item The first list comprehension:
\begin{minted}[]{python}
l = []
for i in range(11):
    l.append(i)
print(l)
\end{minted}

 \noindent Output:

\begin{verbatim}
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
\end{verbatim}

\item The second list comprehension:
\begin{minted}[]{python}
l = []
for i in range(21):
    if i % 2 == 0:
        l.append(i)
print(l)
\end{minted}

 \noindent Output:

\begin{verbatim}
[0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
\end{verbatim}

\item The third list comprehension:
\begin{minted}[]{python}
l = []
for i in range(21):
    if i % 2 == 0 and i >= 10:
        l.append(i)
print(l)
\end{minted}

 \noindent Output:

\begin{verbatim}
[10, 12, 14, 16, 18, 20]
\end{verbatim}


 \newpage

\item The fourth list comprehension:
\begin{minted}[]{python}
l = []
for x in range(9):
    if x % 2 == 0:
        for y in range(9):
            if y % 2 != 0:
                l.append(x + y)
print(l)
\end{minted}

 \noindent Output:

\begin{verbatim}
[1, 3, 5, 7, 3, 5, 7, 9, 5, 7, 9, 11, 7, 9, 11, 13, 9, 11, 13, 15]
\end{verbatim}
\end{enumerate}

\subsection{Functions}
\label{sec:orgc5a411c}

\subsubsection{Defining a function}
\label{sec:org3ef9053}
\begin{itemize}
\item Functions in Python are defined using the \texttt{def} keyword.
\item After the \texttt{def} keyword comes the name of the function, which has the same rules as Python identifiers. Refer to the \hyperref[org72b2d39]{section on Python identifiers} for the rules.
\item After the name of the function, there are parentheses (\texttt{()}) to indicate the function parameters, which are the inputs to be passed to a function.
\item Each parameter inside the parentheses (\texttt{()}) is separated with a comma (\texttt{,}).
\item If there are no parameters, an empty pair of parentheses (\texttt{()}) is fine as well.
\item After the parameter list in parentheses, a colon (\texttt{:}) must be present at the back of the function definition.
\item The line after the colon (\texttt{:}) must be indented, and is the start of the function body.
\end{itemize}

\subsubsection{Function definition example}
\label{sec:org9a65db8}
\begin{minted}[]{python}
# Function with parameters
def function_definition(parameter_1, parameter_2):

    # Function body...
    print("Just defined a function!")
    print("Printing arguments...")
    print("parameter_1: {}".format(parameter_1))
    print("parameter_2: {}".format(parameter_2))

    # Optional return statement (can be omitted).
    # When the return statement is omitted,
    # the function returns None
    return parameter_1 + parameter_2

# Function without parameters
def no_args_function():

    # Use pass to skip defining the function
    # This function will return None
    pass
\end{minted}

\subsubsection{Using a function}
\label{sec:org83803e4}
\begin{itemize}
\item Using a function is also called invoking a function or calling a function.
\item To use a function, type out the function name and put the parentheses (\texttt{()}), as well as the desired arguments behind if there are any.
\end{itemize}

\begin{minted}[]{python}
# No arguments
print()

# With arguments
print("Hi there!")
\end{minted}

 \newpage

\subsection{Exception handling (\texttt{try}-\texttt{except} block)}
\label{sec:orge23df89}

\subsubsection{\texttt{try} block}
\label{sec:orgeded3c7}
\begin{itemize}
\item The \texttt{try} block contains code that \textbf{we want to monitor} for errors during execution.
\item If an error occurs anywhere in that \texttt{try} block, Python looks for a \textbf{handler} that can deal with the error.
\item If no specific handler exists, Python handles it.
\begin{itemize}
\item The program halts with an error message.
\end{itemize}
\end{itemize}

\subsubsection{\texttt{except} block}
\label{sec:org45be527}
\begin{itemize}
\item The \texttt{except} block is associated with a \texttt{try} block.
\item A \texttt{try} block can have \textbf{multiple} \texttt{except} blocks after it.
\item Each \texttt{except} block names a type of exception it is monitoring for and can \textbf{handle}.
\item If the error occurring in the \texttt{try} block matches the type of exception, then the \textbf{first} \texttt{except} block is activated.
\end{itemize}

\subsubsection{\texttt{try}-\texttt{except} block}
\label{sec:org49a34ae}
\begin{itemize}
\item If no exception is in the \texttt{try} block, skip to the next line of code after the \texttt{try}-\texttt{except} block.
\item If an error occurs in a \texttt{try} block, look for the correct exception handler in the \texttt{except} blocks.
\end{itemize}

\subsubsection{Syntax}
\label{sec:orgff4ebd7}
\begin{minted}[]{python}
try:
    do_something()
    do_something_else()
    do_something_with_error()
except TypeError:
    handle_type_error()
except IndexError:
    handle_index_error()
\end{minted}
