y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
*** Example
#+begin_src python :results none
try:
    print("Entering the try block")
    dividend = float(input("Enter the dividend: "))
    divisor = float(input("Enter the divisor: "))
    result = dividend / divisor
    print("The result is ", result)

except ZeroDivisionError:
    print("Can't divide by 0!")

except ValueError:
    print("Couldn't convert your input to a float")

print("Continuing with the rest of the program...")
#+end_src

*** Built-in exceptions
- Python has a list of exceptions that are built-in.
- To find an exception that you're interested in, you can try it in the Python interpreter.
- You can also look at the Python documentation on exceptions.

*** ~else~ block
The ~else~ block is used to execute code when *no exception* occurs.

#+begin_src python :results none
try:
    result = do_something_with_error()
except IndexError:
    handle_index_error()
else:
    do_something_with_result(result)
#+end_src

@@latex: \newpage@@

*** ~finally~ block
- The ~finally~ block is used to execute code at the end of a ~try~-~except~ block, regardless of whether an error has occurred.
- The ~finally~ block must be placed *after all the other blocks* in the ~try~-~except~ code block.

#+begin_src python :results none
try:
    do_something_with_error()
except TypeError:
    handle_type_error()
finally:
    always_do_this_regardless_of_error()
#+end_src

*** ~try~-~except~-~else~-~finally~
Note that the ~else~ block must always come *before* the ~finally~ block.
#+begin_src python :results none
try:
    result = x / y
except ZeroDivisionError:
    print("Divide by zero!")
else:
    print(result)
finally:
    print("Goodbye!")
#+end_src

** Method in general
#+begin_src python :results none
object.method()
#+end_src

@@latex: \noindent@@ We say that ~object~ is calling the method ~method~.


** Whitespace
Python counts the "Tab", "Space bar" and "Enter" as white spaces.
- The purpose of whitespace is to separate words in a statement.
- For the most part, you can place white spaces anywhere in your program to make the code more readable.

** Indentation
An indentation is a leading whitespace at the start of a statement. In Python, a group of indented statements is called a *suite* or a *block*. A *compound statement* is a set of statements being used as a group.

Purpose of indentation:
- Makes the code more readable
- For grouping, particularly for control flow such as branching and looping

** Arithmetic operators

#+ATTR_LATEX: :environment tabular :align |c|m{32em}|
|----------+--------------------------------------------------------------------------------------------------------------------------------|
| Operator | Meaning                                                                                                                        |
|----------+--------------------------------------------------------------------------------------------------------------------------------|
| ~+~      | Add two operands or unary plus                                                                                                 |
|----------+--------------------------------------------------------------------------------------------------------------------------------|
| ~-~      | Subtract the right operand from the left or unary minus                                                                        |
|----------+--------------------------------------------------------------------------------------------------------------------------------|
| ~*~      | Multiply two operands                                                                                                          |
|----------+--------------------------------------------------------------------------------------------------------------------------------|
| ~/~      | Floating point division: divide the left operand by the right one (always results in a ~float~)                                |
|----------+--------------------------------------------------------------------------------------------------------------------------------|
| ~%~      | Modulus: remainder of the division of the left operand by the right                                                            |
|----------+--------------------------------------------------------------------------------------------------------------------------------|
| ~//~     | Floor division (integer division): the resultant value is a whole integer, although the result's type is not necessarily ~int~ |
|----------+--------------------------------------------------------------------------------------------------------------------------------|
| ~**~     | Exponent: the left operant is raised to the power of the right operand                                                         |
|----------+--------------------------------------------------------------------------------------------------------------------------------|

** Augmented assignment operators

#+ATTR_LATEX: :environment tabular :align c|c
| Shortcut | Equivalent  |
|----------+-------------|
| ~x += 2~ | ~x = x + 2~ |
| ~x -= 2~ | ~x = x - 2~ |
| ~x /= 2~ | ~x = x / 2~ |
| ~x *= 2~ | ~x = x * 2~ |
| ~x %= 2~ | ~x = x % 2~ |

@@latex: \newpage@@

** "Truthy" and "falsy" values
<<sec:truthy-and-falsy-values>>
A "truthy" value is a value that will satisfy the check performed by ~if~ or ~while~ statements, while "falsy" values will not. "Truthy" and "falsy" are used to differentiate from the ~bool~ values ~True~ and ~False~.

@@latex: \noindent@@ All values are considered "truthy", except for the following, which are considered "falsy":
- ~None~
- ~False~
- ~0~
- ~0.0~
- ~0j~
- ~Decimal(0)~
- ~Fraction(0, 1)~
- ~[]~ - an empty ~list~
- ~{}~ - an empty ~dict~
- ~tuple()~ - an empty ~tuple~
- ~''~ - an empty ~str~
- ~b''~ - an empty ~bytes~
- ~set()~ - an empty ~set~
- An empty range, like ~range(0)~
- Objects for which:
  - ~obj.__bool__()~ returns ~False~
  - ~obj.__len__()~ returns ~0~

@@latex: \newpage@@

** Chained comparisons
In Python, chained comparisons work just like you would expect in a mathematical expression.

*** Examples
- ~0 <= x <= 5~ is the same as ~0 <= x and x <= 5~.
- ~0 <= x <= 5 > 10~ is the same as ~0 <= x and x <= 5 and x > 10~.

@@latex: \newpage@@

* Documentation for Python functions

** Floor division operator (~//~)
- The floor division operator takes the floor of the left number divided by the right number. Flooring a number means to round the number down to the integer. For example, flooring 5.987 will result in 5.0, and flooring -3.14 will result in -4.0.
- Take note that flooring a floating point number (~float~), will result in a *floating point number (~float~)* being returned, *NOT* an integer (~int~).
- To get an integer type back, use the ~math.floor~ function instead, which returns an integer instead of a float when flooring a floating point number.

*** Syntax
~x // y~

** Modulus operator (remainder operator) (~%~)
The modulus operator takes the remainder of the left number divided by the right number.

*** Syntax
~x % y~

@@latex: \noindent@@ The remainder of ~x / y~.

*** Formula used to calculate the remainder
~x % y = x - y * (x // y)~

*** Example
#+NAME: modulus
#+begin_src python :results output :exports both
print(8 % 3)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: modulus
: 2

@@latex: \newpage@@

** Boolean AND operator (~and~)
Return the first *"falsy"* value if there are any, else return the *last* value in the expression. Refer to the [[sec:truthy-and-falsy-values][section on "truthy" and "falsy" values]] for an explanation of "falsy".

*** Syntax
#+begin_src python :results none
a and b
#+end_src

*** Example
#+NAME: boolean-and
#+begin_src python :results output :exports both
a = 1
b = 5
print(a > 1 and b < 10)
print(a == 1 and b > 3)
print(a and b)
print(False and "something")
print(1 and 5 and 6 and 0 and 10 and 9)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: boolean-and
: False
: True
: 5
: False
: 0

@@latex: \newpage@@

