y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsubsection{Example}
\label{sec:org9ecb7d8}
\begin{minted}[]{python}
try:
    print("Entering the try block")
    dividend = float(input("Enter the dividend: "))
    divisor = float(input("Enter the divisor: "))
    result = dividend / divisor
    print("The result is ", result)

except ZeroDivisionError:
    print("Can't divide by 0!")

except ValueError:
    print("Couldn't convert your input to a float")

print("Continuing with the rest of the program...")
\end{minted}

\subsubsection{Built-in exceptions}
\label{sec:orgcd50195}
\begin{itemize}
\item Python has a list of exceptions that are built-in.
\item To find an exception that you're interested in, you can try it in the Python interpreter.
\item You can also look at the Python documentation on exceptions.
\end{itemize}

\subsubsection{\texttt{else} block}
\label{sec:orgafe1686}
The \texttt{else} block is used to execute code when \textbf{no exception} occurs.

\begin{minted}[]{python}
try:
    result = do_something_with_error()
except IndexError:
    handle_index_error()
else:
    do_something_with_result(result)
\end{minted}

 \newpage

\subsubsection{\texttt{finally} block}
\label{sec:orgbe15b37}
\begin{itemize}
\item The \texttt{finally} block is used to execute code at the end of a \texttt{try}-\texttt{except} block, regardless of whether an error has occurred.
\item The \texttt{finally} block must be placed \textbf{after all the other blocks} in the \texttt{try}-\texttt{except} code block.
\end{itemize}

\begin{minted}[]{python}
try:
    do_something_with_error()
except TypeError:
    handle_type_error()
finally:
    always_do_this_regardless_of_error()
\end{minted}

\subsubsection{\texttt{try}-\texttt{except}-\texttt{else}-\texttt{finally}}
\label{sec:orga1c7bd5}
Note that the \texttt{else} block must always come \textbf{before} the \texttt{finally} block.
\begin{minted}[]{python}
try:
    result = x / y
except ZeroDivisionError:
    print("Divide by zero!")
else:
    print(result)
finally:
    print("Goodbye!")
\end{minted}

\subsection{Method in general}
\label{sec:orgca3f910}
\begin{minted}[]{python}
object.method()
\end{minted}

 \noindent We say that \texttt{object} is calling the method \texttt{method}.


\subsection{Whitespace}
\label{sec:org8439d83}
Python counts the "Tab", "Space bar" and "Enter" as white spaces.
\begin{itemize}
\item The purpose of whitespace is to separate words in a statement.
\item For the most part, you can place white spaces anywhere in your program to make the code more readable.
\end{itemize}

\subsection{Indentation}
\label{sec:org5a38bdc}
An indentation is a leading whitespace at the start of a statement. In Python, a group of indented statements is called a \textbf{suite} or a \textbf{block}. A \textbf{compound statement} is a set of statements being used as a group.

Purpose of indentation:
\begin{itemize}
\item Makes the code more readable
\item For grouping, particularly for control flow such as branching and looping
\end{itemize}

\subsection{Arithmetic operators}
\label{sec:orgefe1281}

\begin{center}
\begin{tabular}{|c|m{32em}|}
\hline
Operator & Meaning\\[0pt]
\hline
\texttt{+} & Add two operands or unary plus\\[0pt]
\hline
\texttt{-} & Subtract the right operand from the left or unary minus\\[0pt]
\hline
\texttt{*} & Multiply two operands\\[0pt]
\hline
\texttt{/} & Floating point division: divide the left operand by the right one (always results in a \texttt{float})\\[0pt]
\hline
\texttt{\%} & Modulus: remainder of the division of the left operand by the right\\[0pt]
\hline
\texttt{//} & Floor division (integer division): the resultant value is a whole integer, although the result's type is not necessarily \texttt{int}\\[0pt]
\hline
\texttt{**} & Exponent: the left operant is raised to the power of the right operand\\[0pt]
\hline
\end{tabular}
\end{center}

\subsection{Augmented assignment operators}
\label{sec:org47ea036}

\begin{center}
\begin{tabular}{c|c}
Shortcut & Equivalent\\[0pt]
\hline
\texttt{x += 2} & \texttt{x = x + 2}\\[0pt]
\texttt{x -= 2} & \texttt{x = x - 2}\\[0pt]
\texttt{x /= 2} & \texttt{x = x / 2}\\[0pt]
\texttt{x *= 2} & \texttt{x = x * 2}\\[0pt]
\texttt{x \%= 2} & \texttt{x = x \% 2}\\[0pt]
\end{tabular}
\end{center}

 \newpage

\subsection{"Truthy" and "falsy" values}
\label{sec:org757cee3}
\label{orgf40bd7d}
A "truthy" value is a value that will satisfy the check performed by \texttt{if} or \texttt{while} statements, while "falsy" values will not. "Truthy" and "falsy" are used to differentiate from the \texttt{bool} values \texttt{True} and \texttt{False}.

 \noindent All values are considered "truthy", except for the following, which are considered "falsy":
\begin{itemize}
\item \texttt{None}
\item \texttt{False}
\item \texttt{0}
\item \texttt{0.0}
\item \texttt{0j}
\item \texttt{Decimal(0)}
\item \texttt{Fraction(0, 1)}
\item \texttt{[]} - an empty \texttt{list}
\item \texttt{\{\}} - an empty \texttt{dict}
\item \texttt{tuple()} - an empty \texttt{tuple}
\item \texttt{''} - an empty \texttt{str}
\item \texttt{b''} - an empty \texttt{bytes}
\item \texttt{set()} - an empty \texttt{set}
\item An empty range, like \texttt{range(0)}
\item Objects for which:
\begin{itemize}
\item \texttt{obj.\_\_bool\_\_()} returns \texttt{False}
\item \texttt{obj.\_\_len\_\_()} returns \texttt{0}
\end{itemize}
\end{itemize}

 \newpage

\subsection{Chained comparisons}
\label{sec:org30cb554}
In Python, chained comparisons work just like you would expect in a mathematical expression.

\subsubsection{Examples}
\label{sec:orgdc5f7e7}
\begin{itemize}
\item \texttt{0 <= x <= 5} is the same as \texttt{0 <= x and x <= 5}.
\item \texttt{0 <= x <= 5 > 10} is the same as \texttt{0 <= x and x <= 5 and x > 10}.
\end{itemize}

 \newpage

\section{Documentation for Python functions}
\label{sec:orgcbe5ca7}

\subsection{Floor division operator (\texttt{//})}
\label{sec:org7055f52}
\begin{itemize}
\item The floor division operator takes the floor of the left number divided by the right number. Flooring a number means to round the number down to the integer. For example, flooring 5.987 will result in 5.0, and flooring -3.14 will result in -4.0.
\item Take note that flooring a floating point number (\texttt{float}), will result in a \textbf{floating point number (\texttt{float})} being returned, \textbf{NOT} an integer (\texttt{int}).
\item To get an integer type back, use the \texttt{math.floor} function instead, which returns an integer instead of a float when flooring a floating point number.
\end{itemize}

\subsubsection{Syntax}
\label{sec:org4cfd3da}
\texttt{x // y}

\subsection{Modulus operator (remainder operator) (\texttt{\%})}
\label{sec:orgcccd81a}
The modulus operator takes the remainder of the left number divided by the right number.

\subsubsection{Syntax}
\label{sec:org25b461d}
\texttt{x \% y}

 \noindent The remainder of \texttt{x / y}.

\subsubsection{Formula used to calculate the remainder}
\label{sec:org1f9b059}
\texttt{x \% y = x - y * (x // y)}

\subsubsection{Example}
\label{sec:orga9d9c68}
\begin{minted}[]{python}
print(8 % 3)
\end{minted}

 \noindent Output:

\begin{verbatim}
2
\end{verbatim}


 \newpage

\subsection{Boolean AND operator (\texttt{and})}
\label{sec:orgf898fdc}
Return the first \textbf{"falsy"} value if there are any, else return the \textbf{last} value in the expression. Refer to the \hyperref[orgf40bd7d]{section on "truthy" and "falsy" values} for an explanation of "falsy".

\subsubsection{Syntax}
\label{sec:org1632c42}
\begin{minted}[]{python}
a and b
\end{minted}

\subsubsection{Example}
\label{sec:org20dfc11}
\begin{minted}[]{python}
a = 1
b = 5
print(a > 1 and b < 10)
print(a == 1 and b > 3)
print(a and b)
print(False and "something")
print(1 and 5 and 6 and 0 and 10 and 9)
\end{minted}

 \noindent Output:

\begin{verbatim}
False
True
5
False
0
\end{verbatim}


 \newpage
