y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
** Boolean OR operator (~or~)
Return the first *"truthy"* value if there are any, else return the *last* value in the expression. Refer to the [[sec:truthy-and-falsy-values][section on "truthy" and "falsy" values]] for an explanation of "truthy".

*** Syntax
#+begin_src python :results none
a or b
#+end_src

*** Example
#+NAME: boolean-or
#+begin_src python :results output :exports both
a = 1
b = 5
print(a > 1 or b < 10)
print(a == 1 or b > 3)
print(a or b)
print(False or "something")
print(1 or 5 or 6 or 0 or 10 or 9)
print("" or "default value")
print(False or "" or 0 or [] or "wow")
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: boolean-or
: True
: True
: 1
: something
: 1
: default value
: wow

@@latex: \newpage@@

*** In combination with the boolean AND operator (~and~)
#+NAME: boolean-or-and
#+begin_src python :results output :exports both
a = 5
b = 10
print((a == 5 or b > 30) and (a < 2 or b > 5))
print(a >= 3 and b < 15 or a < 3 and b > 8)
print(a and b or b or a)
print(a and b or b and a or a or b or a)
print(0 and 5 or 100)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: boolean-or-and
: True
: True
: 10
: 10
: 100

** ~input~
~input~ is a built-in function in Python to get an input.
- It prints the message string on the screen and waits until the user types anything and presses "Enter".
- It returns a *string* no matter what is given, even a number.

*** Usage
#+begin_src python :results none
user_input = input("Please enter an input: ")
#+end_src

@@latex: \noindent@@ ~user_input~ will be a *string*.

@@latex: \newpage@@

** ~print~
~print~ is another built-in function in Python that displays related messages and data on the shell screen. It uses a *comma* to separate the elements.

#+NAME: print
#+begin_src python :results output :exports both
a = 1
b = 2
print("a is", a, "and b is", b)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: print
: a is 1 and b is 2

*** ~sep~ parameter (optional)
~sep~ takes a *string* that specifies what *string* to use to separate the objects passed to the function, if there is more than one. It defaults to a space character, " ".

#+NAME: sep
#+begin_src python :results output :exports both
a = 1
b = 2
print("a is", a, "and b is", b, sep=" @ ")
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: sep
: a is @ 1 @ and b is @ 2

*** ~end~ parameter (optional)
~end~ takes a *string* that specifies what the end of the printed string should be. It defaults to a new line "=\n=".

#+NAME: end
#+begin_src python :results output :exports both
print("Hello world!")
print("My first program.")
print("Hello world!", end=" ")
print("My first program.")
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: end
: Hello world!
: My first program.
: Hello world! My first program.

*** ~file~ parameter (optional)
- ~file~ takes a *file object* as the file to print to.
- Nothing will be printed to the screen when this parameter is given.
- Instead, the file will be written to with the items given to the ~print~ function.
#+begin_src python :results none
file = open("temp.txt", "w")
print("First line", file=file)
print("Second line", file=file)
print("Third line", file=file)
file.close()
#+end_src

** ~range~
~range([start], end[, step])~
- ~start~ is the starting number of the sequence. The default value is 0.
- ~end~ is the number to generate numbers up to, but not including this number.
- ~step~ is the difference between each number in the sequence. The default value is 1.

*** ~range(end)~
- Python sets ~start~ to 0 and ~step~ to 1.

#+NAME: range-end
#+begin_src python :results output :exports both
print(list(range(11)))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: range-end
: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

*** ~range(start, end)~
- Python sets ~step~ to 1.

#+NAME: range-start-end
#+begin_src python :results output :exports both
print(list(range(1, 11)))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: range-start-end
: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

*** ~range(start, end, step)~

#+NAME: range-start-end-step
#+begin_src python :results output :exports both
print(list(range(1, 11, 2)))
print(list(range(11, 2, -2)))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: range-start-end-step
: [1, 3, 5, 7, 9]
: [11, 9, 7, 5, 3]

** ~ord~
Takes a character as input and returns the Unicode of the character. For standard symbols, this is the same as in ASCII.

#+NAME: ord
#+begin_src python :results output :exports both
print(ord("a"))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: ord
: 97

** ~chr~
Takes an ASCII or UTF-8 code and returns the corresponding character.

#+NAME: chr
#+begin_src python :results output :exports both
print(chr(97))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: chr
: a

@@latex: \newpage@@

** ~sorted~
- This function takes a collection, like a *list*, *tuple*, *dictionary*, or a *set*, and returns a *sorted list* of the items in the collection.
- This function does not modify the original collection, and returns a *new* list.
- This function uses a sorting algorithm called [[https://en.wikipedia.org/wiki/Timsort][Timsort]].

#+NAME: sorted
#+begin_src python :results output :exports both
num_list = [10, 6, 3, 1, 9]
num_tuple = (10, 6, 3, 1, 9)
num_set = {10, 6, 3, 1, 9}
num_dict = {
    10: "ten",
    6: "six",
    3: "three",
    1: "one",
    9: "nine"
}

print(sorted(num_list))
print(sorted(num_tuple))
print(sorted(num_set))
print(sorted(num_dict))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: sorted
: [1, 3, 6, 9, 10]
: [1, 3, 6, 9, 10]
: [1, 3, 6, 9, 10]
: [1, 3, 6, 9, 10]

@@latex: \newpage@@

*** ~key~ parameter (optional)
- ~key~ takes a function that acts on the *items* in the collection that is being sorted.
- The sorting algorithm uses the *result* of that function to sort the values.

#+NAME: sorted-key
#+begin_src python :results output :exports both
num_list = [10, 6, 3, 1, 9]
num_dict = {
    10: "ten",
    6: "six",
    3: "three",
    1: "one",
    9: "nine"
}

def get_dict_value(dict_item: tuple):
    "Function to get the value from the dictionary when calling dict.items()"
    return dict_item[1]

def alternate(num: int) -> int:
    """
    Function to change the sign of the number based on its value.

    For example, for 10, this function will return:
    result = 10 * (-1) ** (10 + 1)
    result = 10 * (-1) ** 11
    result = 10 * (-1)
    result = -10
    """
    return num * (-1) ** (num + 1)

# Sort based on the dictionary value, which is to sort using alphabetical order
print(sorted(num_dict.items(), key=get_dict_value))

print(sorted(num_list, key=alternate))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: sorted-key
: [(9, 'nine'), (1, 'one'), (6, 'six'), (10, 'ten'), (3, 'three')]
: [10, 6, 1, 3, 9]

*** ~reverse~ parameter (optional)
- ~reverse~ takes a boolean that tells the sorted function to reverse the list.
- The value of ~True~ will *reverse* the list.
- The value of ~False~ will *not* reverse the list.
- The default value is ~False~.

#+NAME: sorted-reverse
#+begin_src python :results output :exports both
num_list = [10, 6, 3, 1, 9]

print(sorted(num_list))
print(sorted(num_list, reverse=True))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: sorted-reverse
: [1, 3, 6, 9, 10]
: [10, 9, 6, 3, 1]

@@latex: \newpage@@

