y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsection{Boolean OR operator (\texttt{or})}
\label{sec:org89146a6}
Return the first \textbf{"truthy"} value if there are any, else return the \textbf{last} value in the expression. Refer to the \hyperref[orgf40bd7d]{section on "truthy" and "falsy" values} for an explanation of "truthy".

\subsubsection{Syntax}
\label{sec:org9bde34f}
\begin{minted}[]{python}
a or b
\end{minted}

\subsubsection{Example}
\label{sec:orgca02704}
\begin{minted}[]{python}
a = 1
b = 5
print(a > 1 or b < 10)
print(a == 1 or b > 3)
print(a or b)
print(False or "something")
print(1 or 5 or 6 or 0 or 10 or 9)
print("" or "default value")
print(False or "" or 0 or [] or "wow")
\end{minted}

 \noindent Output:

\begin{verbatim}
True
True
1
something
1
default value
wow
\end{verbatim}


 \newpage

\subsubsection{In combination with the boolean AND operator (\texttt{and})}
\label{sec:orgcf84b8e}
\begin{minted}[]{python}
a = 5
b = 10
print((a == 5 or b > 30) and (a < 2 or b > 5))
print(a >= 3 and b < 15 or a < 3 and b > 8)
print(a and b or b or a)
print(a and b or b and a or a or b or a)
print(0 and 5 or 100)
\end{minted}

 \noindent Output:

\begin{verbatim}
True
True
10
10
100
\end{verbatim}

\subsection{\texttt{input}}
\label{sec:orgc424e1f}
\texttt{input} is a built-in function in Python to get an input.
\begin{itemize}
\item It prints the message string on the screen and waits until the user types anything and presses "Enter".
\item It returns a \textbf{string} no matter what is given, even a number.
\end{itemize}

\subsubsection{Usage}
\label{sec:orga9ff496}
\begin{minted}[]{python}
user_input = input("Please enter an input: ")
\end{minted}

 \noindent \texttt{user\_input} will be a \textbf{string}.

 \newpage

\subsection{\texttt{print}}
\label{sec:org4577853}
\texttt{print} is another built-in function in Python that displays related messages and data on the shell screen. It uses a \textbf{comma} to separate the elements.

\begin{minted}[]{python}
a = 1
b = 2
print("a is", a, "and b is", b)
\end{minted}

 \noindent Output:

\begin{verbatim}
a is 1 and b is 2
\end{verbatim}

\subsubsection{\texttt{sep} parameter (optional)}
\label{sec:org058f510}
\texttt{sep} takes a \textbf{string} that specifies what \textbf{string} to use to separate the objects passed to the function, if there is more than one. It defaults to a space character, " ".

\begin{minted}[]{python}
a = 1
b = 2
print("a is", a, "and b is", b, sep=" @ ")
\end{minted}

 \noindent Output:

\begin{verbatim}
a is @ 1 @ and b is @ 2
\end{verbatim}

\subsubsection{\texttt{end} parameter (optional)}
\label{sec:orgef4f96d}
\texttt{end} takes a \textbf{string} that specifies what the end of the printed string should be. It defaults to a new line "\texttt{\textbackslash{}n}".

\begin{minted}[]{python}
print("Hello world!")
print("My first program.")
print("Hello world!", end=" ")
print("My first program.")
\end{minted}

 \noindent Output:

\begin{verbatim}
Hello world!
My first program.
Hello world! My first program.
\end{verbatim}

\subsubsection{\texttt{file} parameter (optional)}
\label{sec:orgc48bf16}
\begin{itemize}
\item \texttt{file} takes a \textbf{file object} as the file to print to.
\item Nothing will be printed to the screen when this parameter is given.
\item Instead, the file will be written to with the items given to the \texttt{print} function.
\end{itemize}
\begin{minted}[]{python}
file = open("temp.txt", "w")
print("First line", file=file)
print("Second line", file=file)
print("Third line", file=file)
file.close()
\end{minted}

\subsection{\texttt{range}}
\label{sec:org92b523d}
\texttt{range([start], end[, step])}
\begin{itemize}
\item \texttt{start} is the starting number of the sequence. The default value is 0.
\item \texttt{end} is the number to generate numbers up to, but not including this number.
\item \texttt{step} is the difference between each number in the sequence. The default value is 1.
\end{itemize}

\subsubsection{\texttt{range(end)}}
\label{sec:orgab96e4e}
\begin{itemize}
\item Python sets \texttt{start} to 0 and \texttt{step} to 1.
\end{itemize}

\begin{minted}[]{python}
print(list(range(11)))
\end{minted}

 \noindent Output:

\begin{verbatim}
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
\end{verbatim}

\subsubsection{\texttt{range(start, end)}}
\label{sec:orgb72b473}
\begin{itemize}
\item Python sets \texttt{step} to 1.
\end{itemize}

\begin{minted}[]{python}
print(list(range(1, 11)))
\end{minted}

 \noindent Output:

\begin{verbatim}
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
\end{verbatim}

\subsubsection{\texttt{range(start, end, step)}}
\label{sec:orgd8b8a6b}

\begin{minted}[]{python}
print(list(range(1, 11, 2)))
print(list(range(11, 2, -2)))
\end{minted}

 \noindent Output:

\begin{verbatim}
[1, 3, 5, 7, 9]
[11, 9, 7, 5, 3]
\end{verbatim}

\subsection{\texttt{ord}}
\label{sec:org20a4728}
Takes a character as input and returns the Unicode of the character. For standard symbols, this is the same as in ASCII.

\begin{minted}[]{python}
print(ord("a"))
\end{minted}

 \noindent Output:

\begin{verbatim}
97
\end{verbatim}

\subsection{\texttt{chr}}
\label{sec:orgcc0fa40}
Takes an ASCII or UTF-8 code and returns the corresponding character.

\begin{minted}[]{python}
print(chr(97))
\end{minted}

 \noindent Output:

\begin{verbatim}
a
\end{verbatim}


 \newpage

\subsection{\texttt{sorted}}
\label{sec:orgc8c9a0f}
\begin{itemize}
\item This function takes a collection, like a \textbf{list}, \textbf{tuple}, \textbf{dictionary}, or a \textbf{set}, and returns a \textbf{sorted list} of the items in the collection.
\item This function does not modify the original collection, and returns a \textbf{new} list.
\item This function uses a sorting algorithm called \href{https://en.wikipedia.org/wiki/Timsort}{Timsort}.
\end{itemize}

\begin{minted}[]{python}
num_list = [10, 6, 3, 1, 9]
num_tuple = (10, 6, 3, 1, 9)
num_set = {10, 6, 3, 1, 9}
num_dict = {
    10: "ten",
    6: "six",
    3: "three",
    1: "one",
    9: "nine"
}

print(sorted(num_list))
print(sorted(num_tuple))
print(sorted(num_set))
print(sorted(num_dict))
\end{minted}

 \noindent Output:

\begin{verbatim}
[1, 3, 6, 9, 10]
[1, 3, 6, 9, 10]
[1, 3, 6, 9, 10]
[1, 3, 6, 9, 10]
\end{verbatim}


 \newpage

\subsubsection{\texttt{key} parameter (optional)}
\label{sec:org59bed96}
\begin{itemize}
\item \texttt{key} takes a function that acts on the \textbf{items} in the collection that is being sorted.
\item The sorting algorithm uses the \textbf{result} of that function to sort the values.
\end{itemize}

\begin{minted}[]{python}
num_list = [10, 6, 3, 1, 9]
num_dict = {
    10: "ten",
    6: "six",
    3: "three",
    1: "one",
    9: "nine"
}

def get_dict_value(dict_item: tuple):
    "Function to get the value from the dictionary when calling dict.items()"
    return dict_item[1]

def alternate(num: int) -> int:
    """
    Function to change the sign of the number based on its value.

    For example, for 10, this function will return:
    result = 10 * (-1) ** (10 + 1)
    result = 10 * (-1) ** 11
    result = 10 * (-1)
    result = -10
    """
    return num * (-1) ** (num + 1)

# Sort based on the dictionary value, which is to sort using alphabetical order
print(sorted(num_dict.items(), key=get_dict_value))

print(sorted(num_list, key=alternate))
\end{minted}

 \noindent Output:

\begin{verbatim}
[(9, 'nine'), (1, 'one'), (6, 'six'), (10, 'ten'), (3, 'three')]
[10, 6, 1, 3, 9]
\end{verbatim}

\subsubsection{\texttt{reverse} parameter (optional)}
\label{sec:org70cd256}
\begin{itemize}
\item \texttt{reverse} takes a boolean that tells the sorted function to reverse the list.
\item The value of \texttt{True} will \textbf{reverse} the list.
\item The value of \texttt{False} will \textbf{not} reverse the list.
\item The default value is \texttt{False}.
\end{itemize}

\begin{minted}[]{python}
num_list = [10, 6, 3, 1, 9]

print(sorted(num_list))
print(sorted(num_list, reverse=True))
\end{minted}

 \noindent Output:

\begin{verbatim}
[1, 3, 6, 9, 10]
[10, 9, 6, 3, 1]
\end{verbatim}


 \newpage
