y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
** String method: ~string.upper~
This method will output a new string, which is the same as the string on which it was called, except all letters in the string will now be in uppercase.

#+NAME: string-upper
#+begin_src python :results output :exports both
string = "Shouting!"
print(string.upper())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-upper
: SHOUTING!

** String method: ~string.lower~
This method will output a new string, which is the same as the string on which it was called, except all letters in the string will now be in lowercase.

#+NAME: string-lower
#+begin_src python :results output :exports both
string = "WHISPERING"
print(string.lower())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-lower
: whispering

** String method: ~string.title~
This method will output a new string, which is the same as the string on which it was called, except that the string will be in title case, which means that every word in the string will be capitalised.

#+NAME: string-title
#+begin_src python :results output :exports both
string = "john f. kennedy"
print(string.title())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-title
: John F. Kennedy

** String method: ~string.capitalize~
- This method will output a new string, which is the same as the string on which it was called, except that the first letter of the first word of the string will be capitalised.
- Take note that capitalize is using the American spelling with a "z", instead of the British spelling with a "s".

#+NAME: string-capitalise
#+begin_src python :results output :exports both
string = "this is a sentence."
print(string.capitalize())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-capitalise
: This is a sentence.

** String method: ~string.find~
- This method takes a single character and outputs the *index* of the character (first seen from left to right).
- If the character is not found, ~-1~ is returned.

#+NAME: string-find
#+begin_src python :results output :exports both
string = "Find me!"
print(string.find("m"))
print(string.find("a"))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-find
: 5
: -1

@@latex: \newpage@@

** String method: ~string.index~
- This method takes a single character and outputs the *index* of the character (first seen from left to right).
- If the character is not found, a ~ValueError~ is thrown.
- This method is essentially the same as the above ~string.find~ method, but it throws an error when the value isn't found.
- In a way, it's a worse version of the ~string.find~ method.

#+NAME: string-index
#+begin_src python :results output :exports both
string = "Find me!"
print(string.index("m"))
print(string.index("a"))    # Error
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-index
: 5

** String method: ~string.count~
This method counts the number of occurrences of the substring you pass to the method.

#+NAME: string-count
#+begin_src python :results output :exports both
string = "This is an pretty long sentence."
print(string.count("i"))
print(string.count("t"))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-count
: 2
: 3

@@latex: \newpage@@

** String method: ~string.join~
This method takes a *string* to be joined and outputs a new string where the base string joins the target string.

#+NAME: string-join
#+begin_src python :results output :exports both
string_1 = "1234"
string_2 = "abcd"
print(string_1.join(string_2))
print(string_2.join(string_1))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-join
: a1234b1234c1234d
: 1abcd2abcd3abcd4

** String method: ~string.split~
- This method takes a *string* and generates a list of strings by splitting the string at the given string.
- The default character the string splits at is *whitespace*.
- This method returns a list of strings.

#+NAME: string-split
#+begin_src python :results output :exports both
l = "oooo a list of strings"
print(l.split())
print(l.split("o"))
print(l.split("st"))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-split
: ['oooo', 'a', 'list', 'of', 'strings']
: ['', '', '', '', ' a list ', 'f strings']
: ['oooo a li', ' of ', 'rings']

@@latex: \newpage@@

** String method: ~string.isalnum~
Returns ~True~ if all characters in the string are *alphanumeric*, which means all the letters of the alphabet and the numbers 0 to 9.

#+NAME: string-isalnum
#+begin_src python :results output :exports both
print("abcdef12345".isalnum())
print("abcdef12345_".isalnum())
print("abcdef12345_(*&#)".isalnum())
print("-1".isalnum())
print("1.5".isalnum())
print("-1.5".isalnum())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-isalnum
: True
: False
: False
: False
: False
: False

** String method: ~string.isalpha~
Returns ~True~ if all characters in the string are in the *alphabet*.

#+NAME: string-isalpha
#+begin_src python :results output :exports both
print("abcdef".isalpha())
print("abcdef12345".isalpha())
print("abcdef12345_(*&#)".isalpha())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-isalpha
: True
: False
: False

@@latex: \newpage@@

** String method: ~string.isascii~
Returns ~True~ if all characters in the string are *ASCII characters*.

#+NAME: string-isascii
#+begin_src python :results output :exports both
print("abcdef".isascii())
print("abcdef12345".isascii())
print("abcdef12345_(*&#)".isascii())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-isascii
: True
: True
: True

** String method: ~string.isdecimal~
Returns ~True~ if all characters in the string are *decimals (0 to 9)*.

#+NAME: string-isdecimal
#+begin_src python :results output :exports both
print("12392483".isdecimal())
print("sldkfjd".isdecimal())
print("abcdef12345".isdecimal())
print("abcdef12345_(*&#)".isdecimal())
print("-1".isdecimal())
print("1.5".isdecimal())
print("-1.5".isdecimal())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-isdecimal
: True
: False
: False
: False
: False
: False
: False

@@latex: \newpage@@

** String method: ~string.isdigit~
- Returns ~True~ if all characters in the string are *digits*.
- Exponents like the superscript 2 in 1^{2} are also considered digits.
- ~"-1"~, ~"1.5"~ and ~"-1.5"~ are *not* considered digits as all the characters in the string must be a digit. ~"-"~ and ~"."~ are not digits.

#+NAME: string-isdigit
#+begin_src python :results output :exports both
print("12392483".isdigit())
print("sldkfjd".isdigit())
print("abcdef12345".isdigit())
print("abcdef12345_(*&#)".isdigit())
print("-1".isdigit())
print("1.5".isdigit())
print("-1.5".isdigit())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-isdigit
: True
: False
: False
: False
: False
: False
: False

** String method: ~string.isidentifier~
Returns ~True~ if the string is *a valid Python identifier*. Basically, it checks if the string is a valid Python variable name.

#+NAME: string-isidentifier
#+begin_src python :results output :exports both
print("12392483".isidentifier())
print("varname".isidentifier())
print("_private".isidentifier())
print("string1".isidentifier())
print("omg!".isidentifier())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-isidentifier
: False
: True
: True
: True
: False

** String method: ~string.islower~
Returns ~True~ if all characters in the string are *lower case*.

#+NAME: string-islower
#+begin_src python :results output :exports both
print("12093".islower())
print("whispering...".islower())
print("SHOUTING!".islower())
print("39485943wow".islower())
print("39485943WOW".islower())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-islower
: False
: True
: False
: True
: False

@@latex: \newpage@@

