y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsection{String method: \texttt{string.upper}}
\label{sec:org6bfc975}
This method will output a new string, which is the same as the string on which it was called, except all letters in the string will now be in uppercase.

\begin{minted}[]{python}
string = "Shouting!"
print(string.upper())
\end{minted}

 \noindent Output:

\begin{verbatim}
SHOUTING!
\end{verbatim}

\subsection{String method: \texttt{string.lower}}
\label{sec:orgd5c3254}
This method will output a new string, which is the same as the string on which it was called, except all letters in the string will now be in lowercase.

\begin{minted}[]{python}
string = "WHISPERING"
print(string.lower())
\end{minted}

 \noindent Output:

\begin{verbatim}
whispering
\end{verbatim}

\subsection{String method: \texttt{string.title}}
\label{sec:org4b97ef3}
This method will output a new string, which is the same as the string on which it was called, except that the string will be in title case, which means that every word in the string will be capitalised.

\begin{minted}[]{python}
string = "john f. kennedy"
print(string.title())
\end{minted}

 \noindent Output:

\begin{verbatim}
John F. Kennedy
\end{verbatim}

\subsection{String method: \texttt{string.capitalize}}
\label{sec:orgda86cba}
\begin{itemize}
\item This method will output a new string, which is the same as the string on which it was called, except that the first letter of the first word of the string will be capitalised.
\item Take note that capitalize is using the American spelling with a "z", instead of the British spelling with a "s".
\end{itemize}

\begin{minted}[]{python}
string = "this is a sentence."
print(string.capitalize())
\end{minted}

 \noindent Output:

\begin{verbatim}
This is a sentence.
\end{verbatim}

\subsection{String method: \texttt{string.find}}
\label{sec:org4c860c2}
\begin{itemize}
\item This method takes a single character and outputs the \textbf{index} of the character (first seen from left to right).
\item If the character is not found, \texttt{-1} is returned.
\end{itemize}

\begin{minted}[]{python}
string = "Find me!"
print(string.find("m"))
print(string.find("a"))
\end{minted}

 \noindent Output:

\begin{verbatim}
5
-1
\end{verbatim}


 \newpage

\subsection{String method: \texttt{string.index}}
\label{sec:org0b938b2}
\begin{itemize}
\item This method takes a single character and outputs the \textbf{index} of the character (first seen from left to right).
\item If the character is not found, a \texttt{ValueError} is thrown.
\item This method is essentially the same as the above \texttt{string.find} method, but it throws an error when the value isn't found.
\item In a way, it's a worse version of the \texttt{string.find} method.
\end{itemize}

\begin{minted}[]{python}
string = "Find me!"
print(string.index("m"))
print(string.index("a"))    # Error
\end{minted}

 \noindent Output:

\begin{verbatim}
5
\end{verbatim}

\subsection{String method: \texttt{string.count}}
\label{sec:org0c4d757}
This method counts the number of occurrences of the substring you pass to the method.

\begin{minted}[]{python}
string = "This is an pretty long sentence."
print(string.count("i"))
print(string.count("t"))
\end{minted}

 \noindent Output:

\begin{verbatim}
2
3
\end{verbatim}


 \newpage

\subsection{String method: \texttt{string.join}}
\label{sec:org769b635}
This method takes a \textbf{string} to be joined and outputs a new string where the base string joins the target string.

\begin{minted}[]{python}
string_1 = "1234"
string_2 = "abcd"
print(string_1.join(string_2))
print(string_2.join(string_1))
\end{minted}

 \noindent Output:

\begin{verbatim}
a1234b1234c1234d
1abcd2abcd3abcd4
\end{verbatim}

\subsection{String method: \texttt{string.split}}
\label{sec:orgd26e500}
\begin{itemize}
\item This method takes a \textbf{string} and generates a list of strings by splitting the string at the given string.
\item The default character the string splits at is \textbf{whitespace}.
\item This method returns a list of strings.
\end{itemize}

\begin{minted}[]{python}
l = "oooo a list of strings"
print(l.split())
print(l.split("o"))
print(l.split("st"))
\end{minted}

 \noindent Output:

\begin{verbatim}
['oooo', 'a', 'list', 'of', 'strings']
['', '', '', '', ' a list ', 'f strings']
['oooo a li', ' of ', 'rings']
\end{verbatim}


 \newpage

\subsection{String method: \texttt{string.isalnum}}
\label{sec:org2f80db9}
Returns \texttt{True} if all characters in the string are \textbf{alphanumeric}, which means all the letters of the alphabet and the numbers 0 to 9.

\begin{minted}[]{python}
print("abcdef12345".isalnum())
print("abcdef12345_".isalnum())
print("abcdef12345_(*&#)".isalnum())
print("-1".isalnum())
print("1.5".isalnum())
print("-1.5".isalnum())
\end{minted}

 \noindent Output:

\begin{verbatim}
True
False
False
False
False
False
\end{verbatim}

\subsection{String method: \texttt{string.isalpha}}
\label{sec:orgb8a76bd}
Returns \texttt{True} if all characters in the string are in the \textbf{alphabet}.

\begin{minted}[]{python}
print("abcdef".isalpha())
print("abcdef12345".isalpha())
print("abcdef12345_(*&#)".isalpha())
\end{minted}

 \noindent Output:

\begin{verbatim}
True
False
False
\end{verbatim}


 \newpage

\subsection{String method: \texttt{string.isascii}}
\label{sec:orge7b6ba8}
Returns \texttt{True} if all characters in the string are \textbf{ASCII characters}.

\begin{minted}[]{python}
print("abcdef".isascii())
print("abcdef12345".isascii())
print("abcdef12345_(*&#)".isascii())
\end{minted}

 \noindent Output:

\begin{verbatim}
True
True
True
\end{verbatim}

\subsection{String method: \texttt{string.isdecimal}}
\label{sec:org4f32b34}
Returns \texttt{True} if all characters in the string are \textbf{decimals (0 to 9)}.

\begin{minted}[]{python}
print("12392483".isdecimal())
print("sldkfjd".isdecimal())
print("abcdef12345".isdecimal())
print("abcdef12345_(*&#)".isdecimal())
print("-1".isdecimal())
print("1.5".isdecimal())
print("-1.5".isdecimal())
\end{minted}

 \noindent Output:

\begin{verbatim}
True
False
False
False
False
False
False
\end{verbatim}


 \newpage

\subsection{String method: \texttt{string.isdigit}}
\label{sec:org322c0b2}
\begin{itemize}
\item Returns \texttt{True} if all characters in the string are \textbf{digits}.
\item Exponents like the superscript 2 in 1\textsuperscript{2} are also considered digits.
\item \texttt{"-1"}, \texttt{"1.5"} and \texttt{"-1.5"} are \textbf{not} considered digits as all the characters in the string must be a digit. \texttt{"-"} and \texttt{"."} are not digits.
\end{itemize}

\begin{minted}[]{python}
print("12392483".isdigit())
print("sldkfjd".isdigit())
print("abcdef12345".isdigit())
print("abcdef12345_(*&#)".isdigit())
print("-1".isdigit())
print("1.5".isdigit())
print("-1.5".isdigit())
\end{minted}

 \noindent Output:

\begin{verbatim}
True
False
False
False
False
False
False
\end{verbatim}

\subsection{String method: \texttt{string.isidentifier}}
\label{sec:org7694ff7}
Returns \texttt{True} if the string is \textbf{a valid Python identifier}. Basically, it checks if the string is a valid Python variable name.

\begin{minted}[]{python}
print("12392483".isidentifier())
print("varname".isidentifier())
print("_private".isidentifier())
print("string1".isidentifier())
print("omg!".isidentifier())
\end{minted}

 \noindent Output:

\begin{verbatim}
False
True
True
True
False
\end{verbatim}

\subsection{String method: \texttt{string.islower}}
\label{sec:org287c424}
Returns \texttt{True} if all characters in the string are \textbf{lower case}.

\begin{minted}[]{python}
print("12093".islower())
print("whispering...".islower())
print("SHOUTING!".islower())
print("39485943wow".islower())
print("39485943WOW".islower())
\end{minted}

 \noindent Output:

\begin{verbatim}
False
True
False
True
False
\end{verbatim}


 \newpage
