y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
** String method: ~string.isnumeric~
- Returns ~True~ if all characters in the string are *numeric*.
- Exponents like the superscript 2 in 1^{2}, as well as fractions, are also considered numeric.
- ~"-1"~, ~"1.5"~ and ~"-1.5"~ are *not* considered numeric as all the characters in the string must be numeric. ~"-"~ and ~"."~ are not numeric characters.

#+NAME: string-isnumeric
#+begin_src python :results output :exports both
print("12392483".isnumeric())
print("sldkfjd".isnumeric())
print("abcdef12345".isnumeric())
print("abcdef12345_(*&#)".isnumeric())
print("-1".isnumeric())
print("1.5".isnumeric())
print("-1.5".isnumeric())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-isnumeric
: True
: False
: False
: False
: False
: False
: False

** String method: ~string.isprintable~
Returns ~True~ if all characters in the string are *printable*.

#+NAME: string-isprintable
#+begin_src python :results output :exports both
print("12392483".isprintable())
print("sldkfjd".isprintable())
print("abcdef12345".isprintable())
print("abcdef12345_(*&#)".isprintable())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-isprintable
: True
: True
: True
: True

@@latex: \newpage@@

** String method: ~string.isspace~
Returns ~True~ if all characters in the string are *white spaces*.

#+NAME: string-isspace
#+begin_src python :results output :exports both
print("      ".isspace())
print("  alkdfjlas".isspace())
print("    abc   def   12345    ".isspace())
print("".isspace())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-isspace
: True
: False
: False
: False

** String method: ~string.istitle~
Returns ~True~ if the string is in *title case*.

#+NAME: string-istitle
#+begin_src python :results output :exports both
print("Wow This Is Cool".istitle())
print("wow this is cool".istitle())
print("WOW THIS IS COOL".istitle())
print("Wow this is cool".istitle())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-istitle
: True
: False
: False
: False

@@latex: \newpage@@

** String method: ~string.isupper~
Returns ~True~ if all characters in the string are *upper case*.

#+NAME: string-isupper
#+begin_src python :results output :exports both
print("12093".isupper())
print("whispering...".isupper())
print("SHOUTING!".isupper())
print("39485943wow".isupper())
print("39485943WOW".isupper())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-isupper
: False
: False
: True
: False
: True

@@latex: \newpage@@

** String method: ~string.format~
- This method takes any number of arguments and keyword arguments which are substituted into the string that the format method is being called on.
- The string that calls this method should have placeholders inside curly brackets {}.
- The placeholders can be either be identified using named indexes ~{price}~, or numbered indexes ~{0}~, or empty placeholders ~{}~.

#+NAME: string-format
#+begin_src python :results output :exports both
print("{} is a nice number.".format(4200.696969))
print("{meh:.2f} is a meh number.".format(meh=4200.696969))
print("{0:.4f} is a meh number.".format(4200.696969))
print("{:_.6f} is a nice number.".format(4200.696969))
print("{nice:,.6f} is a nice number.".format(nice=4200.696969))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format
: 4200.696969 is a nice number.
: 4200.70 is a meh number.
: 4200.6970 is a meh number.
: 4_200.696969 is a nice number.
: 4,200.696969 is a nice number.

*** ~:<~ formatting type
Left aligns the result (within the available space given).

#+NAME: string-format-format-type-left-align
#+begin_src python :results output :exports both
print("{:<20} 20 spaces".format(4200.696969))
print("{:*<15} 15 stars".format(4200.696969))
print("{:#<10} 10 hashes".format(4200.696969))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-left-align
: 4200.696969          20 spaces
: 4200.696969**** 15 stars
: 4200.696969 10 hashes


*** ~:>~ formatting type
Right aligns the result (within the available space given).

#+NAME: string-format-format-type-right-align
#+begin_src python :results output :exports both
print("{:>20} 20 spaces".format(4200.696969))
print("{:*>15} 15 stars".format(4200.696969))
print("{:#>10} 10 hashes".format(4200.696969))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-right-align
:          4200.696969 20 spaces
: ****4200.696969 15 stars
: 4200.696969 10 hashes

*** ~:^~ formatting type
Centre aligns the result (within the available space given).

#+NAME: string-format-format-type-centre-align
#+begin_src python :results output :exports both
print("{:^20} 20 spaces".format(4200.696969))
print("{:*^15} 15 stars".format(4200.696969))
print("{:#^10} 10 hashes".format(4200.696969))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-centre-align
:     4200.696969      20 spaces
: **4200.696969** 15 stars
: 4200.696969 10 hashes

*** ~:=~ formatting type
Places the sign to the left most position instead of just left of the number when there is padding.

#+NAME: string-format-format-type-pad-number
#+begin_src python :results output :exports both
print("{:20} 20 spaces".format(-4200.696969))
print("{:=20} 20 spaces".format(-4200.696969))
#+end_src

#+RESULTS: string-format-format-type-pad-number
:         -4200.696969 20 spaces
: -        4200.696969 20 spaces

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-add-sign
: 4200.696969 positive number
: -4200.696969 negative number
: 0 zero

*** ~:+~ formatting type
Use a plus sign or a minus sign to indicate if the result is positive or negative respectively.

#+NAME: string-format-format-type-add-plus-sign
#+begin_src python :results output :exports both
print("{:+} positive number".format(4200.696969))
print("{:+} negative number".format(-4200.696969))
print("{:+} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-add-plus-sign
: +4200.696969 positive number
: -4200.696969 negative number
: +0 zero

*** ~:-~ formatting type
- Use a minus sign for negative values only.
- This is the default behaviour.

#+NAME: string-format-format-type-add-minus-sign
#+begin_src python :results output :exports both
print("{:-} positive number".format(4200.696969))
print("{:-} negative number".format(-4200.696969))
print("{:-} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-add-minus-sign
: 4200.696969 positive number
: -4200.696969 negative number
: 0 zero

*** ~:<space>~ formatting type
- Replace the ~<space>~ with an actual space character.
- Use a space to insert an extra space before positive numbers (and a minus sign before negative numbers).

#+NAME: string-format-format-type-add-space
#+begin_src python :results output :exports both
print("{: } positive number".format(4200.696969))
print("{: } negative number".format(-4200.696969))
print("{: } zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-add-space
:  4200.696969 positive number
: -4200.696969 negative number
:  0 zero

*** ~:,~ formatting type
Use a comma as a thousand separator.

#+NAME: string-format-format-type-use-comma
#+begin_src python :results output :exports both
print("{:,} positive number".format(4200.696969))
print("{:,} negative number".format(-4200.696969))
print("{:,} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-use-comma
: 4,200.696969 positive number
: -4,200.696969 negative number
: 0 zero

*** ~:_~ formatting type
Use an underscore as a thousand separator.

#+NAME: string-format-format-type-use-underscore
#+begin_src python :results output :exports both
print("{:_} positive number".format(4200.696969))
print("{:_} negative number".format(-4200.696969))
print("{:_} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-use-underscore
: 4_200.696969 positive number
: -4_200.696969 negative number
: 0 zero

