y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsection{String method: \texttt{string.isnumeric}}
\label{sec:org15bee9c}
\begin{itemize}
\item Returns \texttt{True} if all characters in the string are \textbf{numeric}.
\item Exponents like the superscript 2 in 1\textsuperscript{2}, as well as fractions, are also considered numeric.
\item \texttt{"-1"}, \texttt{"1.5"} and \texttt{"-1.5"} are \textbf{not} considered numeric as all the characters in the string must be numeric. \texttt{"-"} and \texttt{"."} are not numeric characters.
\end{itemize}

\begin{minted}[]{python}
print("12392483".isnumeric())
print("sldkfjd".isnumeric())
print("abcdef12345".isnumeric())
print("abcdef12345_(*&#)".isnumeric())
print("-1".isnumeric())
print("1.5".isnumeric())
print("-1.5".isnumeric())
\end{minted}

 \noindent Output:

\begin{verbatim}
True
False
False
False
False
False
False
\end{verbatim}

\subsection{String method: \texttt{string.isprintable}}
\label{sec:orgcc1c59c}
Returns \texttt{True} if all characters in the string are \textbf{printable}.

\begin{minted}[]{python}
print("12392483".isprintable())
print("sldkfjd".isprintable())
print("abcdef12345".isprintable())
print("abcdef12345_(*&#)".isprintable())
\end{minted}

 \noindent Output:

\begin{verbatim}
True
True
True
True
\end{verbatim}


 \newpage

\subsection{String method: \texttt{string.isspace}}
\label{sec:org80df136}
Returns \texttt{True} if all characters in the string are \textbf{white spaces}.

\begin{minted}[]{python}
print("      ".isspace())
print("  alkdfjlas".isspace())
print("    abc   def   12345    ".isspace())
print("".isspace())
\end{minted}

 \noindent Output:

\begin{verbatim}
True
False
False
False
\end{verbatim}

\subsection{String method: \texttt{string.istitle}}
\label{sec:org49e1997}
Returns \texttt{True} if the string is in \textbf{title case}.

\begin{minted}[]{python}
print("Wow This Is Cool".istitle())
print("wow this is cool".istitle())
print("WOW THIS IS COOL".istitle())
print("Wow this is cool".istitle())
\end{minted}

 \noindent Output:

\begin{verbatim}
True
False
False
False
\end{verbatim}


 \newpage

\subsection{String method: \texttt{string.isupper}}
\label{sec:orgadf7921}
Returns \texttt{True} if all characters in the string are \textbf{upper case}.

\begin{minted}[]{python}
print("12093".isupper())
print("whispering...".isupper())
print("SHOUTING!".isupper())
print("39485943wow".isupper())
print("39485943WOW".isupper())
\end{minted}

 \noindent Output:

\begin{verbatim}
False
False
True
False
True
\end{verbatim}


 \newpage

\subsection{String method: \texttt{string.format}}
\label{sec:orge72129f}
\begin{itemize}
\item This method takes any number of arguments and keyword arguments which are substituted into the string that the format method is being called on.
\item The string that calls this method should have placeholders inside curly brackets \{\}.
\item The placeholders can be either be identified using named indexes \texttt{\{price\}}, or numbered indexes \texttt{\{0\}}, or empty placeholders \texttt{\{\}}.
\end{itemize}

\begin{minted}[]{python}
print("{} is a nice number.".format(4200.696969))
print("{meh:.2f} is a meh number.".format(meh=4200.696969))
print("{0:.4f} is a meh number.".format(4200.696969))
print("{:_.6f} is a nice number.".format(4200.696969))
print("{nice:,.6f} is a nice number.".format(nice=4200.696969))
\end{minted}

 \noindent Output:

\begin{verbatim}
4200.696969 is a nice number.
4200.70 is a meh number.
4200.6970 is a meh number.
4_200.696969 is a nice number.
4,200.696969 is a nice number.
\end{verbatim}

\subsubsection{\texttt{:<} formatting type}
\label{sec:org4598715}
Left aligns the result (within the available space given).

\begin{minted}[]{python}
print("{:<20} 20 spaces".format(4200.696969))
print("{:*<15} 15 stars".format(4200.696969))
print("{:#<10} 10 hashes".format(4200.696969))
\end{minted}

 \noindent Output:

\begin{verbatim}
4200.696969          20 spaces
4200.696969**** 15 stars
4200.696969 10 hashes
\end{verbatim}


\subsubsection{\texttt{:>} formatting type}
\label{sec:org729ab52}
Right aligns the result (within the available space given).

\begin{minted}[]{python}
print("{:>20} 20 spaces".format(4200.696969))
print("{:*>15} 15 stars".format(4200.696969))
print("{:#>10} 10 hashes".format(4200.696969))
\end{minted}

 \noindent Output:

\begin{verbatim}
         4200.696969 20 spaces
****4200.696969 15 stars
4200.696969 10 hashes
\end{verbatim}

\subsubsection{\texttt{:\textasciicircum{}} formatting type}
\label{sec:org1d89a05}
Centre aligns the result (within the available space given).

\begin{minted}[]{python}
print("{:^20} 20 spaces".format(4200.696969))
print("{:*^15} 15 stars".format(4200.696969))
print("{:#^10} 10 hashes".format(4200.696969))
\end{minted}

 \noindent Output:

\begin{verbatim}
    4200.696969      20 spaces
**4200.696969** 15 stars
4200.696969 10 hashes
\end{verbatim}

\subsubsection{\texttt{:=} formatting type}
\label{sec:orgd775ea4}
Places the sign to the left most position instead of just left of the number when there is padding.

\begin{minted}[]{python}
print("{:20} 20 spaces".format(-4200.696969))
print("{:=20} 20 spaces".format(-4200.696969))
\end{minted}

\begin{verbatim}
        -4200.696969 20 spaces
-        4200.696969 20 spaces
\end{verbatim}


 \noindent Output:

\begin{verbatim}
4200.696969 positive number
-4200.696969 negative number
0 zero
\end{verbatim}

\subsubsection{\texttt{:+} formatting type}
\label{sec:org0a3a92e}
Use a plus sign or a minus sign to indicate if the result is positive or negative respectively.

\begin{minted}[]{python}
print("{:+} positive number".format(4200.696969))
print("{:+} negative number".format(-4200.696969))
print("{:+} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
+4200.696969 positive number
-4200.696969 negative number
+0 zero
\end{verbatim}

\subsubsection{\texttt{:-} formatting type}
\label{sec:orga4ec057}
\begin{itemize}
\item Use a minus sign for negative values only.
\item This is the default behaviour.
\end{itemize}

\begin{minted}[]{python}
print("{:-} positive number".format(4200.696969))
print("{:-} negative number".format(-4200.696969))
print("{:-} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
4200.696969 positive number
-4200.696969 negative number
0 zero
\end{verbatim}

\subsubsection{\texttt{:<space>} formatting type}
\label{sec:org101b531}
\begin{itemize}
\item Replace the \texttt{<space>} with an actual space character.
\item Use a space to insert an extra space before positive numbers (and a minus sign before negative numbers).
\end{itemize}

\begin{minted}[]{python}
print("{: } positive number".format(4200.696969))
print("{: } negative number".format(-4200.696969))
print("{: } zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
 4200.696969 positive number
-4200.696969 negative number
 0 zero
\end{verbatim}

\subsubsection{\texttt{:,} formatting type}
\label{sec:orga317882}
Use a comma as a thousand separator.

\begin{minted}[]{python}
print("{:,} positive number".format(4200.696969))
print("{:,} negative number".format(-4200.696969))
print("{:,} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
4,200.696969 positive number
-4,200.696969 negative number
0 zero
\end{verbatim}

\subsubsection{\texttt{:\_} formatting type}
\label{sec:org7633537}
Use an underscore as a thousand separator.

\begin{minted}[]{python}
print("{:_} positive number".format(4200.696969))
print("{:_} negative number".format(-4200.696969))
print("{:_} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
4_200.696969 positive number
-4_200.696969 negative number
0 zero
\end{verbatim}
