y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
*** ~:b~ formatting type
Binary format, only applicable to integers.

#+NAME: string-format-format-type-binary-format
#+begin_src python :results output :exports both
print("{:b} positive number".format(42069))
print("{:b} negative number".format(-42069))
print("{:b} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-binary-format
: 1010010001010101 positive number
: -1010010001010101 negative number
: 0 zero

*** ~:c~ formatting type
Converts the value into the corresponding Unicode character. Only applicable to positive integers.

#+NAME: string-format-format-type-convert-to-unicode
#+begin_src python :results output :exports both
print("{:c} Unicode character 100".format(100))
print("{:c} Unicode character 69".format(69))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-convert-to-unicode
: d Unicode character 100
: E Unicode character 69

*** ~:d~ formatting type
Decimal format.

#+NAME: string-format-format-type-decimal-format
#+begin_src python :results output :exports both
print("{:d} positive number".format(42069))
print("{:d} negative number".format(-42069))
print("{:d} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-decimal-format
: 42069 positive number
: -42069 negative number
: 0 zero

*** ~:e~ formatting type
Scientific format, with a lower case e.

#+NAME: string-format-format-type-scientific-format-lower-e
#+begin_src python :results output :exports both
print("{:e} positive number".format(4200.696969))
print("{:.2e} negative number".format(-4200.696969))
print("{:.4e} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-scientific-format-lower-e
: 4.200697e+03 positive number
: -4.20e+03 negative number
: 0.0000e+00 zero

*** ~:E~ formatting type
Scientific format, with an upper case E.

#+NAME: string-format-format-type-scientific-format-upper-e
#+begin_src python :results output :exports both
print("{:E} positive number".format(4200.696969))
print("{:.2E} negative number".format(-4200.696969))
print("{:.4E} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-scientific-format-upper-e
: 4.200697E+03 positive number
: -4.20E+03 negative number
: 0.0000E+00 zero

*** ~:f~ formatting type
Fix point number format.

#+NAME: string-format-format-type-fix-point
#+begin_src python :results output :exports both
print("{:f} positive number".format(4200.696969))
print("{:.2f} negative number".format(-4200.696969))
print("{:.4f} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-fix-point
: 4200.696969 positive number
: -4200.70 negative number
: 0.0000 zero

*** ~:F~ formatting type
Fix point number format, in uppercase format (show inf and nan as INF and NAN).

#+NAME: string-format-format-type-fix-point-upper
#+begin_src python :results output :exports both
print("{:F} positive number".format(4200.696969))
print("{:.2F} negative number".format(-4200.696969))
print("{:.4F} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-fix-point-upper
: 4200.696969 positive number
: -4200.70 negative number
: 0.0000 zero

*** ~:g~ formatting type
General format.

#+NAME: string-format-format-type-general-format
#+begin_src python :results output :exports both
print("{:g} positive number".format(4200.696969))
print("{:.2g} negative number".format(-4200.696969))
print("{:.4g} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-general-format
: 4200.7 positive number
: -4.2e+03 negative number
: 0 zero

*** ~:G~ formatting type
General format (using an upper case E for scientific notations).

#+NAME: string-format-format-type-general-format-upper
#+begin_src python :results output :exports both
print("{:G} positive number".format(4200.696969))
print("{:.2G} negative number".format(-4200.696969))
print("{:.4G} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-general-format-upper
: 4200.7 positive number
: -4.2E+03 negative number
: 0 zero

*** ~:o~ formatting type
Octal format, only applicable to integers.

#+NAME: string-format-format-type-octal-format
#+begin_src python :results output :exports both
print("{:o} positive number".format(42069))
print("{:o} negative number".format(-42069))
print("{:o} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-octal-format
: 122125 positive number
: -122125 negative number
: 0 zero

*** ~:x~ formatting type
Hex format, lowercase.

#+NAME: string-format-format-type-hex-format-lower
#+begin_src python :results output :exports both
print("{:x} positive number".format(42069))
print("{:x} negative number".format(-42069))
print("{:x} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-hex-format-lower
: a455 positive number
: -a455 negative number
: 0 zero

*** ~:X~ formatting type
Hex format, uppercase.

#+NAME: string-format-format-type-hex-format-upper
#+begin_src python :results output :exports both
print("{:X} positive number".format(42069))
print("{:X} negative number".format(-42069))
print("{:X} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-hex-format-upper
: A455 positive number
: -A455 negative number
: 0 zero

*** ~:n~ formatting type
Number format.

#+NAME: string-format-format-type-number-format
#+begin_src python :results output :exports both
print("{:n} positive number".format(4200.696969))
print("{:n} negative number".format(-4200.696969))
print("{:n} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-number-format
: 4200.7 positive number
: -4200.7 negative number
: 0 zero

*** ~:%~ formatting type
Percentage format.

#+NAME: string-format-format-type-percentage-format
#+begin_src python :results output :exports both
print("{:%} positive number".format(4200.696969))
print("{:.2%} negative number".format(-4200.696969))
print("{:.4%} zero".format(0))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: string-format-format-type-percentage-format
: 420069.696900% positive number
: -420069.70% negative number
: 0.0000% zero

** List method: ~list.append~
- This method takes an element, which can be any Python object, and adds it to the end of the list.
- Note that this method *changes the list* in place and does *not* return any value.
#+NAME: list-append
#+begin_src python :results output :exports both
l = [1, "omg wow", 420.69, False]
l.append("lol")
print(l)
l.append(True)
print(l)
l.append(69)
print(l)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-append
: [1, 'omg wow', 420.69, False, 'lol']
: [1, 'omg wow', 420.69, False, 'lol', True]
: [1, 'omg wow', 420.69, False, 'lol', True, 69]

@@latex: \newpage@@

** List method: ~list.extend~
- This method takes a *list* and adds the elements of the given list to the end of the original list.
- This method cannot take an element to add to the back of the original list, use ~list.append~ for that.
- Using this method to add a string to the list will add all the characters in the string into the list instead of the string as one item.
- Note that this method *changes the list* in place and does *not* return any value.

#+NAME: list-extend
#+begin_src python :results output :exports both
l_1 = [1, "omg wow", 420.69, False]
l_2 = ["extended l_1 hehe", "lovely", 6969, True]
l_1.extend(l_2)
print(l_1)
l_1.extend(5)    # Error
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-extend
: [1, 'omg wow', 420.69, False, 'extended l_1 hehe', 'lovely', 6969, True]

** List method: ~list.pop~
- This method takes an index and removes the item corresponding to that index from the list.
- Note that this method *changes the list* in place and does *not* return any value.
#+NAME: list-pop
#+begin_src python :results output :exports both
l = [1, "omg wow", 420.69, False]
l.pop(2)
print(l)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-pop
: [1, 'omg wow', False]

