y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsubsection{\texttt{:b} formatting type}
\label{sec:orgaf8c6cf}
Binary format, only applicable to integers.

\begin{minted}[]{python}
print("{:b} positive number".format(42069))
print("{:b} negative number".format(-42069))
print("{:b} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
1010010001010101 positive number
-1010010001010101 negative number
0 zero
\end{verbatim}

\subsubsection{\texttt{:c} formatting type}
\label{sec:orgbefe305}
Converts the value into the corresponding Unicode character. Only applicable to positive integers.

\begin{minted}[]{python}
print("{:c} Unicode character 100".format(100))
print("{:c} Unicode character 69".format(69))
\end{minted}

 \noindent Output:

\begin{verbatim}
d Unicode character 100
E Unicode character 69
\end{verbatim}

\subsubsection{\texttt{:d} formatting type}
\label{sec:org8d7acb8}
Decimal format.

\begin{minted}[]{python}
print("{:d} positive number".format(42069))
print("{:d} negative number".format(-42069))
print("{:d} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
42069 positive number
-42069 negative number
0 zero
\end{verbatim}

\subsubsection{\texttt{:e} formatting type}
\label{sec:orgc0ed33b}
Scientific format, with a lower case e.

\begin{minted}[]{python}
print("{:e} positive number".format(4200.696969))
print("{:.2e} negative number".format(-4200.696969))
print("{:.4e} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
4.200697e+03 positive number
-4.20e+03 negative number
0.0000e+00 zero
\end{verbatim}

\subsubsection{\texttt{:E} formatting type}
\label{sec:org364550f}
Scientific format, with an upper case E.

\begin{minted}[]{python}
print("{:E} positive number".format(4200.696969))
print("{:.2E} negative number".format(-4200.696969))
print("{:.4E} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
4.200697E+03 positive number
-4.20E+03 negative number
0.0000E+00 zero
\end{verbatim}

\subsubsection{\texttt{:f} formatting type}
\label{sec:org8b594e6}
Fix point number format.

\begin{minted}[]{python}
print("{:f} positive number".format(4200.696969))
print("{:.2f} negative number".format(-4200.696969))
print("{:.4f} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
4200.696969 positive number
-4200.70 negative number
0.0000 zero
\end{verbatim}

\subsubsection{\texttt{:F} formatting type}
\label{sec:org7ebd072}
Fix point number format, in uppercase format (show inf and nan as INF and NAN).

\begin{minted}[]{python}
print("{:F} positive number".format(4200.696969))
print("{:.2F} negative number".format(-4200.696969))
print("{:.4F} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
4200.696969 positive number
-4200.70 negative number
0.0000 zero
\end{verbatim}

\subsubsection{\texttt{:g} formatting type}
\label{sec:org5e6b83e}
General format.

\begin{minted}[]{python}
print("{:g} positive number".format(4200.696969))
print("{:.2g} negative number".format(-4200.696969))
print("{:.4g} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
4200.7 positive number
-4.2e+03 negative number
0 zero
\end{verbatim}

\subsubsection{\texttt{:G} formatting type}
\label{sec:org05d4503}
General format (using an upper case E for scientific notations).

\begin{minted}[]{python}
print("{:G} positive number".format(4200.696969))
print("{:.2G} negative number".format(-4200.696969))
print("{:.4G} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
4200.7 positive number
-4.2E+03 negative number
0 zero
\end{verbatim}

\subsubsection{\texttt{:o} formatting type}
\label{sec:org7825d59}
Octal format, only applicable to integers.

\begin{minted}[]{python}
print("{:o} positive number".format(42069))
print("{:o} negative number".format(-42069))
print("{:o} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
122125 positive number
-122125 negative number
0 zero
\end{verbatim}

\subsubsection{\texttt{:x} formatting type}
\label{sec:org7033c1d}
Hex format, lowercase.

\begin{minted}[]{python}
print("{:x} positive number".format(42069))
print("{:x} negative number".format(-42069))
print("{:x} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
a455 positive number
-a455 negative number
0 zero
\end{verbatim}

\subsubsection{\texttt{:X} formatting type}
\label{sec:org1c5318b}
Hex format, uppercase.

\begin{minted}[]{python}
print("{:X} positive number".format(42069))
print("{:X} negative number".format(-42069))
print("{:X} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
A455 positive number
-A455 negative number
0 zero
\end{verbatim}

\subsubsection{\texttt{:n} formatting type}
\label{sec:org55a26a4}
Number format.

\begin{minted}[]{python}
print("{:n} positive number".format(4200.696969))
print("{:n} negative number".format(-4200.696969))
print("{:n} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
4200.7 positive number
-4200.7 negative number
0 zero
\end{verbatim}

\subsubsection{\texttt{:\%} formatting type}
\label{sec:org4e7bea6}
Percentage format.

\begin{minted}[]{python}
print("{:%} positive number".format(4200.696969))
print("{:.2%} negative number".format(-4200.696969))
print("{:.4%} zero".format(0))
\end{minted}

 \noindent Output:

\begin{verbatim}
420069.696900% positive number
-420069.70% negative number
0.0000% zero
\end{verbatim}

\subsection{List method: \texttt{list.append}}
\label{sec:orgc8beaf6}
\begin{itemize}
\item This method takes an element, which can be any Python object, and adds it to the end of the list.
\item Note that this method \textbf{changes the list} in place and does \textbf{not} return any value.
\end{itemize}
\begin{minted}[]{python}
l = [1, "omg wow", 420.69, False]
l.append("lol")
print(l)
l.append(True)
print(l)
l.append(69)
print(l)
\end{minted}

 \noindent Output:

\begin{verbatim}
[1, 'omg wow', 420.69, False, 'lol']
[1, 'omg wow', 420.69, False, 'lol', True]
[1, 'omg wow', 420.69, False, 'lol', True, 69]
\end{verbatim}


 \newpage

\subsection{List method: \texttt{list.extend}}
\label{sec:org9288b57}
\begin{itemize}
\item This method takes a \textbf{list} and adds the elements of the given list to the end of the original list.
\item This method cannot take an element to add to the back of the original list, use \texttt{list.append} for that.
\item Using this method to add a string to the list will add all the characters in the string into the list instead of the string as one item.
\item Note that this method \textbf{changes the list} in place and does \textbf{not} return any value.
\end{itemize}

\begin{minted}[]{python}
l_1 = [1, "omg wow", 420.69, False]
l_2 = ["extended l_1 hehe", "lovely", 6969, True]
l_1.extend(l_2)
print(l_1)
l_1.extend(5)    # Error
\end{minted}

 \noindent Output:

\begin{verbatim}
[1, 'omg wow', 420.69, False, 'extended l_1 hehe', 'lovely', 6969, True]
\end{verbatim}

\subsection{List method: \texttt{list.pop}}
\label{sec:org90def7f}
\begin{itemize}
\item This method takes an index and removes the item corresponding to that index from the list.
\item Note that this method \textbf{changes the list} in place and does \textbf{not} return any value.
\end{itemize}
\begin{minted}[]{python}
l = [1, "omg wow", 420.69, False]
l.pop(2)
print(l)
\end{minted}

 \noindent Output:

\begin{verbatim}
[1, 'omg wow', False]
\end{verbatim}
