y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
** List method: ~list.insert~
- This method takes an index and an element, which can be any Python object, and adds the element at the given index in the list.
- The element that was in the given index will be pushed back.
- Essentially, the given index will be the same index you can use to get the added element back from the list.
- Note that this method *changes the list* in place and does *not* return any value.

#+NAME: list-insert
#+begin_src python :results output :exports both
l = [1, "omg wow", 420.69, False]
l.insert(3, 6969)
print(l)
print(l[3])
l.insert(0, "I'm at the front")
print(l)
print(l[0])
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-insert
: [1, 'omg wow', 420.69, 6969, False]
: 6969
: ["I'm at the front", 1, 'omg wow', 420.69, 6969, False]
: I'm at the front

** List method: ~list.remove~
- This method takes an element and removes it from the list.
- Note that this method *changes the list* in place and does *not* return any value.

#+NAME: list-remove
#+begin_src python :results output :exports both
l = [1, "omg wow", 420.69, False]
l.remove(420.69)
print(l)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-remove
: [1, 'omg wow', False]

** List method: ~list.sort~
- This method sorts the list lexicographically.
- This means that everything is converted to a number if possible and the list can only be either a *list of strings* or a *list of numeric (~int~ and ~float~) and boolean values*.
- Strings will be compared using their ASCII character code.
- The boolean ~True~ is changed into 1 and the boolean ~False~ is changed to 0 when sorting a list.
- Note that this method *changes the list* in place and does *not* return any value.

#+NAME: list-sort
#+begin_src python :results output :exports both
l = [1, True, 420.69, False]
l.sort()
print(l)
l = ["ooo", "a", "list", "of", "Only", "Strings"]
l.sort()
print(l)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-sort
: [False, 1, True, 420.69]
: ['Only', 'Strings', 'a', 'list', 'of', 'ooo']

** List method: ~list.reverse~
- This method reverses the list in place.
- This means that the method will *change the list* in place and *not* return any value.
#+NAME: list-reverse
#+begin_src python :results output :exports both
l = [1, "omg wow", 420.69, False]
l.reverse()
print(l)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: list-reverse
: [False, 420.69, 'omg wow', 1]

** Dictionary method: ~dict.items~
This method returns all the key value pairs in a list-like structure called ~dict_items~, containing the key value pairs as tuples.
#+NAME: dict-items
#+begin_src python :results output :exports both
dic = {
    "bill": 25,
    "tax": 3
}
print(dic.items())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: dict-items
: dict_items([('bill', 25), ('tax', 3)])

** Dictionary method: ~dict.keys~
This method returns all the keys of the dictionary in a list-like structure called ~dict_keys~.
#+NAME: dict-keys
#+begin_src python :results output :exports both
dic = {
    "bill": 25,
    "tax": 3
}
print(dic.keys())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: dict-keys
: dict_keys(['bill', 'tax'])

** Dictionary method: ~dict.values~
This method returns all the values of the dictionary in a list-like structure called ~dict_values~.
#+NAME: dict-values
#+begin_src python :results output :exports both
dic = {
    "bill": 25,
    "tax": 3
}
print(dic.values())
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: dict-values
: dict_values([25, 3])

** Dictionary method: ~dict.clear~
- This method clears the *dictionary*, which means the dictionary becomes an empty dictionary again.
- This method *changes* the dictionary in place and *does not* return any value.
#+NAME: dict-clear
#+begin_src python :results output :exports both
dic = {
    "bill": 25,
    "tax": 3
}
dic.clear()
print(dic)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: dict-clear
: {}

** Dictionary method: ~dict.update~
- This method takes a dictionary and updates the original dictionary with the keys and values from the new dictionary.
- The *value in the new dictionary* is used if the new dictionary also has keys that are in the original dictionary
- This method *changes* the dictionary in place and *does not* return any value.
#+NAME: dict-update
#+begin_src python :results output :exports both
dic = {
    "bill": 25,
    "tax": 3
}
new_dic = {
    "bill": 50,
    "petrol": 20
}
dic.update(new_dic)
print(dic)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: dict-update
: {'bill': 50, 'tax': 3, 'petrol': 20}

** ~open~
- Opens a file located on the disk.
- The function takes two strings, the first string contains either the name of the file or the file path.
- The second string tells Python what mode to open the file in.
- The default mode is read-only mode, or ~"r"~.

@@latex: \noindent@@ Opening a file in the *current program directory* on Windows:
#+begin_src python :results none
file = open("A_text_file.txt")
file = open(".\A_text_file.txt")
#+end_src

@@latex: \noindent@@ Opening a file in the *parent directory* on Windows:
#+begin_src python :results none
file = open("..\A_text_file.txt")
#+end_src

@@latex: \noindent@@ Opening a file using its *absolute path* on Windows:
#+begin_src python :results none
file = open("C:\Users\Draykoth\Documents\A_text_file.txt")
#+end_src

*** File modes
#+ATTR_LATEX: :environment tabular :align |c|c|m{10em}|m{10em}|
|-------------+----------------+-----------------------------------------------------------------------------------------------------------------+------------------------------|
| Mode String | Mode           | File exists                                                                                                     | File doesn't exist           |
|-------------+----------------+-----------------------------------------------------------------------------------------------------------------+------------------------------|
| "r"         | Read-only      | Opens the file.                                                                                                 | Error                        |
|-------------+----------------+-----------------------------------------------------------------------------------------------------------------+------------------------------|
| "w"         | Write-only     | Clears the file contents.                                                                                       | Creates and opens a new file |
|-------------+----------------+-----------------------------------------------------------------------------------------------------------------+------------------------------|
| "a"         | Write-only     | The file contents are left intact and new data is appended at the end of the file.                              | Creates and opens a new file |
|-------------+----------------+-----------------------------------------------------------------------------------------------------------------+------------------------------|
| "r+"        | Read and write | Reads and overwrites from the beginning of the file.                                                   | Error                        |
|-------------+----------------+-----------------------------------------------------------------------------------------------------------------+------------------------------|
| "w+"        | Read and write | Clears the file contents.                                                                                       | Creates and opens a new file |
|-------------+----------------+-----------------------------------------------------------------------------------------------------------------+------------------------------|
| "a+"        | Read and write | The file contents are left intact and reading and writing starts at the end of the file. | Creates and opens a new file |
|-------------+----------------+-----------------------------------------------------------------------------------------------------------------+------------------------------|

