y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsection{List method: \texttt{list.insert}}
\label{sec:orga9eae27}
\begin{itemize}
\item This method takes an index and an element, which can be any Python object, and adds the element at the given index in the list.
\item The element that was in the given index will be pushed back.
\item Essentially, the given index will be the same index you can use to get the added element back from the list.
\item Note that this method \textbf{changes the list} in place and does \textbf{not} return any value.
\end{itemize}

\begin{minted}[]{python}
l = [1, "omg wow", 420.69, False]
l.insert(3, 6969)
print(l)
print(l[3])
l.insert(0, "I'm at the front")
print(l)
print(l[0])
\end{minted}

 \noindent Output:

\begin{verbatim}
[1, 'omg wow', 420.69, 6969, False]
6969
["I'm at the front", 1, 'omg wow', 420.69, 6969, False]
I'm at the front
\end{verbatim}

\subsection{List method: \texttt{list.remove}}
\label{sec:orgf925fdc}
\begin{itemize}
\item This method takes an element and removes it from the list.
\item Note that this method \textbf{changes the list} in place and does \textbf{not} return any value.
\end{itemize}

\begin{minted}[]{python}
l = [1, "omg wow", 420.69, False]
l.remove(420.69)
print(l)
\end{minted}

 \noindent Output:

\begin{verbatim}
[1, 'omg wow', False]
\end{verbatim}

\subsection{List method: \texttt{list.sort}}
\label{sec:org09fb7f8}
\begin{itemize}
\item This method sorts the list lexicographically.
\item This means that everything is converted to a number if possible and the list can only be either a \textbf{list of strings} or a \textbf{list of numeric (\texttt{int} and \texttt{float}) and boolean values}.
\item Strings will be compared using their ASCII character code.
\item The boolean \texttt{True} is changed into 1 and the boolean \texttt{False} is changed to 0 when sorting a list.
\item Note that this method \textbf{changes the list} in place and does \textbf{not} return any value.
\end{itemize}

\begin{minted}[]{python}
l = [1, True, 420.69, False]
l.sort()
print(l)
l = ["ooo", "a", "list", "of", "Only", "Strings"]
l.sort()
print(l)
\end{minted}

 \noindent Output:

\begin{verbatim}
[False, 1, True, 420.69]
['Only', 'Strings', 'a', 'list', 'of', 'ooo']
\end{verbatim}

\subsection{List method: \texttt{list.reverse}}
\label{sec:orge1c63ca}
\begin{itemize}
\item This method reverses the list in place.
\item This means that the method will \textbf{change the list} in place and \textbf{not} return any value.
\end{itemize}
\begin{minted}[]{python}
l = [1, "omg wow", 420.69, False]
l.reverse()
print(l)
\end{minted}

 \noindent Output:

\begin{verbatim}
[False, 420.69, 'omg wow', 1]
\end{verbatim}

\subsection{Dictionary method: \texttt{dict.items}}
\label{sec:orgef251b9}
This method returns all the key value pairs in a list-like structure called \texttt{dict\_items}, containing the key value pairs as tuples.
\begin{minted}[]{python}
dic = {
    "bill": 25,
    "tax": 3
}
print(dic.items())
\end{minted}

 \noindent Output:

\begin{verbatim}
dict_items([('bill', 25), ('tax', 3)])
\end{verbatim}

\subsection{Dictionary method: \texttt{dict.keys}}
\label{sec:orgec27571}
This method returns all the keys of the dictionary in a list-like structure called \texttt{dict\_keys}.
\begin{minted}[]{python}
dic = {
    "bill": 25,
    "tax": 3
}
print(dic.keys())
\end{minted}

 \noindent Output:

\begin{verbatim}
dict_keys(['bill', 'tax'])
\end{verbatim}

\subsection{Dictionary method: \texttt{dict.values}}
\label{sec:orge4b48f1}
This method returns all the values of the dictionary in a list-like structure called \texttt{dict\_values}.
\begin{minted}[]{python}
dic = {
    "bill": 25,
    "tax": 3
}
print(dic.values())
\end{minted}

 \noindent Output:

\begin{verbatim}
dict_values([25, 3])
\end{verbatim}

\subsection{Dictionary method: \texttt{dict.clear}}
\label{sec:org7db004f}
\begin{itemize}
\item This method clears the \textbf{dictionary}, which means the dictionary becomes an empty dictionary again.
\item This method \textbf{changes} the dictionary in place and \textbf{does not} return any value.
\end{itemize}
\begin{minted}[]{python}
dic = {
    "bill": 25,
    "tax": 3
}
dic.clear()
print(dic)
\end{minted}

 \noindent Output:

\begin{verbatim}
{}
\end{verbatim}

\subsection{Dictionary method: \texttt{dict.update}}
\label{sec:org0d9745d}
\begin{itemize}
\item This method takes a dictionary and updates the original dictionary with the keys and values from the new dictionary.
\item The \textbf{value in the new dictionary} is used if the new dictionary also has keys that are in the original dictionary
\item This method \textbf{changes} the dictionary in place and \textbf{does not} return any value.
\end{itemize}
\begin{minted}[]{python}
dic = {
    "bill": 25,
    "tax": 3
}
new_dic = {
    "bill": 50,
    "petrol": 20
}
dic.update(new_dic)
print(dic)
\end{minted}

 \noindent Output:

\begin{verbatim}
{'bill': 50, 'tax': 3, 'petrol': 20}
\end{verbatim}

\subsection{\texttt{open}}
\label{sec:org8aa991e}
\begin{itemize}
\item Opens a file located on the disk.
\item The function takes two strings, the first string contains either the name of the file or the file path.
\item The second string tells Python what mode to open the file in.
\item The default mode is read-only mode, or \texttt{"r"}.
\end{itemize}

 \noindent Opening a file in the \textbf{current program directory} on Windows:
\begin{minted}[]{python}
file = open("A_text_file.txt")
file = open(".\A_text_file.txt")
\end{minted}

 \noindent Opening a file in the \textbf{parent directory} on Windows:
\begin{minted}[]{python}
file = open("..\A_text_file.txt")
\end{minted}

 \noindent Opening a file using its \textbf{absolute path} on Windows:
\begin{minted}[]{python}
file = open("C:\Users\Draykoth\Documents\A_text_file.txt")
\end{minted}

\subsubsection{File modes}
\label{sec:orgf77bdac}
\begin{center}
\begin{tabular}{|c|c|m{10em}|m{10em}|}
\hline
Mode String & Mode & File exists & File doesn't exist\\[0pt]
\hline
"r" & Read-only & Opens the file. & Error\\[0pt]
\hline
"w" & Write-only & Clears the file contents. & Creates and opens a new file\\[0pt]
\hline
"a" & Write-only & The file contents are left intact and new data is appended at the end of the file. & Creates and opens a new file\\[0pt]
\hline
"r+" & Read and write & Reads and overwrites from the beginning of the file. & Error\\[0pt]
\hline
"w+" & Read and write & Clears the file contents. & Creates and opens a new file\\[0pt]
\hline
"a+" & Read and write & The file contents are left intact and reading and writing starts at the end of the file. & Creates and opens a new file\\[0pt]
\hline
\end{tabular}
\end{center}
