y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
*** ~encoding~ parameter (optional)
- ~encoding~ takes a *string* that specifies the file encoding for reading the file.
- The default value is ~"UTF-8"~, which is for text files.
- Binary files, depending on language or operating system, will have *different* encodings, and hence the encoding for binary files needs to be specified explicitly, like the example below.
- For more information about encodings, visit [[http://getpython3.com/diveintopython3/strings.html#boring-stuff][this website]].
#+begin_src python :results none
open("table.csv", "r", encoding="windows-1252")
#+end_src

*** Reading a file
#+NAME: reading-a-file
#+begin_src python :results output :exports both
# Opens the file in read-only mode
file = open("A_text_file.txt", "r")

# Iterates over the file and prints the lines.
# No end character as the lines in the file already
# include the new line character.
for line in file:
    print(line, end="")

# Close the file
file.close()
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: reading-a-file
: First line: €
: Second line
: Third line
: Fourth line
: Fifth line

@@latex: \newpage@@

** File method: ~file.close~
- This method closes the file.
- It is important to call this method once you're done with the file to save your changes to the disk.
- The information in the file buffer is "flushed" out of the buffer and into the file on the disk when this method is called.
- If you don't call this method, your changes WILL NOT be saved to the disk.
#+begin_src python :results none
file.close()
#+end_src

*** Automatically closing a file
- The file is opened at the ~with~ statement.
- The file mode is read-only, and the file type is text in the example below.
- The file is automatically closed at the end of the ~with~ block.

#+NAME: auto-close-file
#+begin_src python :results output :exports both
with open("A_text_file.txt", "r") as file:
    for line in file:
        print(line)
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: auto-close-file
#+begin_example
First line: €

Second line

Third line

Fourth line

Fifth line

#+end_example

** File method: ~file.readline~
- This method returns the next line as a *string*.
- This method also moves the current file position forward.
- When the current file position reaches the end of the file, every read will yield an empty string ~""~.
- Using the ~seek~ method is required to read the file again.
- Closing and reopening the file also works, but is far less efficient.

#+NAME: file-readline
#+begin_src python :results output :exports both
file = open("A_text_file.txt", "r")

# No end character as the lines in the file already
# include the new line character
print(file.readline(), end="")
print(file.readline(), end="")
print(file.readline(), end="")
file.close()
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: file-readline
: First line: €
: Second line
: Third line

@@latex: \newpage@@

** File method: ~file.readlines~
- This method returns a list of all the lines from the file.
- This method also moves the current file position forward.
- When the current file position reaches the end of the file, every read will yield an empty string ~""~.
- Using the ~seek~ method is required to read the file again.
- Closing and reopening the file also works, but is far less efficient.

#+NAME: file-readlines
#+begin_src python :results output :exports both
file = open("A_text_file.txt", "r")
print(file.readlines())
file.close()
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: file-readlines
: ['First line: €\n', 'Second line\n', 'Third line\n', 'Fourth line\n', 'Fifth line\n']

@@latex: \newpage@@

** File method: ~file.read~
- This method takes an *integer*, which represents how many *characters* is to be read from the file.
- If this integer is not given, then the entire file is read and returned as a single string.
- This method also moves the current file position forward.
- When the current file position reaches the end of the file, every read will yield an empty string ~""~.
- Using the ~seek~ method is required to read the file again.
- Closing and reopening the file also works, but is far less efficient.

#+NAME: file-read-given-int
#+begin_src python :results output :exports both
file = open("A_text_file.txt", "r")
print(file.read(5))
file.close()
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: file-read-given-int
: First

#+NAME: file-read
#+begin_src python :results output :exports both
file = open("A_text_file.txt", "r")
print(file.read())
file.close()
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: file-read
: First line: €
: Second line
: Third line
: Fourth line
: Fifth line
:

** File method: ~file.write~
This method takes a *string* and writes it to the file.
#+begin_src python :results none
file = open("temp.txt", "w")
file.write("First line\n")
file.write("Second line\n")
file.close()
#+end_src

** File method: ~file.writelines~
This method takes a *list of strings* and writes it to the file.
#+begin_src python :results none
file = open("temp.txt", "w")
lines = ["First line\n", "Second line\n"]
file.writelines(lines)
file.close()
#+end_src

** File method: ~file.tell~
- This method tells returns an *integer* representing the *current file position*.
- The positions are in *bytes* from the *beginning* of the file.
- This is not necessarily the same as the number of characters, as it depends on encoding.
- Some characters may take multiple bytes, like the euro symbol in the example below.

#+NAME: file-tell
#+begin_src python :results output :exports both
file = open("A_text_file.txt", "r")
print(file.tell())
print(file.read(11))
print(file.tell())
print(file.read(1))
print(file.tell())
print(file.read(1))
print(file.tell())
file.close()
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: file-tell
: 0
: First line:
: 11
:
: 12
: €
: 15

** File method: ~file.seek~
This method takes an *integer* representing the offset in *bytes* from the *beginning* of the file and updates the current file position that position.
#+begin_src python :results none
# Seek to the beginning of the file
file.seek(0)

# Seek to 100 bytes from the beginning of the file
file.seek(100)
#+end_src

*** Example
#+NAME: file-seek
#+begin_src python :results output :exports both
file = open("A_text_file.txt", "r")
print(file.read(12))
print(file.tell())
print(file.read(1))
print(file.tell())
print(file.seek(6))
print(file.read(4))
file.close()
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: file-seek
: First line:
: 12
: €
: 15
: 6
: line

@@latex: \newpage@@

*** ~whence~ parameter (optional)
- ~whence~ takes an *integer*, either ~0~, ~1~ or ~2~, and represents file positioning.
- This parameter defaults to ~0~, which is to count from the beginning of the file.
  - ~0~ means to count from the beginning of the file.
  - ~1~ means to count from the current position in the file.
  - ~2~ means to count from the end of the file. This option is usually paired with a negative offset.

- In text files, only seeks relative to the beginning of the file are allowed.
- An exception to this is the seek to the end of the file, like ~file.seek(0, 2)~.

#+begin_src python :results none

# Go to 100 bytes before the end of the file
file.seek(-100, 2)

# Go to 5 bytes from the current file position
file.seek(5, 1)
#+end_src

@@latex: \newpage@@

