y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsubsection{\texttt{encoding} parameter (optional)}
\label{sec:org9852085}
\begin{itemize}
\item \texttt{encoding} takes a \textbf{string} that specifies the file encoding for reading the file.
\item The default value is \texttt{"UTF-8"}, which is for text files.
\item Binary files, depending on language or operating system, will have \textbf{different} encodings, and hence the encoding for binary files needs to be specified explicitly, like the example below.
\item For more information about encodings, visit \href{http://getpython3.com/diveintopython3/strings.html\#boring-stuff}{this website}.
\end{itemize}
\begin{minted}[]{python}
open("table.csv", "r", encoding="windows-1252")
\end{minted}

\subsubsection{Reading a file}
\label{sec:org54e2363}
\begin{minted}[]{python}
# Opens the file in read-only mode
file = open("A_text_file.txt", "r")

# Iterates over the file and prints the lines.
# No end character as the lines in the file already
# include the new line character.
for line in file:
    print(line, end="")

# Close the file
file.close()
\end{minted}

 \noindent Output:

\begin{verbatim}
First line: €
Second line
Third line
Fourth line
Fifth line
\end{verbatim}


 \newpage

\subsection{File method: \texttt{file.close}}
\label{sec:orgb04e2ba}
\begin{itemize}
\item This method closes the file.
\item It is important to call this method once you're done with the file to save your changes to the disk.
\item The information in the file buffer is "flushed" out of the buffer and into the file on the disk when this method is called.
\item If you don't call this method, your changes WILL NOT be saved to the disk.
\end{itemize}
\begin{minted}[]{python}
file.close()
\end{minted}

\subsubsection{Automatically closing a file}
\label{sec:orgd207185}
\begin{itemize}
\item The file is opened at the \texttt{with} statement.
\item The file mode is read-only, and the file type is text in the example below.
\item The file is automatically closed at the end of the \texttt{with} block.
\end{itemize}

\begin{minted}[]{python}
with open("A_text_file.txt", "r") as file:
    for line in file:
        print(line)
\end{minted}

 \noindent Output:

\begin{verbatim}
First line: €

Second line

Third line

Fourth line

Fifth line

\end{verbatim}

\subsection{File method: \texttt{file.readline}}
\label{sec:orgf67b39d}
\begin{itemize}
\item This method returns the next line as a \textbf{string}.
\item This method also moves the current file position forward.
\item When the current file position reaches the end of the file, every read will yield an empty string \texttt{""}.
\item Using the \texttt{seek} method is required to read the file again.
\item Closing and reopening the file also works, but is far less efficient.
\end{itemize}

\begin{minted}[]{python}
file = open("A_text_file.txt", "r")

# No end character as the lines in the file already
# include the new line character
print(file.readline(), end="")
print(file.readline(), end="")
print(file.readline(), end="")
file.close()
\end{minted}

 \noindent Output:

\begin{verbatim}
First line: €
Second line
Third line
\end{verbatim}


 \newpage

\subsection{File method: \texttt{file.readlines}}
\label{sec:orge2dd690}
\begin{itemize}
\item This method returns a list of all the lines from the file.
\item This method also moves the current file position forward.
\item When the current file position reaches the end of the file, every read will yield an empty string \texttt{""}.
\item Using the \texttt{seek} method is required to read the file again.
\item Closing and reopening the file also works, but is far less efficient.
\end{itemize}

\begin{minted}[]{python}
file = open("A_text_file.txt", "r")
print(file.readlines())
file.close()
\end{minted}

 \noindent Output:

\begin{verbatim}
['First line: €\n', 'Second line\n', 'Third line\n', 'Fourth line\n', 'Fifth line\n']
\end{verbatim}


 \newpage

\subsection{File method: \texttt{file.read}}
\label{sec:org34d1915}
\begin{itemize}
\item This method takes an \textbf{integer}, which represents how many \textbf{characters} is to be read from the file.
\item If this integer is not given, then the entire file is read and returned as a single string.
\item This method also moves the current file position forward.
\item When the current file position reaches the end of the file, every read will yield an empty string \texttt{""}.
\item Using the \texttt{seek} method is required to read the file again.
\item Closing and reopening the file also works, but is far less efficient.
\end{itemize}

\begin{minted}[]{python}
file = open("A_text_file.txt", "r")
print(file.read(5))
file.close()
\end{minted}

 \noindent Output:

\begin{verbatim}
First
\end{verbatim}


\begin{minted}[]{python}
file = open("A_text_file.txt", "r")
print(file.read())
file.close()
\end{minted}

 \noindent Output:

\begin{verbatim}
First line: €
Second line
Third line
Fourth line
Fifth line

\end{verbatim}

\subsection{File method: \texttt{file.write}}
\label{sec:org40d4adb}
This method takes a \textbf{string} and writes it to the file.
\begin{minted}[]{python}
file = open("temp.txt", "w")
file.write("First line\n")
file.write("Second line\n")
file.close()
\end{minted}

\subsection{File method: \texttt{file.writelines}}
\label{sec:org077863c}
This method takes a \textbf{list of strings} and writes it to the file.
\begin{minted}[]{python}
file = open("temp.txt", "w")
lines = ["First line\n", "Second line\n"]
file.writelines(lines)
file.close()
\end{minted}

\subsection{File method: \texttt{file.tell}}
\label{sec:org292bbd9}
\begin{itemize}
\item This method tells returns an \textbf{integer} representing the \textbf{current file position}.
\item The positions are in \textbf{bytes} from the \textbf{beginning} of the file.
\item This is not necessarily the same as the number of characters, as it depends on encoding.
\item Some characters may take multiple bytes, like the euro symbol in the example below.
\end{itemize}

\begin{minted}[]{python}
file = open("A_text_file.txt", "r")
print(file.tell())
print(file.read(11))
print(file.tell())
print(file.read(1))
print(file.tell())
print(file.read(1))
print(file.tell())
file.close()
\end{minted}

 \noindent Output:

\begin{verbatim}
0
First line:
11
 
12
€
15
\end{verbatim}

\subsection{File method: \texttt{file.seek}}
\label{sec:org1cf3f95}
This method takes an \textbf{integer} representing the offset in \textbf{bytes} from the \textbf{beginning} of the file and updates the current file position that position.
\begin{minted}[]{python}
# Seek to the beginning of the file
file.seek(0)

# Seek to 100 bytes from the beginning of the file
file.seek(100)
\end{minted}

\subsubsection{Example}
\label{sec:org8979809}
\begin{minted}[]{python}
file = open("A_text_file.txt", "r")
print(file.read(12))
print(file.tell())
print(file.read(1))
print(file.tell())
print(file.seek(6))
print(file.read(4))
file.close()
\end{minted}

 \noindent Output:

\begin{verbatim}
First line: 
12
€
15
6
line
\end{verbatim}


 \newpage

\subsubsection{\texttt{whence} parameter (optional)}
\label{sec:org7f9b429}
\begin{itemize}
\item \texttt{whence} takes an \textbf{integer}, either \texttt{0}, \texttt{1} or \texttt{2}, and represents file positioning.
\item This parameter defaults to \texttt{0}, which is to count from the beginning of the file.
\begin{itemize}
\item \texttt{0} means to count from the beginning of the file.
\item \texttt{1} means to count from the current position in the file.
\item \texttt{2} means to count from the end of the file. This option is usually paired with a negative offset.
\end{itemize}

\item In text files, only seeks relative to the beginning of the file are allowed.
\item An exception to this is the seek to the end of the file, like \texttt{file.seek(0, 2)}.
\end{itemize}

\begin{minted}[]{python}

# Go to 100 bytes before the end of the file
file.seek(-100, 2)

# Go to 5 bytes from the current file position
file.seek(5, 1)
\end{minted}

 \newpage
