y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
** ~math~ module method: ~math.floor~
- This method takes a number and returns an *integer (~int~)* rounded *down* to the nearest integer.
- It works the same as the floor division operator (~//~), except that it always returns an *integer (~int~)*.
- The ~math~ module must be *imported before* using this function.

#+NAME: math-floor
#+begin_src python :results output :exports both
import math
print(math.floor(6))
print(math.floor(6.9))
print(math.floor(420.42))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: math-floor
: 6
: 6
: 420

** ~math~ module method: ~math.sin~
- This method takes an angle in *radians* and returns the sine of the angle.
- In general, all trigonometric functions in the ~math~ module take an angle in *radians*.
- The ~math~ module must be *imported before* using this function.

#+NAME: math-sin
#+begin_src python :results output :exports both
import math
print(math.sin(math.pi / 2))
print(math.sin(0))
print(math.sin(90))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: math-sin
: 1.0
: 0.0
: 0.8939966636005579

** ~math~ module method: ~math.cos~
- This method takes an angle in *radians* and returns the cosine of the angle.
- In general, all trigonometric functions in the ~math~ module take an angle in *radians*.
- The ~math~ module must be *imported before* using this function.

#+NAME: math-cos
#+begin_src python :results output :exports both
import math
print(math.cos(math.pi / 2))
print(math.cos(0))
print(math.cos(90))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: math-cos
: 6.123233995736766e-17
: 1.0
: -0.4480736161291701

@@latex: \newpage@@

** ~operator~ module method: ~operator.itemgetter~
- This method takes *indexes* for a list or tuple, or *keys* for a dictionary and returns a *function*.
- When there is *only one* index or key given, the *value* is returned.
- When there is *more than one* index or key given, a *tuple* of the values is returned.
- This method can be used with the ~sorted~ function to get the value for sorting.

#+NAME: operator-itemgetter
#+begin_src python :results output :exports both
import operator

num_list = [10, 6, 3, 1, 9]
num_dict = {
    10: "ten",
    6: "six",
    3: "three",
    1: "one",
    9: "nine"
}

# Print the second item of the list
print(operator.itemgetter(1)(num_list))

# Sort the dictionary based on the values of the dictionary,
# which is to sort by alphabetical order
print(sorted(num_dict.items(), key=operator.itemgetter(1)))
#+end_src

@@latex: \noindent@@ Output:

#+RESULTS: operator-itemgetter
: 6
: [(9, 'nine'), (1, 'one'), (6, 'six'), (10, 'ten'), (3, 'three')]

@@latex: \newpage@@

* Operator precedence

#+ATTR_LATEX: :environment tabular :align c|c|c|c
| *Precedence* | *Associativity* | *Operator*                     | *Description*               |
|--------------+-----------------+--------------------------------+-----------------------------|
|           18 | Left-to-right   | ~()~                           | Parentheses (grouping)      |
|           17 | Left-to-right   | ~f(args...)~                   | Function call               |
|           16 | Left-to-right   | ~x[index:index]~               | Slicing                     |
|           15 | Left-to-right   | ~x[index]~                     | Indexing an array           |
|           14 | Right-to-left   | ~**~                           | Exponentiation              |
|           13 | Left-to-right   | ~~x~                           | Bitwise not                 |
|           12 | Left-to-right   | ~+x~                           | Positive                    |
|           12 | Left-to-right   | ~-x~                           | Negative                    |
|           11 | Left-to-right   | ~*~                            | Multiplication              |
|           11 | Left-to-right   | ~/~                            | Division                    |
|           11 | Left-to-right   | ~%~                            | Modulo (Remainder operator) |
|           10 | Left-to-right   | ~+~                            | Addition                    |
|           10 | Left-to-right   | ~-~                            | Subtraction                 |
|            9 | Left-to-right   | ~<<~                           | Bitwise left shift          |
|            9 | Left-to-right   | ~>>~                           | Bitwise right shift         |
|            8 | Left-to-right   | ~&~                            | Bitwise AND                 |
|            7 | Left-to-right   | ~^~                            | Bitwise XOR                 |
|            6 | Left-to-right   | \vert                          | Bitwise OR                  |
|            5 | Left-to-right   | ~in~, ~not in~, ~is~, ~is not~ | Membership                  |
|            5 | Left-to-right   | ~<~, ~<=~, ~>~, ~>=~           | Relational                  |
|            5 | Left-to-right   | ~<>~, ~==~                     | Equality                    |
|            5 | Left-to-right   | ~!=~                           | Inequality                  |
|            4 | Left-to-right   | ~not x~                        | Boolean NOT                 |
|            3 | Left-to-right   | ~and~                          | Boolean AND                 |
|            2 | Left-to-right   | ~or~                           | Boolean OR                  |
|            1 | Left-to-right   | ~lambda~                       | Lambda expression           |

@@latex: \newpage@@

