y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.tex

\subsection{\texttt{math} module method: \texttt{math.floor}}
\label{sec:org2e584e8}
\begin{itemize}
\item This method takes a number and returns an \textbf{integer (\texttt{int})} rounded \textbf{down} to the nearest integer.
\item It works the same as the floor division operator (\texttt{//}), except that it always returns an \textbf{integer (\texttt{int})}.
\item The \texttt{math} module must be \textbf{imported before} using this function.
\end{itemize}

\begin{minted}[]{python}
import math
print(math.floor(6))
print(math.floor(6.9))
print(math.floor(420.42))
\end{minted}

 \noindent Output:

\begin{verbatim}
6
6
420
\end{verbatim}

\subsection{\texttt{math} module method: \texttt{math.sin}}
\label{sec:org1988756}
\begin{itemize}
\item This method takes an angle in \textbf{radians} and returns the sine of the angle.
\item In general, all trigonometric functions in the \texttt{math} module take an angle in \textbf{radians}.
\item The \texttt{math} module must be \textbf{imported before} using this function.
\end{itemize}

\begin{minted}[]{python}
import math
print(math.sin(math.pi / 2))
print(math.sin(0))
print(math.sin(90))
\end{minted}

 \noindent Output:

\begin{verbatim}
1.0
0.0
0.8939966636005579
\end{verbatim}

\subsection{\texttt{math} module method: \texttt{math.cos}}
\label{sec:org55ccdd3}
\begin{itemize}
\item This method takes an angle in \textbf{radians} and returns the cosine of the angle.
\item In general, all trigonometric functions in the \texttt{math} module take an angle in \textbf{radians}.
\item The \texttt{math} module must be \textbf{imported before} using this function.
\end{itemize}

\begin{minted}[]{python}
import math
print(math.cos(math.pi / 2))
print(math.cos(0))
print(math.cos(90))
\end{minted}

 \noindent Output:

\begin{verbatim}
6.123233995736766e-17
1.0
-0.4480736161291701
\end{verbatim}


 \newpage

\subsection{\texttt{operator} module method: \texttt{operator.itemgetter}}
\label{sec:org575fa63}
\begin{itemize}
\item This method takes \textbf{indexes} for a list or tuple, or \textbf{keys} for a dictionary and returns a \textbf{function}.
\item When there is \textbf{only one} index or key given, the \textbf{value} is returned.
\item When there is \textbf{more than one} index or key given, a \textbf{tuple} of the values is returned.
\item This method can be used with the \texttt{sorted} function to get the value for sorting.
\end{itemize}

\begin{minted}[]{python}
import operator

num_list = [10, 6, 3, 1, 9]
num_dict = {
    10: "ten",
    6: "six",
    3: "three",
    1: "one",
    9: "nine"
}

# Print the second item of the list
print(operator.itemgetter(1)(num_list))

# Sort the dictionary based on the values of the dictionary,
# which is to sort by alphabetical order
print(sorted(num_dict.items(), key=operator.itemgetter(1)))
\end{minted}

 \noindent Output:

\begin{verbatim}
6
[(9, 'nine'), (1, 'one'), (6, 'six'), (10, 'ten'), (3, 'three')]
\end{verbatim}


 \newpage

\section{Operator precedence}
\label{sec:orgcc39e3d}

\begin{center}
\begin{tabular}{c|c|c|c}
\textbf{Precedence} & \textbf{Associativity} & \textbf{Operator} & \textbf{Description}\\[0pt]
\hline
18 & Left-to-right & \texttt{()} & Parentheses (grouping)\\[0pt]
17 & Left-to-right & \texttt{f(args...)} & Function call\\[0pt]
16 & Left-to-right & \texttt{x[index:index]} & Slicing\\[0pt]
15 & Left-to-right & \texttt{x[index]} & Indexing an array\\[0pt]
14 & Right-to-left & \texttt{**} & Exponentiation\\[0pt]
13 & Left-to-right & \texttt{\textasciitilde{}x} & Bitwise not\\[0pt]
12 & Left-to-right & \texttt{+x} & Positive\\[0pt]
12 & Left-to-right & \texttt{-x} & Negative\\[0pt]
11 & Left-to-right & \texttt{*} & Multiplication\\[0pt]
11 & Left-to-right & \texttt{/} & Division\\[0pt]
11 & Left-to-right & \texttt{\%} & Modulo (Remainder operator)\\[0pt]
10 & Left-to-right & \texttt{+} & Addition\\[0pt]
10 & Left-to-right & \texttt{-} & Subtraction\\[0pt]
9 & Left-to-right & \texttt{<{}<{}} & Bitwise left shift\\[0pt]
9 & Left-to-right & \texttt{>{}>{}} & Bitwise right shift\\[0pt]
8 & Left-to-right & \texttt{\&} & Bitwise AND\\[0pt]
7 & Left-to-right & \texttt{\textasciicircum{}} & Bitwise XOR\\[0pt]
6 & Left-to-right & \(\vert{}\) & Bitwise OR\\[0pt]
5 & Left-to-right & \texttt{in}, \texttt{not in}, \texttt{is}, \texttt{is not} & Membership\\[0pt]
5 & Left-to-right & \texttt{<}, \texttt{<=}, \texttt{>}, \texttt{>=} & Relational\\[0pt]
5 & Left-to-right & \texttt{<>}, \texttt{==} & Equality\\[0pt]
5 & Left-to-right & \texttt{!=} & Inequality\\[0pt]
4 & Left-to-right & \texttt{not x} & Boolean NOT\\[0pt]
3 & Left-to-right & \texttt{and} & Boolean AND\\[0pt]
2 & Left-to-right & \texttt{or} & Boolean OR\\[0pt]
1 & Left-to-right & \texttt{lambda} & Lambda expression\\[0pt]
\end{tabular}
\end{center}

 \newpage
