y1s2/ma1008-introduction-to-computational-thinking/cheat-sheet.org
* ASCII Table

#+ATTR_LATEX: :environment longtable
| DEC | OCT | HEX |      BIN | Symbol | Description                            |
|-----+-----+-----+----------+--------+----------------------------------------|
|  32 | 040 |  20 | 00100000 | SP     | Space                                  |
|  33 | 041 |  21 | 00100001 | !      | Exclamation mark                       |
|  34 | 042 |  22 | 00100010 | "      | Double quotes (or speech marks)        |
|  35 | 043 |  23 | 00100011 | #      | Number sign                            |
|  36 | 044 |  24 | 00100100 | $      | Dollar                                 |
|  37 | 045 |  25 | 00100101 | %      | Per cent sign                          |
|  38 | 046 |  26 | 00100110 | &      | Ampersand                              |
|  39 | 047 |  27 | 00100111 | '      | Single quote                           |
|  40 | 050 |  28 | 00101000 | (      | Open parenthesis (or open bracket)     |
|  41 | 051 |  29 | 00101001 | )      | Close parenthesis (or close bracket)   |
|  42 | 052 |  2A | 00101010 | *      | Asterisk                               |
|  43 | 053 |  2B | 00101011 | +      | Plus                                   |
|  44 | 054 |  2C | 00101100 | ,      | Comma                                  |
|  45 | 055 |  2D | 00101101 | -      | Hyphen-minus                           |
|  46 | 056 |  2E | 00101110 | .      | Period, dot or full stop               |
|  47 | 057 |  2F | 00101111 | /      | Slash or divide                        |
|  48 | 060 |  30 | 00110000 | 0      | Zero                                   |
|  49 | 061 |  31 | 00110001 | 1      | One                                    |
|  50 | 062 |  32 | 00110010 | 2      | Two                                    |
|  51 | 063 |  33 | 00110011 | 3      | Three                                  |
|  52 | 064 |  34 | 00110100 | 4      | Four                                   |
|  53 | 065 |  35 | 00110101 | 5      | Five                                   |
|  54 | 066 |  36 | 00110110 | 6      | Six                                    |
|  55 | 067 |  37 | 00110111 | 7      | Seven                                  |
|  56 | 070 |  38 | 00111000 | 8      | Eight                                  |
|  57 | 071 |  39 | 00111001 | 9      | Nine                                   |
|  58 | 072 |  3A | 00111010 | :      | Colon                                  |
|  59 | 073 |  3B | 00111011 | ;      | Semicolon                              |
|  60 | 074 |  3C | 00111100 | <      | Less than (or open angled bracket)     |
|  61 | 075 |  3D | 00111101 | =      | Equals                                 |
|  62 | 076 |  3E | 00111110 | >      | Greater than (or close angled bracket) |
|  63 | 077 |  3F | 00111111 | ?      | Question mark                          |
|  64 | 100 |  40 | 01000000 | @      | At sign                                |
|  65 | 101 |  41 | 01000001 | A      | Uppercase A                            |
|  66 | 102 |  42 | 01000010 | B      | Uppercase B                            |
|  67 | 103 |  43 | 01000011 | C      | Uppercase C                            |
|  68 | 104 |  44 | 01000100 | D      | Uppercase D                            |
|  69 | 105 |  45 | 01000101 | E      | Uppercase E                            |
|  70 | 106 |  46 | 01000110 | F      | Uppercase F                            |
|  71 | 107 |  47 | 01000111 | G      | Uppercase G                            |
|  72 | 110 |  48 | 01001000 | H      | Uppercase H                            |
|  73 | 111 |  49 | 01001001 | I      | Uppercase I                            |
|  74 | 112 |  4A | 01001010 | J      | Uppercase J                            |
|  75 | 113 |  4B | 01001011 | K      | Uppercase K                            |
|  76 | 114 |  4C | 01001100 | L      | Uppercase L                            |
|  77 | 115 |  4D | 01001101 | M      | Uppercase M                            |
|  78 | 116 |  4E | 01001110 | N      | Uppercase N                            |
|  79 | 117 |  4F | 01001111 | O      | Uppercase O                            |
|  80 | 120 |  50 | 01010000 | P      | Uppercase P                            |
|  81 | 121 |  51 | 01010001 | Q      | Uppercase Q                            |
|  82 | 122 |  52 | 01010010 | R      | Uppercase R                            |
|  83 | 123 |  53 | 01010011 | S      | Uppercase S                            |
|  84 | 124 |  54 | 01010100 | T      | Uppercase T                            |
|  85 | 125 |  55 | 01010101 | U      | Uppercase U                            |
|  86 | 126 |  56 | 01010110 | V      | Uppercase V                            |
|  87 | 127 |  57 | 01010111 | W      | Uppercase W                            |
|  88 | 130 |  58 | 01011000 | X      | Uppercase X                            |
|  89 | 131 |  59 | 01011001 | Y      | Uppercase Y                            |
|  90 | 132 |  5A | 01011010 | Z      | Uppercase Z                            |
|  91 | 133 |  5B | 01011011 | [      | Opening bracket                        |
|  92 | 134 |  5C | 01011100 | \      | Backslash                              |
|  93 | 135 |  5D | 01011101 | ]      | Closing bracket                        |
|  94 | 136 |  5E | 01011110 | ^      | Caret - circumflex                     |
|  95 | 137 |  5F | 01011111 | _      | Underscore                             |
|  96 | 140 |  60 | 01100000 | `      | Grave accent                           |
|  97 | 141 |  61 | 01100001 | a      | Lowercase a                            |
|  98 | 142 |  62 | 01100010 | b      | Lowercase b                            |
|  99 | 143 |  63 | 01100011 | c      | Lowercase c                            |
| 100 | 144 |  64 | 01100100 | d      | Lowercase d                            |
| 101 | 145 |  65 | 01100101 | e      | Lowercase e                            |
| 102 | 146 |  66 | 01100110 | f      | Lowercase f                            |
| 103 | 147 |  67 | 01100111 | g      | Lowercase g                            |
| 104 | 150 |  68 | 01101000 | h      | Lowercase h                            |
| 105 | 151 |  69 | 01101001 | i      | Lowercase i                            |
| 106 | 152 |  6A | 01101010 | j      | Lowercase j                            |
| 107 | 153 |  6B | 01101011 | k      | Lowercase k                            |
| 108 | 154 |  6C | 01101100 | l      | Lowercase l                            |
| 109 | 155 |  6D | 01101101 | m      | Lowercase m                            |
| 110 | 156 |  6E | 01101110 | n      | Lowercase n                            |
| 111 | 157 |  6F | 01101111 | o      | Lowercase o                            |
| 112 | 160 |  70 | 01110000 | p      | Lowercase p                            |
| 113 | 161 |  71 | 01110001 | q      | Lowercase q                            |
| 114 | 162 |  72 | 01110010 | r      | Lowercase r                            |
| 115 | 163 |  73 | 01110011 | s      | Lowercase s                            |
| 116 | 164 |  74 | 01110100 | t      | Lowercase t                            |
| 117 | 165 |  75 | 01110101 | u      | Lowercase u                            |
| 118 | 166 |  76 | 01110110 | v      | Lowercase v                            |
| 119 | 167 |  77 | 01110111 | w      | Lowercase w                            |
| 120 | 170 |  78 | 01111000 | x      | Lowercase x                            |
| 121 | 171 |  79 | 01111001 | y      | Lowercase y                            |
| 122 | 172 |  7A | 01111010 | z      | Lowercase z                            |
| 123 | 173 |  7B | 01111011 | {      | Opening brace                          |
| 124 | 174 |  7C | 01111100 | \vert  | Vertical bar                           |
| 125 | 175 |  7D | 01111101 | }      | Closing brace                          |
| 126 | 176 |  7E | 01111110 | ~      | Equivalency sign - tilde               |
| 127 | 177 |  7F | 01111111 | DEL    | Delete                                 |
